TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Thu Mar 19 12:43:51 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *
      12                    ;*   Optimizing for    : Speed                                                *

    3692                            .dwattr $C$DW$324, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\../common
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   74

    3693                            .dwattr $C$DW$324, DW_AT_decl_line(0x72)
    3694                            .dwattr $C$DW$324, DW_AT_decl_column(0x05)
    3695                    $C$DW$325       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    3696                            .dwattr $C$DW$325, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\../common
    3697                            .dwattr $C$DW$325, DW_AT_decl_line(0x73)
    3698                            .dwattr $C$DW$325, DW_AT_decl_column(0x05)
    3699                            .dwendtag $C$DW$T$69
    3700                    
    3701                            .dwattr $C$DW$T$69, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\../commo
    3702                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x71)
    3703                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x06)
    3704                    
    3705                    $C$DW$T$70      .dwtag  DW_TAG_enumeration_type
    3706                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x04)
    3707                    $C$DW$326       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_FALSE"), DW_AT_const_value(0x00)
    3708                            .dwattr $C$DW$326, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    3709                            .dwattr $C$DW$326, DW_AT_decl_line(0x8f)
    3710                            .dwattr $C$DW$326, DW_AT_decl_column(0x05)
    3711                    $C$DW$327       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_TRUE"), DW_AT_const_value(0x01)
    3712                            .dwattr $C$DW$327, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    3713                            .dwattr $C$DW$327, DW_AT_decl_line(0x90)
    3714                            .dwattr $C$DW$327, DW_AT_decl_column(0x05)
    3715                            .dwendtag $C$DW$T$70
    3716                    
    3717                            .dwattr $C$DW$T$70, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    3718                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x8e)
    3719                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x0e)
    3720                    $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("CORB_Bool")
    3721                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    3722                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    3723                            .dwattr $C$DW$T$71, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    3724                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x91)
    3725                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x02)
    3726                    
    3727                    $C$DW$T$72      .dwtag  DW_TAG_enumeration_type
    3728                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x04)
    3729                    $C$DW$328       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_OK"), DW_AT_const_value(0x00)
    3730                            .dwattr $C$DW$328, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    3731                            .dwattr $C$DW$328, DW_AT_decl_line(0xa2)
    3732                            .dwattr $C$DW$328, DW_AT_decl_column(0x05)
    3733                    $C$DW$329       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_FAIL"), DW_AT_const_value(-1)
    3734                            .dwattr $C$DW$329, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    3735                            .dwattr $C$DW$329, DW_AT_decl_line(0xa3)
    3736                            .dwattr $C$DW$329, DW_AT_decl_column(0x05)
    3737                            .dwendtag $C$DW$T$72
    3738                    
    3739                            .dwattr $C$DW$T$72, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    3740                            .dwattr $C$DW$T$72, DW_AT_decl_line(0xa1)
    3741                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x0e)
    3742                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("CORBResult")
    3743                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    3744                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3745                            .dwattr $C$DW$T$73, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    3746                            .dwattr $C$DW$T$73, DW_AT_decl_line(0xa4)
    3747                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x02)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   75

    3748                    
    3749                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3750                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x20)
    3751                    $C$DW$330       .dwtag  DW_TAG_member
    3752                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$20)
    3753                            .dwattr $C$DW$330, DW_AT_name("val")
    3754                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("val")
    3755                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3756                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    3757                            .dwattr $C$DW$330, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\../common
    3758                            .dwattr $C$DW$330, DW_AT_decl_line(0x25)
    3759                            .dwattr $C$DW$330, DW_AT_decl_column(0x0c)
    3760                            .dwendtag $C$DW$T$21
    3761                    
    3762                            .dwattr $C$DW$T$21, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\../commo
    3763                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x24)
    3764                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    3765                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("RotationMatrix")
    3766                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$21)
    3767                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3768                            .dwattr $C$DW$T$78, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\../commo
    3769                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x26)
    3770                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x02)
    3771                    $C$DW$T$80      .dwtag  DW_TAG_const_type
    3772                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$78)
    3773                    
    3774                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3775                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x24)
    3776                    $C$DW$331       .dwtag  DW_TAG_member
    3777                            .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$22)
    3778                            .dwattr $C$DW$331, DW_AT_name("testPattern")
    3779                            .dwattr $C$DW$331, DW_AT_TI_symbol_name("testPattern")
    3780                            .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3781                            .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    3782                            .dwattr $C$DW$331, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\VLIB_ORB_
    3783                            .dwattr $C$DW$331, DW_AT_decl_line(0x24)
    3784                            .dwattr $C$DW$331, DW_AT_decl_column(0x0f)
    3785                    $C$DW$332       .dwtag  DW_TAG_member
    3786                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$24)
    3787                            .dwattr $C$DW$332, DW_AT_name("staticInFeatures")
    3788                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("staticInFeatures")
    3789                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3790                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    3791                            .dwattr $C$DW$332, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\VLIB_ORB_
    3792                            .dwattr $C$DW$332, DW_AT_decl_line(0x25)
    3793                            .dwattr $C$DW$332, DW_AT_decl_column(0x0f)
    3794                    $C$DW$333       .dwtag  DW_TAG_member
    3795                            .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$26)
    3796                            .dwattr $C$DW$333, DW_AT_name("staticInIntegral")
    3797                            .dwattr $C$DW$333, DW_AT_TI_symbol_name("staticInIntegral")
    3798                            .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3799                            .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    3800                            .dwattr $C$DW$333, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\VLIB_ORB_
    3801                            .dwattr $C$DW$333, DW_AT_decl_line(0x26)
    3802                            .dwattr $C$DW$333, DW_AT_decl_column(0x0f)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   76

    3803                    $C$DW$334       .dwtag  DW_TAG_member
    3804                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$27)
    3805                            .dwattr $C$DW$334, DW_AT_name("staticInAngle")
    3806                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("staticInAngle")
    3807                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3808                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    3809                            .dwattr $C$DW$334, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\VLIB_ORB_
    3810                            .dwattr $C$DW$334, DW_AT_decl_line(0x27)
    3811                            .dwattr $C$DW$334, DW_AT_decl_column(0x0f)
    3812                    $C$DW$335       .dwtag  DW_TAG_member
    3813                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$28)
    3814                            .dwattr $C$DW$335, DW_AT_name("staticOut")
    3815                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("staticOut")
    3816                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3817                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    3818                            .dwattr $C$DW$335, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\VLIB_ORB_
    3819                            .dwattr $C$DW$335, DW_AT_decl_line(0x28)
    3820                            .dwattr $C$DW$335, DW_AT_decl_column(0x0f)
    3821                    $C$DW$336       .dwtag  DW_TAG_member
    3822                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$30)
    3823                            .dwattr $C$DW$336, DW_AT_name("orbPattern")
    3824                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("orbPattern")
    3825                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3826                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    3827                            .dwattr $C$DW$336, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\VLIB_ORB_
    3828                            .dwattr $C$DW$336, DW_AT_decl_line(0x29)
    3829                            .dwattr $C$DW$336, DW_AT_decl_column(0x0f)
    3830                    $C$DW$337       .dwtag  DW_TAG_member
    3831                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$23)
    3832                            .dwattr $C$DW$337, DW_AT_name("imageWidth")
    3833                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("imageWidth")
    3834                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3835                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    3836                            .dwattr $C$DW$337, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\VLIB_ORB_
    3837                            .dwattr $C$DW$337, DW_AT_decl_line(0x2a)
    3838                            .dwattr $C$DW$337, DW_AT_decl_column(0x0f)
    3839                    $C$DW$338       .dwtag  DW_TAG_member
    3840                            .dwattr $C$DW$338, DW_AT_type(*$C$DW$T$23)
    3841                            .dwattr $C$DW$338, DW_AT_name("imageHeight")
    3842                            .dwattr $C$DW$338, DW_AT_TI_symbol_name("imageHeight")
    3843                            .dwattr $C$DW$338, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3844                            .dwattr $C$DW$338, DW_AT_accessibility(DW_ACCESS_public)
    3845                            .dwattr $C$DW$338, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\VLIB_ORB_
    3846                            .dwattr $C$DW$338, DW_AT_decl_line(0x2b)
    3847                            .dwattr $C$DW$338, DW_AT_decl_column(0x0f)
    3848                    $C$DW$339       .dwtag  DW_TAG_member
    3849                            .dwattr $C$DW$339, DW_AT_type(*$C$DW$T$25)
    3850                            .dwattr $C$DW$339, DW_AT_name("true_num_features")
    3851                            .dwattr $C$DW$339, DW_AT_TI_symbol_name("true_num_features")
    3852                            .dwattr $C$DW$339, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3853                            .dwattr $C$DW$339, DW_AT_accessibility(DW_ACCESS_public)
    3854                            .dwattr $C$DW$339, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\VLIB_ORB_
    3855                            .dwattr $C$DW$339, DW_AT_decl_line(0x2c)
    3856                            .dwattr $C$DW$339, DW_AT_decl_column(0x0f)
    3857                    $C$DW$340       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   77

    3858                            .dwattr $C$DW$340, DW_AT_type(*$C$DW$T$32)
    3859                            .dwattr $C$DW$340, DW_AT_name("desc")
    3860                            .dwattr $C$DW$340, DW_AT_TI_symbol_name("desc")
    3861                            .dwattr $C$DW$340, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3862                            .dwattr $C$DW$340, DW_AT_accessibility(DW_ACCESS_public)
    3863                            .dwattr $C$DW$340, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\VLIB_ORB_
    3864                            .dwattr $C$DW$340, DW_AT_decl_line(0x2d)
    3865                            .dwattr $C$DW$340, DW_AT_decl_column(0x0f)
    3866                            .dwendtag $C$DW$T$33
    3867                    
    3868                            .dwattr $C$DW$T$33, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\VLIB_ORB
    3869                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x23)
    3870                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3871                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    3872                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$33)
    3873                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    3874                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("orb_computeRBrief_testParams_t")
    3875                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$33)
    3876                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3877                            .dwattr $C$DW$T$83, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\VLIB_ORB
    3878                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x2e)
    3879                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
    3880                    $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    3881                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3882                            .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
    3883                    $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    3884                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    3885                            .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
    3886                    
    3887                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3888                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x18)
    3889                    $C$DW$341       .dwtag  DW_TAG_member
    3890                            .dwattr $C$DW$341, DW_AT_type(*$C$DW$T$10)
    3891                            .dwattr $C$DW$341, DW_AT_name("fd")
    3892                            .dwattr $C$DW$341, DW_AT_TI_symbol_name("fd")
    3893                            .dwattr $C$DW$341, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3894                            .dwattr $C$DW$341, DW_AT_accessibility(DW_ACCESS_public)
    3895                            .dwattr $C$DW$341, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3896                            .dwattr $C$DW$341, DW_AT_decl_line(0x49)
    3897                            .dwattr $C$DW$341, DW_AT_decl_column(0x0b)
    3898                    $C$DW$342       .dwtag  DW_TAG_member
    3899                            .dwattr $C$DW$342, DW_AT_type(*$C$DW$T$34)
    3900                            .dwattr $C$DW$342, DW_AT_name("buf")
    3901                            .dwattr $C$DW$342, DW_AT_TI_symbol_name("buf")
    3902                            .dwattr $C$DW$342, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3903                            .dwattr $C$DW$342, DW_AT_accessibility(DW_ACCESS_public)
    3904                            .dwattr $C$DW$342, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3905                            .dwattr $C$DW$342, DW_AT_decl_line(0x4a)
    3906                            .dwattr $C$DW$342, DW_AT_decl_column(0x16)
    3907                    $C$DW$343       .dwtag  DW_TAG_member
    3908                            .dwattr $C$DW$343, DW_AT_type(*$C$DW$T$34)
    3909                            .dwattr $C$DW$343, DW_AT_name("pos")
    3910                            .dwattr $C$DW$343, DW_AT_TI_symbol_name("pos")
    3911                            .dwattr $C$DW$343, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3912                            .dwattr $C$DW$343, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   78

    3913                            .dwattr $C$DW$343, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3914                            .dwattr $C$DW$343, DW_AT_decl_line(0x4b)
    3915                            .dwattr $C$DW$343, DW_AT_decl_column(0x16)
    3916                    $C$DW$344       .dwtag  DW_TAG_member
    3917                            .dwattr $C$DW$344, DW_AT_type(*$C$DW$T$34)
    3918                            .dwattr $C$DW$344, DW_AT_name("bufend")
    3919                            .dwattr $C$DW$344, DW_AT_TI_symbol_name("bufend")
    3920                            .dwattr $C$DW$344, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3921                            .dwattr $C$DW$344, DW_AT_accessibility(DW_ACCESS_public)
    3922                            .dwattr $C$DW$344, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3923                            .dwattr $C$DW$344, DW_AT_decl_line(0x4c)
    3924                            .dwattr $C$DW$344, DW_AT_decl_column(0x16)
    3925                    $C$DW$345       .dwtag  DW_TAG_member
    3926                            .dwattr $C$DW$345, DW_AT_type(*$C$DW$T$34)
    3927                            .dwattr $C$DW$345, DW_AT_name("buff_stop")
    3928                            .dwattr $C$DW$345, DW_AT_TI_symbol_name("buff_stop")
    3929                            .dwattr $C$DW$345, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3930                            .dwattr $C$DW$345, DW_AT_accessibility(DW_ACCESS_public)
    3931                            .dwattr $C$DW$345, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3932                            .dwattr $C$DW$345, DW_AT_decl_line(0x4d)
    3933                            .dwattr $C$DW$345, DW_AT_decl_column(0x16)
    3934                    $C$DW$346       .dwtag  DW_TAG_member
    3935                            .dwattr $C$DW$346, DW_AT_type(*$C$DW$T$11)
    3936                            .dwattr $C$DW$346, DW_AT_name("flags")
    3937                            .dwattr $C$DW$346, DW_AT_TI_symbol_name("flags")
    3938                            .dwattr $C$DW$346, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3939                            .dwattr $C$DW$346, DW_AT_accessibility(DW_ACCESS_public)
    3940                            .dwattr $C$DW$346, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3941                            .dwattr $C$DW$346, DW_AT_decl_line(0x4e)
    3942                            .dwattr $C$DW$346, DW_AT_decl_column(0x16)
    3943                            .dwendtag $C$DW$T$35
    3944                    
    3945                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3946                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x48)
    3947                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3948                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3949                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$35)
    3950                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3951                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3952                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x4f)
    3953                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x03)
    3954                    
    3955                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3956                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x08)
    3957                    $C$DW$347       .dwtag  DW_TAG_member
    3958                            .dwattr $C$DW$347, DW_AT_type(*$C$DW$T$10)
    3959                            .dwattr $C$DW$347, DW_AT_name("quot")
    3960                            .dwattr $C$DW$347, DW_AT_TI_symbol_name("quot")
    3961                            .dwattr $C$DW$347, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3962                            .dwattr $C$DW$347, DW_AT_accessibility(DW_ACCESS_public)
    3963                            .dwattr $C$DW$347, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3964                            .dwattr $C$DW$347, DW_AT_decl_line(0x3e)
    3965                            .dwattr $C$DW$347, DW_AT_decl_column(0x16)
    3966                    $C$DW$348       .dwtag  DW_TAG_member
    3967                            .dwattr $C$DW$348, DW_AT_type(*$C$DW$T$10)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   79

    3968                            .dwattr $C$DW$348, DW_AT_name("rem")
    3969                            .dwattr $C$DW$348, DW_AT_TI_symbol_name("rem")
    3970                            .dwattr $C$DW$348, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3971                            .dwattr $C$DW$348, DW_AT_accessibility(DW_ACCESS_public)
    3972                            .dwattr $C$DW$348, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3973                            .dwattr $C$DW$348, DW_AT_decl_line(0x3e)
    3974                            .dwattr $C$DW$348, DW_AT_decl_column(0x1c)
    3975                            .dwendtag $C$DW$T$36
    3976                    
    3977                            .dwattr $C$DW$T$36, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3978                            .dwattr $C$DW$T$36, DW_AT_decl_line(0x3e)
    3979                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    3980                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3981                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$36)
    3982                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3983                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3984                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x3e)
    3985                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x23)
    3986                    
    3987                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3988                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x08)
    3989                    $C$DW$349       .dwtag  DW_TAG_member
    3990                            .dwattr $C$DW$349, DW_AT_type(*$C$DW$T$10)
    3991                            .dwattr $C$DW$349, DW_AT_name("quot")
    3992                            .dwattr $C$DW$349, DW_AT_TI_symbol_name("quot")
    3993                            .dwattr $C$DW$349, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3994                            .dwattr $C$DW$349, DW_AT_accessibility(DW_ACCESS_public)
    3995                            .dwattr $C$DW$349, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3996                            .dwattr $C$DW$349, DW_AT_decl_line(0x40)
    3997                            .dwattr $C$DW$349, DW_AT_decl_column(0x17)
    3998                    $C$DW$350       .dwtag  DW_TAG_member
    3999                            .dwattr $C$DW$350, DW_AT_type(*$C$DW$T$10)
    4000                            .dwattr $C$DW$350, DW_AT_name("rem")
    4001                            .dwattr $C$DW$350, DW_AT_TI_symbol_name("rem")
    4002                            .dwattr $C$DW$350, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4003                            .dwattr $C$DW$350, DW_AT_accessibility(DW_ACCESS_public)
    4004                            .dwattr $C$DW$350, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4005                            .dwattr $C$DW$350, DW_AT_decl_line(0x40)
    4006                            .dwattr $C$DW$350, DW_AT_decl_column(0x1d)
    4007                            .dwendtag $C$DW$T$37
    4008                    
    4009                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4010                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x40)
    4011                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    4012                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    4013                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$37)
    4014                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    4015                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4016                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x40)
    4017                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x24)
    4018                    
    4019                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    4020                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x10)
    4021                    $C$DW$351       .dwtag  DW_TAG_member
    4022                            .dwattr $C$DW$351, DW_AT_type(*$C$DW$T$14)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   80

    4023                            .dwattr $C$DW$351, DW_AT_name("quot")
    4024                            .dwattr $C$DW$351, DW_AT_TI_symbol_name("quot")
    4025                            .dwattr $C$DW$351, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4026                            .dwattr $C$DW$351, DW_AT_accessibility(DW_ACCESS_public)
    4027                            .dwattr $C$DW$351, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4028                            .dwattr $C$DW$351, DW_AT_decl_line(0x43)
    4029                            .dwattr $C$DW$351, DW_AT_decl_column(0x1c)
    4030                    $C$DW$352       .dwtag  DW_TAG_member
    4031                            .dwattr $C$DW$352, DW_AT_type(*$C$DW$T$14)
    4032                            .dwattr $C$DW$352, DW_AT_name("rem")
    4033                            .dwattr $C$DW$352, DW_AT_TI_symbol_name("rem")
    4034                            .dwattr $C$DW$352, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4035                            .dwattr $C$DW$352, DW_AT_accessibility(DW_ACCESS_public)
    4036                            .dwattr $C$DW$352, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4037                            .dwattr $C$DW$352, DW_AT_decl_line(0x43)
    4038                            .dwattr $C$DW$352, DW_AT_decl_column(0x22)
    4039                            .dwendtag $C$DW$T$38
    4040                    
    4041                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4042                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x43)
    4043                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    4044                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    4045                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$38)
    4046                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    4047                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4048                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x43)
    4049                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x29)
    4050                    
    4051                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    4052                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x24)
    4053                    $C$DW$353       .dwtag  DW_TAG_member
    4054                            .dwattr $C$DW$353, DW_AT_type(*$C$DW$T$39)
    4055                            .dwattr $C$DW$353, DW_AT_name("area")
    4056                            .dwattr $C$DW$353, DW_AT_TI_symbol_name("area")
    4057                            .dwattr $C$DW$353, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4058                            .dwattr $C$DW$353, DW_AT_accessibility(DW_ACCESS_public)
    4059                            .dwattr $C$DW$353, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4060                            .dwattr $C$DW$353, DW_AT_decl_line(0x69)
    4061                            .dwattr $C$DW$353, DW_AT_decl_column(0x0d)
    4062                    $C$DW$354       .dwtag  DW_TAG_member
    4063                            .dwattr $C$DW$354, DW_AT_type(*$C$DW$T$39)
    4064                            .dwattr $C$DW$354, DW_AT_name("xsum")
    4065                            .dwattr $C$DW$354, DW_AT_TI_symbol_name("xsum")
    4066                            .dwattr $C$DW$354, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4067                            .dwattr $C$DW$354, DW_AT_accessibility(DW_ACCESS_public)
    4068                            .dwattr $C$DW$354, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4069                            .dwattr $C$DW$354, DW_AT_decl_line(0x6a)
    4070                            .dwattr $C$DW$354, DW_AT_decl_column(0x0d)
    4071                    $C$DW$355       .dwtag  DW_TAG_member
    4072                            .dwattr $C$DW$355, DW_AT_type(*$C$DW$T$39)
    4073                            .dwattr $C$DW$355, DW_AT_name("ysum")
    4074                            .dwattr $C$DW$355, DW_AT_TI_symbol_name("ysum")
    4075                            .dwattr $C$DW$355, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4076                            .dwattr $C$DW$355, DW_AT_accessibility(DW_ACCESS_public)
    4077                            .dwattr $C$DW$355, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   81

    4078                            .dwattr $C$DW$355, DW_AT_decl_line(0x6b)
    4079                            .dwattr $C$DW$355, DW_AT_decl_column(0x0d)
    4080                    $C$DW$356       .dwtag  DW_TAG_member
    4081                            .dwattr $C$DW$356, DW_AT_type(*$C$DW$T$39)
    4082                            .dwattr $C$DW$356, DW_AT_name("xmin")
    4083                            .dwattr $C$DW$356, DW_AT_TI_symbol_name("xmin")
    4084                            .dwattr $C$DW$356, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4085                            .dwattr $C$DW$356, DW_AT_accessibility(DW_ACCESS_public)
    4086                            .dwattr $C$DW$356, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4087                            .dwattr $C$DW$356, DW_AT_decl_line(0x6d)
    4088                            .dwattr $C$DW$356, DW_AT_decl_column(0x0d)
    4089                    $C$DW$357       .dwtag  DW_TAG_member
    4090                            .dwattr $C$DW$357, DW_AT_type(*$C$DW$T$39)
    4091                            .dwattr $C$DW$357, DW_AT_name("ymin")
    4092                            .dwattr $C$DW$357, DW_AT_TI_symbol_name("ymin")
    4093                            .dwattr $C$DW$357, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4094                            .dwattr $C$DW$357, DW_AT_accessibility(DW_ACCESS_public)
    4095                            .dwattr $C$DW$357, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4096                            .dwattr $C$DW$357, DW_AT_decl_line(0x6e)
    4097                            .dwattr $C$DW$357, DW_AT_decl_column(0x0d)
    4098                    $C$DW$358       .dwtag  DW_TAG_member
    4099                            .dwattr $C$DW$358, DW_AT_type(*$C$DW$T$39)
    4100                            .dwattr $C$DW$358, DW_AT_name("xmax")
    4101                            .dwattr $C$DW$358, DW_AT_TI_symbol_name("xmax")
    4102                            .dwattr $C$DW$358, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4103                            .dwattr $C$DW$358, DW_AT_accessibility(DW_ACCESS_public)
    4104                            .dwattr $C$DW$358, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4105                            .dwattr $C$DW$358, DW_AT_decl_line(0x6f)
    4106                            .dwattr $C$DW$358, DW_AT_decl_column(0x0d)
    4107                    $C$DW$359       .dwtag  DW_TAG_member
    4108                            .dwattr $C$DW$359, DW_AT_type(*$C$DW$T$39)
    4109                            .dwattr $C$DW$359, DW_AT_name("ymax")
    4110                            .dwattr $C$DW$359, DW_AT_TI_symbol_name("ymax")
    4111                            .dwattr $C$DW$359, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4112                            .dwattr $C$DW$359, DW_AT_accessibility(DW_ACCESS_public)
    4113                            .dwattr $C$DW$359, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4114                            .dwattr $C$DW$359, DW_AT_decl_line(0x70)
    4115                            .dwattr $C$DW$359, DW_AT_decl_column(0x0d)
    4116                    $C$DW$360       .dwtag  DW_TAG_member
    4117                            .dwattr $C$DW$360, DW_AT_type(*$C$DW$T$39)
    4118                            .dwattr $C$DW$360, DW_AT_name("seedx")
    4119                            .dwattr $C$DW$360, DW_AT_TI_symbol_name("seedx")
    4120                            .dwattr $C$DW$360, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4121                            .dwattr $C$DW$360, DW_AT_accessibility(DW_ACCESS_public)
    4122                            .dwattr $C$DW$360, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4123                            .dwattr $C$DW$360, DW_AT_decl_line(0x72)
    4124                            .dwattr $C$DW$360, DW_AT_decl_column(0x0d)
    4125                    $C$DW$361       .dwtag  DW_TAG_member
    4126                            .dwattr $C$DW$361, DW_AT_type(*$C$DW$T$39)
    4127                            .dwattr $C$DW$361, DW_AT_name("seedy")
    4128                            .dwattr $C$DW$361, DW_AT_TI_symbol_name("seedy")
    4129                            .dwattr $C$DW$361, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4130                            .dwattr $C$DW$361, DW_AT_accessibility(DW_ACCESS_public)
    4131                            .dwattr $C$DW$361, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4132                            .dwattr $C$DW$361, DW_AT_decl_line(0x73)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   82

    4133                            .dwattr $C$DW$361, DW_AT_decl_column(0x0d)
    4134                            .dwendtag $C$DW$T$40
    4135                    
    4136                            .dwattr $C$DW$T$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4137                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x68)
    4138                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    4139                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    4140                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$40)
    4141                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    4142                            .dwattr $C$DW$T$90, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4143                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x75)
    4144                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x03)
    4145                    
    4146                    $C$DW$T$42      .dwtag  DW_TAG_structure_type
    4147                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x10)
    4148                    $C$DW$362       .dwtag  DW_TAG_member
    4149                            .dwattr $C$DW$362, DW_AT_type(*$C$DW$T$8)
    4150                            .dwattr $C$DW$362, DW_AT_name("daylight")
    4151                            .dwattr $C$DW$362, DW_AT_TI_symbol_name("daylight")
    4152                            .dwattr $C$DW$362, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4153                            .dwattr $C$DW$362, DW_AT_accessibility(DW_ACCESS_public)
    4154                            .dwattr $C$DW$362, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4155                            .dwattr $C$DW$362, DW_AT_decl_line(0x52)
    4156                            .dwattr $C$DW$362, DW_AT_decl_column(0x0b)
    4157                    $C$DW$363       .dwtag  DW_TAG_member
    4158                            .dwattr $C$DW$363, DW_AT_type(*$C$DW$T$10)
    4159                            .dwattr $C$DW$363, DW_AT_name("timezone")
    4160                            .dwattr $C$DW$363, DW_AT_TI_symbol_name("timezone")
    4161                            .dwattr $C$DW$363, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4162                            .dwattr $C$DW$363, DW_AT_accessibility(DW_ACCESS_public)
    4163                            .dwattr $C$DW$363, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4164                            .dwattr $C$DW$363, DW_AT_decl_line(0x53)
    4165                            .dwattr $C$DW$363, DW_AT_decl_column(0x0b)
    4166                    $C$DW$364       .dwtag  DW_TAG_member
    4167                            .dwattr $C$DW$364, DW_AT_type(*$C$DW$T$41)
    4168                            .dwattr $C$DW$364, DW_AT_name("tzname")
    4169                            .dwattr $C$DW$364, DW_AT_TI_symbol_name("tzname")
    4170                            .dwattr $C$DW$364, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4171                            .dwattr $C$DW$364, DW_AT_accessibility(DW_ACCESS_public)
    4172                            .dwattr $C$DW$364, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4173                            .dwattr $C$DW$364, DW_AT_decl_line(0x54)
    4174                            .dwattr $C$DW$364, DW_AT_decl_column(0x0b)
    4175                    $C$DW$365       .dwtag  DW_TAG_member
    4176                            .dwattr $C$DW$365, DW_AT_type(*$C$DW$T$41)
    4177                            .dwattr $C$DW$365, DW_AT_name("dstname")
    4178                            .dwattr $C$DW$365, DW_AT_TI_symbol_name("dstname")
    4179                            .dwattr $C$DW$365, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4180                            .dwattr $C$DW$365, DW_AT_accessibility(DW_ACCESS_public)
    4181                            .dwattr $C$DW$365, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4182                            .dwattr $C$DW$365, DW_AT_decl_line(0x55)
    4183                            .dwattr $C$DW$365, DW_AT_decl_column(0x0b)
    4184                            .dwendtag $C$DW$T$42
    4185                    
    4186                            .dwattr $C$DW$T$42, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4187                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x51)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   83

    4188                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x01)
    4189                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    4190                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$42)
    4191                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    4192                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4193                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x56)
    4194                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    4195                    
    4196                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    4197                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x14)
    4198                    $C$DW$366       .dwtag  DW_TAG_member
    4199                            .dwattr $C$DW$366, DW_AT_type(*$C$DW$T$39)
    4200                            .dwattr $C$DW$366, DW_AT_name("width")
    4201                            .dwattr $C$DW$366, DW_AT_TI_symbol_name("width")
    4202                            .dwattr $C$DW$366, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4203                            .dwattr $C$DW$366, DW_AT_accessibility(DW_ACCESS_public)
    4204                            .dwattr $C$DW$366, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4205                            .dwattr $C$DW$366, DW_AT_decl_line(0xaa)
    4206                            .dwattr $C$DW$366, DW_AT_decl_column(0x0d)
    4207                    $C$DW$367       .dwtag  DW_TAG_member
    4208                            .dwattr $C$DW$367, DW_AT_type(*$C$DW$T$39)
    4209                            .dwattr $C$DW$367, DW_AT_name("height")
    4210                            .dwattr $C$DW$367, DW_AT_TI_symbol_name("height")
    4211                            .dwattr $C$DW$367, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4212                            .dwattr $C$DW$367, DW_AT_accessibility(DW_ACCESS_public)
    4213                            .dwattr $C$DW$367, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4214                            .dwattr $C$DW$367, DW_AT_decl_line(0xab)
    4215                            .dwattr $C$DW$367, DW_AT_decl_column(0x0d)
    4216                    $C$DW$368       .dwtag  DW_TAG_member
    4217                            .dwattr $C$DW$368, DW_AT_type(*$C$DW$T$39)
    4218                            .dwattr $C$DW$368, DW_AT_name("marginPixels")
    4219                            .dwattr $C$DW$368, DW_AT_TI_symbol_name("marginPixels")
    4220                            .dwattr $C$DW$368, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4221                            .dwattr $C$DW$368, DW_AT_accessibility(DW_ACCESS_public)
    4222                            .dwattr $C$DW$368, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4223                            .dwattr $C$DW$368, DW_AT_decl_line(0xac)
    4224                            .dwattr $C$DW$368, DW_AT_decl_column(0x0d)
    4225                    $C$DW$369       .dwtag  DW_TAG_member
    4226                            .dwattr $C$DW$369, DW_AT_type(*$C$DW$T$22)
    4227                            .dwattr $C$DW$369, DW_AT_name("fastDifferenceThreshold")
    4228                            .dwattr $C$DW$369, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    4229                            .dwattr $C$DW$369, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4230                            .dwattr $C$DW$369, DW_AT_accessibility(DW_ACCESS_public)
    4231                            .dwattr $C$DW$369, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4232                            .dwattr $C$DW$369, DW_AT_decl_line(0xae)
    4233                            .dwattr $C$DW$369, DW_AT_decl_column(0x0d)
    4234                    $C$DW$370       .dwtag  DW_TAG_member
    4235                            .dwattr $C$DW$370, DW_AT_type(*$C$DW$T$39)
    4236                            .dwattr $C$DW$370, DW_AT_name("n_features_desired")
    4237                            .dwattr $C$DW$370, DW_AT_TI_symbol_name("n_features_desired")
    4238                            .dwattr $C$DW$370, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4239                            .dwattr $C$DW$370, DW_AT_accessibility(DW_ACCESS_public)
    4240                            .dwattr $C$DW$370, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4241                            .dwattr $C$DW$370, DW_AT_decl_line(0xb2)
    4242                            .dwattr $C$DW$370, DW_AT_decl_column(0x0d)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   84

    4243                            .dwendtag $C$DW$T$43
    4244                    
    4245                            .dwattr $C$DW$T$43, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4246                            .dwattr $C$DW$T$43, DW_AT_decl_line(0xa9)
    4247                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    4248                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("CORBParameters")
    4249                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$43)
    4250                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    4251                            .dwattr $C$DW$T$92, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4252                            .dwattr $C$DW$T$92, DW_AT_decl_line(0xb3)
    4253                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x02)
    4254                    
    4255                    $C$DW$T$48      .dwtag  DW_TAG_structure_type
    4256                            .dwattr $C$DW$T$48, DW_AT_byte_size(0x5a008)
    4257                    $C$DW$371       .dwtag  DW_TAG_member
    4258                            .dwattr $C$DW$371, DW_AT_type(*$C$DW$T$39)
    4259                            .dwattr $C$DW$371, DW_AT_name("octave")
    4260                            .dwattr $C$DW$371, DW_AT_TI_symbol_name("octave")
    4261                            .dwattr $C$DW$371, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4262                            .dwattr $C$DW$371, DW_AT_accessibility(DW_ACCESS_public)
    4263                            .dwattr $C$DW$371, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4264                            .dwattr $C$DW$371, DW_AT_decl_line(0xb9)
    4265                            .dwattr $C$DW$371, DW_AT_decl_column(0x0d)
    4266                    $C$DW$372       .dwtag  DW_TAG_member
    4267                            .dwattr $C$DW$372, DW_AT_type(*$C$DW$T$45)
    4268                            .dwattr $C$DW$372, DW_AT_name("relative_patterns")
    4269                            .dwattr $C$DW$372, DW_AT_TI_symbol_name("relative_patterns")
    4270                            .dwattr $C$DW$372, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4271                            .dwattr $C$DW$372, DW_AT_accessibility(DW_ACCESS_public)
    4272                            .dwattr $C$DW$372, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4273                            .dwattr $C$DW$372, DW_AT_decl_line(0xbb)
    4274                            .dwattr $C$DW$372, DW_AT_decl_column(0x0d)
    4275                    $C$DW$373       .dwtag  DW_TAG_member
    4276                            .dwattr $C$DW$373, DW_AT_type(*$C$DW$T$47)
    4277                            .dwattr $C$DW$373, DW_AT_name("rotated_patterns")
    4278                            .dwattr $C$DW$373, DW_AT_TI_symbol_name("rotated_patterns")
    4279                            .dwattr $C$DW$373, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c004]
    4280                            .dwattr $C$DW$373, DW_AT_accessibility(DW_ACCESS_public)
    4281                            .dwattr $C$DW$373, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4282                            .dwattr $C$DW$373, DW_AT_decl_line(0xbc)
    4283                            .dwattr $C$DW$373, DW_AT_decl_column(0x0d)
    4284                    $C$DW$374       .dwtag  DW_TAG_member
    4285                            .dwattr $C$DW$374, DW_AT_type(*$C$DW$T$39)
    4286                            .dwattr $C$DW$374, DW_AT_name("integralImageWidth")
    4287                            .dwattr $C$DW$374, DW_AT_TI_symbol_name("integralImageWidth")
    4288                            .dwattr $C$DW$374, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a004]
    4289                            .dwattr $C$DW$374, DW_AT_accessibility(DW_ACCESS_public)
    4290                            .dwattr $C$DW$374, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4291                            .dwattr $C$DW$374, DW_AT_decl_line(0xbd)
    4292                            .dwattr $C$DW$374, DW_AT_decl_column(0x0d)
    4293                            .dwendtag $C$DW$T$48
    4294                    
    4295                            .dwattr $C$DW$T$48, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4296                            .dwattr $C$DW$T$48, DW_AT_decl_line(0xb8)
    4297                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   85

    4298                    $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("CORBPatterns")
    4299                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$48)
    4300                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
    4301                            .dwattr $C$DW$T$52, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4302                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xbe)
    4303                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x02)
    4304                    
    4305                    $C$DW$T$51      .dwtag  DW_TAG_structure_type
    4306                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x400)
    4307                    $C$DW$375       .dwtag  DW_TAG_member
    4308                            .dwattr $C$DW$375, DW_AT_type(*$C$DW$T$49)
    4309                            .dwattr $C$DW$375, DW_AT_name("orientation_horizontal_offsets")
    4310                            .dwattr $C$DW$375, DW_AT_TI_symbol_name("orientation_horizontal_offsets")
    4311                            .dwattr $C$DW$375, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4312                            .dwattr $C$DW$375, DW_AT_accessibility(DW_ACCESS_public)
    4313                            .dwattr $C$DW$375, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4314                            .dwattr $C$DW$375, DW_AT_decl_line(0xc4)
    4315                            .dwattr $C$DW$375, DW_AT_decl_column(0x0d)
    4316                    $C$DW$376       .dwtag  DW_TAG_member
    4317                            .dwattr $C$DW$376, DW_AT_type(*$C$DW$T$49)
    4318                            .dwattr $C$DW$376, DW_AT_name("orientation_vertical_offsets")
    4319                            .dwattr $C$DW$376, DW_AT_TI_symbol_name("orientation_vertical_offsets")
    4320                            .dwattr $C$DW$376, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
    4321                            .dwattr $C$DW$376, DW_AT_accessibility(DW_ACCESS_public)
    4322                            .dwattr $C$DW$376, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4323                            .dwattr $C$DW$376, DW_AT_decl_line(0xc5)
    4324                            .dwattr $C$DW$376, DW_AT_decl_column(0x0d)
    4325                    $C$DW$377       .dwtag  DW_TAG_member
    4326                            .dwattr $C$DW$377, DW_AT_type(*$C$DW$T$50)
    4327                            .dwattr $C$DW$377, DW_AT_name("u_max")
    4328                            .dwattr $C$DW$377, DW_AT_TI_symbol_name("u_max")
    4329                            .dwattr $C$DW$377, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c0]
    4330                            .dwattr $C$DW$377, DW_AT_accessibility(DW_ACCESS_public)
    4331                            .dwattr $C$DW$377, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4332                            .dwattr $C$DW$377, DW_AT_decl_line(0xc6)
    4333                            .dwattr $C$DW$377, DW_AT_decl_column(0x0d)
    4334                            .dwendtag $C$DW$T$51
    4335                    
    4336                            .dwattr $C$DW$T$51, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4337                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xc3)
    4338                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x10)
    4339                    $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOrientationOffsets")
    4340                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$51)
    4341                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
    4342                            .dwattr $C$DW$T$53, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4343                            .dwattr $C$DW$T$53, DW_AT_decl_line(0xc7)
    4344                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x02)
    4345                    
    4346                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    4347                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x5a420)
    4348                    $C$DW$378       .dwtag  DW_TAG_member
    4349                            .dwattr $C$DW$378, DW_AT_type(*$C$DW$T$52)
    4350                            .dwattr $C$DW$378, DW_AT_name("patterns")
    4351                            .dwattr $C$DW$378, DW_AT_TI_symbol_name("patterns")
    4352                            .dwattr $C$DW$378, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   86

    4353                            .dwattr $C$DW$378, DW_AT_accessibility(DW_ACCESS_public)
    4354                            .dwattr $C$DW$378, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4355                            .dwattr $C$DW$378, DW_AT_decl_line(0xcd)
    4356                            .dwattr $C$DW$378, DW_AT_decl_column(0x1c)
    4357                    $C$DW$379       .dwtag  DW_TAG_member
    4358                            .dwattr $C$DW$379, DW_AT_type(*$C$DW$T$53)
    4359                            .dwattr $C$DW$379, DW_AT_name("offsets")
    4360                            .dwattr $C$DW$379, DW_AT_TI_symbol_name("offsets")
    4361                            .dwattr $C$DW$379, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a008]
    4362                            .dwattr $C$DW$379, DW_AT_accessibility(DW_ACCESS_public)
    4363                            .dwattr $C$DW$379, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4364                            .dwattr $C$DW$379, DW_AT_decl_line(0xce)
    4365                            .dwattr $C$DW$379, DW_AT_decl_column(0x1c)
    4366                    $C$DW$380       .dwtag  DW_TAG_member
    4367                            .dwattr $C$DW$380, DW_AT_type(*$C$DW$T$28)
    4368                            .dwattr $C$DW$380, DW_AT_name("image")
    4369                            .dwattr $C$DW$380, DW_AT_TI_symbol_name("image")
    4370                            .dwattr $C$DW$380, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a408]
    4371                            .dwattr $C$DW$380, DW_AT_accessibility(DW_ACCESS_public)
    4372                            .dwattr $C$DW$380, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4373                            .dwattr $C$DW$380, DW_AT_decl_line(0xcf)
    4374                            .dwattr $C$DW$380, DW_AT_decl_column(0x1c)
    4375                    $C$DW$381       .dwtag  DW_TAG_member
    4376                            .dwattr $C$DW$381, DW_AT_type(*$C$DW$T$28)
    4377                            .dwattr $C$DW$381, DW_AT_name("prefimage")
    4378                            .dwattr $C$DW$381, DW_AT_TI_symbol_name("prefimage")
    4379                            .dwattr $C$DW$381, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a40c]
    4380                            .dwattr $C$DW$381, DW_AT_accessibility(DW_ACCESS_public)
    4381                            .dwattr $C$DW$381, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4382                            .dwattr $C$DW$381, DW_AT_decl_line(0xd0)
    4383                            .dwattr $C$DW$381, DW_AT_decl_column(0x1c)
    4384                    $C$DW$382       .dwtag  DW_TAG_member
    4385                            .dwattr $C$DW$382, DW_AT_type(*$C$DW$T$55)
    4386                            .dwattr $C$DW$382, DW_AT_name("harrisImage")
    4387                            .dwattr $C$DW$382, DW_AT_TI_symbol_name("harrisImage")
    4388                            .dwattr $C$DW$382, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a410]
    4389                            .dwattr $C$DW$382, DW_AT_accessibility(DW_ACCESS_public)
    4390                            .dwattr $C$DW$382, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4391                            .dwattr $C$DW$382, DW_AT_decl_line(0xd1)
    4392                            .dwattr $C$DW$382, DW_AT_decl_column(0x1c)
    4393                    $C$DW$383       .dwtag  DW_TAG_member
    4394                            .dwattr $C$DW$383, DW_AT_type(*$C$DW$T$26)
    4395                            .dwattr $C$DW$383, DW_AT_name("integralImage")
    4396                            .dwattr $C$DW$383, DW_AT_TI_symbol_name("integralImage")
    4397                            .dwattr $C$DW$383, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a414]
    4398                            .dwattr $C$DW$383, DW_AT_accessibility(DW_ACCESS_public)
    4399                            .dwattr $C$DW$383, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4400                            .dwattr $C$DW$383, DW_AT_decl_line(0xd2)
    4401                            .dwattr $C$DW$383, DW_AT_decl_column(0x1c)
    4402                    $C$DW$384       .dwtag  DW_TAG_member
    4403                            .dwattr $C$DW$384, DW_AT_type(*$C$DW$T$32)
    4404                            .dwattr $C$DW$384, DW_AT_name("scratchBuffer")
    4405                            .dwattr $C$DW$384, DW_AT_TI_symbol_name("scratchBuffer")
    4406                            .dwattr $C$DW$384, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a418]
    4407                            .dwattr $C$DW$384, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   87

    4408                            .dwattr $C$DW$384, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4409                            .dwattr $C$DW$384, DW_AT_decl_line(0xd3)
    4410                            .dwattr $C$DW$384, DW_AT_decl_column(0x1c)
    4411                    $C$DW$385       .dwtag  DW_TAG_member
    4412                            .dwattr $C$DW$385, DW_AT_type(*$C$DW$T$30)
    4413                            .dwattr $C$DW$385, DW_AT_name("orbPattern31")
    4414                            .dwattr $C$DW$385, DW_AT_TI_symbol_name("orbPattern31")
    4415                            .dwattr $C$DW$385, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a41c]
    4416                            .dwattr $C$DW$385, DW_AT_accessibility(DW_ACCESS_public)
    4417                            .dwattr $C$DW$385, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4418                            .dwattr $C$DW$385, DW_AT_decl_line(0xd4)
    4419                            .dwattr $C$DW$385, DW_AT_decl_column(0x1c)
    4420                            .dwendtag $C$DW$T$56
    4421                    
    4422                            .dwattr $C$DW$T$56, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4423                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xcc)
    4424                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    4425                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CORBInput")
    4426                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$56)
    4427                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    4428                            .dwattr $C$DW$T$93, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4429                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xd5)
    4430                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x02)
    4431                    
    4432                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    4433                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x38)
    4434                    $C$DW$386       .dwtag  DW_TAG_member
    4435                            .dwattr $C$DW$386, DW_AT_type(*$C$DW$T$39)
    4436                            .dwattr $C$DW$386, DW_AT_name("x")
    4437                            .dwattr $C$DW$386, DW_AT_TI_symbol_name("x")
    4438                            .dwattr $C$DW$386, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4439                            .dwattr $C$DW$386, DW_AT_accessibility(DW_ACCESS_public)
    4440                            .dwattr $C$DW$386, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4441                            .dwattr $C$DW$386, DW_AT_decl_line(0xdc)
    4442                            .dwattr $C$DW$386, DW_AT_decl_column(0x0d)
    4443                    $C$DW$387       .dwtag  DW_TAG_member
    4444                            .dwattr $C$DW$387, DW_AT_type(*$C$DW$T$39)
    4445                            .dwattr $C$DW$387, DW_AT_name("y")
    4446                            .dwattr $C$DW$387, DW_AT_TI_symbol_name("y")
    4447                            .dwattr $C$DW$387, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4448                            .dwattr $C$DW$387, DW_AT_accessibility(DW_ACCESS_public)
    4449                            .dwattr $C$DW$387, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4450                            .dwattr $C$DW$387, DW_AT_decl_line(0xde)
    4451                            .dwattr $C$DW$387, DW_AT_decl_column(0x0d)
    4452                    $C$DW$388       .dwtag  DW_TAG_member
    4453                            .dwattr $C$DW$388, DW_AT_type(*$C$DW$T$39)
    4454                            .dwattr $C$DW$388, DW_AT_name("octave")
    4455                            .dwattr $C$DW$388, DW_AT_TI_symbol_name("octave")
    4456                            .dwattr $C$DW$388, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4457                            .dwattr $C$DW$388, DW_AT_accessibility(DW_ACCESS_public)
    4458                            .dwattr $C$DW$388, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4459                            .dwattr $C$DW$388, DW_AT_decl_line(0xe0)
    4460                            .dwattr $C$DW$388, DW_AT_decl_column(0x0d)
    4461                    $C$DW$389       .dwtag  DW_TAG_member
    4462                            .dwattr $C$DW$389, DW_AT_type(*$C$DW$T$57)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   88

    4463                            .dwattr $C$DW$389, DW_AT_name("angle")
    4464                            .dwattr $C$DW$389, DW_AT_TI_symbol_name("angle")
    4465                            .dwattr $C$DW$389, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4466                            .dwattr $C$DW$389, DW_AT_accessibility(DW_ACCESS_public)
    4467                            .dwattr $C$DW$389, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4468                            .dwattr $C$DW$389, DW_AT_decl_line(0xe3)
    4469                            .dwattr $C$DW$389, DW_AT_decl_column(0x0e)
    4470                    $C$DW$390       .dwtag  DW_TAG_member
    4471                            .dwattr $C$DW$390, DW_AT_type(*$C$DW$T$39)
    4472                            .dwattr $C$DW$390, DW_AT_name("fastResponse")
    4473                            .dwattr $C$DW$390, DW_AT_TI_symbol_name("fastResponse")
    4474                            .dwattr $C$DW$390, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4475                            .dwattr $C$DW$390, DW_AT_accessibility(DW_ACCESS_public)
    4476                            .dwattr $C$DW$390, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4477                            .dwattr $C$DW$390, DW_AT_decl_line(0xe4)
    4478                            .dwattr $C$DW$390, DW_AT_decl_column(0x0e)
    4479                    $C$DW$391       .dwtag  DW_TAG_member
    4480                            .dwattr $C$DW$391, DW_AT_type(*$C$DW$T$54)
    4481                            .dwattr $C$DW$391, DW_AT_name("harrisResponse")
    4482                            .dwattr $C$DW$391, DW_AT_TI_symbol_name("harrisResponse")
    4483                            .dwattr $C$DW$391, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4484                            .dwattr $C$DW$391, DW_AT_accessibility(DW_ACCESS_public)
    4485                            .dwattr $C$DW$391, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4486                            .dwattr $C$DW$391, DW_AT_decl_line(0xe5)
    4487                            .dwattr $C$DW$391, DW_AT_decl_column(0x0e)
    4488                    $C$DW$392       .dwtag  DW_TAG_member
    4489                            .dwattr $C$DW$392, DW_AT_type(*$C$DW$T$58)
    4490                            .dwattr $C$DW$392, DW_AT_name("descriptor")
    4491                            .dwattr $C$DW$392, DW_AT_TI_symbol_name("descriptor")
    4492                            .dwattr $C$DW$392, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    4493                            .dwattr $C$DW$392, DW_AT_accessibility(DW_ACCESS_public)
    4494                            .dwattr $C$DW$392, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4495                            .dwattr $C$DW$392, DW_AT_decl_line(0xe6)
    4496                            .dwattr $C$DW$392, DW_AT_decl_column(0x0e)
    4497                            .dwendtag $C$DW$T$59
    4498                    
    4499                            .dwattr $C$DW$T$59, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4500                            .dwattr $C$DW$T$59, DW_AT_decl_line(0xdb)
    4501                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x10)
    4502                    $C$DW$T$60      .dwtag  DW_TAG_typedef, DW_AT_name("CORBFeature")
    4503                            .dwattr $C$DW$T$60, DW_AT_type(*$C$DW$T$59)
    4504                            .dwattr $C$DW$T$60, DW_AT_language(DW_LANG_C)
    4505                            .dwattr $C$DW$T$60, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4506                            .dwattr $C$DW$T$60, DW_AT_decl_line(0xe7)
    4507                            .dwattr $C$DW$T$60, DW_AT_decl_column(0x02)
    4508                    $C$DW$T$61      .dwtag  DW_TAG_pointer_type
    4509                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
    4510                            .dwattr $C$DW$T$61, DW_AT_address_class(0x20)
    4511                    
    4512                    $C$DW$T$62      .dwtag  DW_TAG_structure_type
    4513                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x08)
    4514                    $C$DW$393       .dwtag  DW_TAG_member
    4515                            .dwattr $C$DW$393, DW_AT_type(*$C$DW$T$61)
    4516                            .dwattr $C$DW$393, DW_AT_name("features")
    4517                            .dwattr $C$DW$393, DW_AT_TI_symbol_name("features")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   89

    4518                            .dwattr $C$DW$393, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4519                            .dwattr $C$DW$393, DW_AT_accessibility(DW_ACCESS_public)
    4520                            .dwattr $C$DW$393, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4521                            .dwattr $C$DW$393, DW_AT_decl_line(0xed)
    4522                            .dwattr $C$DW$393, DW_AT_decl_column(0x12)
    4523                    $C$DW$394       .dwtag  DW_TAG_member
    4524                            .dwattr $C$DW$394, DW_AT_type(*$C$DW$T$39)
    4525                            .dwattr $C$DW$394, DW_AT_name("n_features")
    4526                            .dwattr $C$DW$394, DW_AT_TI_symbol_name("n_features")
    4527                            .dwattr $C$DW$394, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4528                            .dwattr $C$DW$394, DW_AT_accessibility(DW_ACCESS_public)
    4529                            .dwattr $C$DW$394, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\common
    4530                            .dwattr $C$DW$394, DW_AT_decl_line(0xee)
    4531                            .dwattr $C$DW$394, DW_AT_decl_column(0x12)
    4532                            .dwendtag $C$DW$T$62
    4533                    
    4534                            .dwattr $C$DW$T$62, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4535                            .dwattr $C$DW$T$62, DW_AT_decl_line(0xec)
    4536                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x10)
    4537                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOutput")
    4538                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$62)
    4539                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    4540                            .dwattr $C$DW$T$94, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4541                            .dwattr $C$DW$T$94, DW_AT_decl_line(0xef)
    4542                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x02)
    4543                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4544                            .dwattr $C$DW$T$2, DW_AT_name("void")
    4545                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4546                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4547                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    4548                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    4549                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$3)
    4550                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    4551                            .dwattr $C$DW$T$95, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\commo
    4552                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x5c)
    4553                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x19)
    4554                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    4555                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4556                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    4557                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4558                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    4559                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4560                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4561                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4562                    $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    4563                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$5)
    4564                            .dwattr $C$DW$T$122, DW_AT_address_class(0x20)
    4565                    $C$DW$T$29      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    4566                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$5)
    4567                            .dwattr $C$DW$T$29, DW_AT_language(DW_LANG_C)
    4568                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4569                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x2a)
    4570                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x1d)
    4571                    $C$DW$T$30      .dwtag  DW_TAG_pointer_type
    4572                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$29)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   90

    4573                            .dwattr $C$DW$T$30, DW_AT_address_class(0x20)
    4574                    $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    4575                            .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$29)
    4576                            .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    4577                            .dwattr $C$DW$T$134, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4578                            .dwattr $C$DW$T$134, DW_AT_decl_line(0x39)
    4579                            .dwattr $C$DW$T$134, DW_AT_decl_column(0x17)
    4580                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    4581                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4582                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4583                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4584                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    4585                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$6)
    4586                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    4587                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    4588                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$6)
    4589                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    4590                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4591                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x2b)
    4592                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x1c)
    4593                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    4594                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$22)
    4595                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    4596                    $C$DW$T$136     .dwtag  DW_TAG_restrict_type
    4597                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$28)
    4598                    
    4599                    $C$DW$T$58      .dwtag  DW_TAG_array_type
    4600                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$22)
    4601                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    4602                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x20)
    4603                    $C$DW$395       .dwtag  DW_TAG_subrange_type
    4604                            .dwattr $C$DW$395, DW_AT_upper_bound(0x1f)
    4605                            .dwendtag $C$DW$T$58
    4606                    
    4607                    $C$DW$T$137     .dwtag  DW_TAG_const_type
    4608                            .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$22)
    4609                    $C$DW$T$138     .dwtag  DW_TAG_pointer_type
    4610                            .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$137)
    4611                            .dwattr $C$DW$T$138, DW_AT_address_class(0x20)
    4612                    $C$DW$T$139     .dwtag  DW_TAG_restrict_type
    4613                            .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
    4614                    $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    4615                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$22)
    4616                            .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    4617                            .dwattr $C$DW$T$140, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4618                            .dwattr $C$DW$T$140, DW_AT_decl_line(0x3a)
    4619                            .dwattr $C$DW$T$140, DW_AT_decl_column(0x16)
    4620                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    4621                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4622                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4623                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4624                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    4625                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4626                            .dwattr $C$DW$T$8, DW_AT_name("short")
    4627                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   91

    4628                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    4629                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$8)
    4630                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    4631                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4632                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x2c)
    4633                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x1d)
    4634                    $C$DW$T$55      .dwtag  DW_TAG_pointer_type
    4635                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$54)
    4636                            .dwattr $C$DW$T$55, DW_AT_address_class(0x20)
    4637                    $C$DW$T$141     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    4638                            .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$54)
    4639                            .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    4640                            .dwattr $C$DW$T$141, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4641                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x3c)
    4642                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x17)
    4643                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    4644                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4645                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4646                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4647                    $C$DW$T$142     .dwtag  DW_TAG_pointer_type
    4648                            .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$9)
    4649                            .dwattr $C$DW$T$142, DW_AT_address_class(0x20)
    4650                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    4651                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$9)
    4652                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    4653                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4654                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x2d)
    4655                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x1c)
    4656                    $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    4657                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    4658                            .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
    4659                    $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    4660                            .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$23)
    4661                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    4662                            .dwattr $C$DW$T$144, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4663                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x3d)
    4664                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x16)
    4665                    $C$DW$T$143     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    4666                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$9)
    4667                            .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
    4668                            .dwattr $C$DW$T$143, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4669                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x53)
    4670                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x1a)
    4671                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    4672                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4673                            .dwattr $C$DW$T$10, DW_AT_name("int")
    4674                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    4675                    $C$DW$T$154     .dwtag  DW_TAG_pointer_type
    4676                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$10)
    4677                            .dwattr $C$DW$T$154, DW_AT_address_class(0x20)
    4678                    $C$DW$T$164     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    4679                            .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$10)
    4680                            .dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
    4681                            .dwattr $C$DW$T$164, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4682                            .dwattr $C$DW$T$164, DW_AT_decl_line(0x53)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   92

    4683                            .dwattr $C$DW$T$164, DW_AT_decl_column(0x0d)
    4684                    $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    4685                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$10)
    4686                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4687                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4688                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x2e)
    4689                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x1d)
    4690                    $C$DW$T$155     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    4691                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$39)
    4692                            .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    4693                            .dwattr $C$DW$T$155, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeRBrief\..\comm
    4694                            .dwattr $C$DW$T$155, DW_AT_decl_line(0x77)
    4695                            .dwattr $C$DW$T$155, DW_AT_decl_column(0x11)
    4696                    
    4697                    $C$DW$T$44      .dwtag  DW_TAG_array_type
    4698                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$39)
    4699                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    4700                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x2000)
    4701                    $C$DW$396       .dwtag  DW_TAG_subrange_type
    4702                            .dwattr $C$DW$396, DW_AT_upper_bound(0x7ff)
    4703                            .dwendtag $C$DW$T$44
    4704                    
    4705                    
    4706                    $C$DW$T$45      .dwtag  DW_TAG_array_type
    4707                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$39)
    4708                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4709                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x3c000)
    4710                    $C$DW$397       .dwtag  DW_TAG_subrange_type
    4711                            .dwattr $C$DW$397, DW_AT_upper_bound(0x1d)
    4712                    $C$DW$398       .dwtag  DW_TAG_subrange_type
    4713                            .dwattr $C$DW$398, DW_AT_upper_bound(0x7ff)
    4714                            .dwendtag $C$DW$T$45
    4715                    
    4716                    
    4717                    $C$DW$T$46      .dwtag  DW_TAG_array_type
    4718                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$39)
    4719                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    4720                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x1000)
    4721                    $C$DW$399       .dwtag  DW_TAG_subrange_type
    4722                            .dwattr $C$DW$399, DW_AT_upper_bound(0x3ff)
    4723                            .dwendtag $C$DW$T$46
    4724                    
    4725                    
    4726                    $C$DW$T$47      .dwtag  DW_TAG_array_type
    4727                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$39)
    4728                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    4729                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x1e000)
    4730                    $C$DW$400       .dwtag  DW_TAG_subrange_type
    4731                            .dwattr $C$DW$400, DW_AT_upper_bound(0x1d)
    4732                    $C$DW$401       .dwtag  DW_TAG_subrange_type
    4733                            .dwattr $C$DW$401, DW_AT_upper_bound(0x3ff)
    4734                            .dwendtag $C$DW$T$47
    4735                    
    4736                    
    4737                    $C$DW$T$49      .dwtag  DW_TAG_array_type
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:53 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeRBrief/VLIB_ORB_computeRBrief_d.se66 PAGE   93

    4738                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$39)
    4739                            .dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
    4740                            .dwattr $C$DW$T$49, DW_AT_byte_size(0x1e0)
    4741                    $C$DW$402       .dwtag  DW_TAG_subrange_type
    4742                            .dwattr $C$DW$402, DW_AT_upper_bound(0x77)
    4743                            .dwendtag $C$DW$T$49
    4744                    
    4745                    
    4746                    $C$DW$T$50      .dwtag  DW_TAG_array_type
    4747                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$39)
    4748                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    4749                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x40)
    4750                    $C$DW$403       .dwtag  DW_TAG_subrange_type
    4751                            .dwattr $C$DW$403, DW_AT_upper_bound(0x0f)
    4752                            .dwendtag $C$DW$T$50
    4753                    
    4754                    
    4755                    $C$DW$T$63      .dwtag  DW_TAG_array_type
    4756                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$39)
    4757                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    4758                            .dwattr $C$DW$T$63, DW_AT_byte_size(0x10)
    4759                    $C$DW$404       .dwtag  DW_TAG_subrange_type
    4760                            .dwattr $C$DW$404, DW_AT_upper_bound(0x03)
    4761                            .dwendtag $C$DW$T$63
    4762                    
    4763                    $C$DW$T$118     .dwtag  DW_TAG_pointer_type
    4764                            .dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$39)
    4765                            .dwattr $C$DW$T$118, DW_AT_address_class(0x20)
    4766                    $C$DW$T$156     .dwtag  DW_TAG_const_type
    4767                            .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$39)
    4768                    $C$DW$T$157     .dwtag  DW_TAG_pointer_type
    4769                            .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$156)
    4770                            .dwattr $C$DW$T$157, DW_AT_address_class(0x20)
    4771                    $C$DW$T$158     .dwtag  DW_TAG_restrict_type
    4772                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$157)
    4773                    $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    4774                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$39)
    4775                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    4776                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4777                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x4b)
    4778                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x17)
    4779                    $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    4780                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$39)
    4781                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    4782                            .dwattr $C$DW$T$160, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4783                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x4e)
    4784                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x17)
    4785                    $C$DW$T$161     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
