TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Thu Mar 19 12:38:21 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    2877                            .dwattr $C$DW$232, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\../com
    2878                            .dwattr $C$DW$232, DW_AT_decl_line(0x72)
    2879                            .dwattr $C$DW$232, DW_AT_decl_column(0x05)
    2880                    $C$DW$233       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    2881                            .dwattr $C$DW$233, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\../com
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   61

    2882                            .dwattr $C$DW$233, DW_AT_decl_line(0x73)
    2883                            .dwattr $C$DW$233, DW_AT_decl_column(0x05)
    2884                            .dwendtag $C$DW$T$65
    2885                    
    2886                            .dwattr $C$DW$T$65, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\../co
    2887                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x71)
    2888                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x06)
    2889                    
    2890                    $C$DW$T$66      .dwtag  DW_TAG_enumeration_type
    2891                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x04)
    2892                    $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_FALSE"), DW_AT_const_value(0x00)
    2893                            .dwattr $C$DW$234, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    2894                            .dwattr $C$DW$234, DW_AT_decl_line(0x8f)
    2895                            .dwattr $C$DW$234, DW_AT_decl_column(0x05)
    2896                    $C$DW$235       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_TRUE"), DW_AT_const_value(0x01)
    2897                            .dwattr $C$DW$235, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    2898                            .dwattr $C$DW$235, DW_AT_decl_line(0x90)
    2899                            .dwattr $C$DW$235, DW_AT_decl_column(0x05)
    2900                            .dwendtag $C$DW$T$66
    2901                    
    2902                            .dwattr $C$DW$T$66, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    2903                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x8e)
    2904                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x0e)
    2905                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CORB_Bool")
    2906                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    2907                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2908                            .dwattr $C$DW$T$67, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    2909                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x91)
    2910                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x02)
    2911                    
    2912                    $C$DW$T$68      .dwtag  DW_TAG_enumeration_type
    2913                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x04)
    2914                    $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_OK"), DW_AT_const_value(0x00)
    2915                            .dwattr $C$DW$236, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    2916                            .dwattr $C$DW$236, DW_AT_decl_line(0xa2)
    2917                            .dwattr $C$DW$236, DW_AT_decl_column(0x05)
    2918                    $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_FAIL"), DW_AT_const_value(-1)
    2919                            .dwattr $C$DW$237, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    2920                            .dwattr $C$DW$237, DW_AT_decl_line(0xa3)
    2921                            .dwattr $C$DW$237, DW_AT_decl_column(0x05)
    2922                            .dwendtag $C$DW$T$68
    2923                    
    2924                            .dwattr $C$DW$T$68, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    2925                            .dwattr $C$DW$T$68, DW_AT_decl_line(0xa1)
    2926                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x0e)
    2927                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("CORBResult")
    2928                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2929                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2930                            .dwattr $C$DW$T$69, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    2931                            .dwattr $C$DW$T$69, DW_AT_decl_line(0xa4)
    2932                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x02)
    2933                    
    2934                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    2935                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x18)
    2936                    $C$DW$238       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   62

    2937                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    2938                            .dwattr $C$DW$238, DW_AT_name("testPattern")
    2939                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("testPattern")
    2940                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2941                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2942                            .dwattr $C$DW$238, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\VLIB_a
    2943                            .dwattr $C$DW$238, DW_AT_decl_line(0x24)
    2944                            .dwattr $C$DW$238, DW_AT_decl_column(0x0f)
    2945                    $C$DW$239       .dwtag  DW_TAG_member
    2946                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$20)
    2947                            .dwattr $C$DW$239, DW_AT_name("staticIn")
    2948                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("staticIn")
    2949                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2950                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2951                            .dwattr $C$DW$239, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\VLIB_a
    2952                            .dwattr $C$DW$239, DW_AT_decl_line(0x25)
    2953                            .dwattr $C$DW$239, DW_AT_decl_column(0x0f)
    2954                    $C$DW$240       .dwtag  DW_TAG_member
    2955                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$22)
    2956                            .dwattr $C$DW$240, DW_AT_name("staticOut")
    2957                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("staticOut")
    2958                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2959                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2960                            .dwattr $C$DW$240, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\VLIB_a
    2961                            .dwattr $C$DW$240, DW_AT_decl_line(0x26)
    2962                            .dwattr $C$DW$240, DW_AT_decl_column(0x0f)
    2963                    $C$DW$241       .dwtag  DW_TAG_member
    2964                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$21)
    2965                            .dwattr $C$DW$241, DW_AT_name("imageWidth")
    2966                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("imageWidth")
    2967                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2968                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2969                            .dwattr $C$DW$241, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\VLIB_a
    2970                            .dwattr $C$DW$241, DW_AT_decl_line(0x27)
    2971                            .dwattr $C$DW$241, DW_AT_decl_column(0x0f)
    2972                    $C$DW$242       .dwtag  DW_TAG_member
    2973                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$21)
    2974                            .dwattr $C$DW$242, DW_AT_name("imageHeight")
    2975                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("imageHeight")
    2976                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
    2977                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2978                            .dwattr $C$DW$242, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\VLIB_a
    2979                            .dwattr $C$DW$242, DW_AT_decl_line(0x28)
    2980                            .dwattr $C$DW$242, DW_AT_decl_column(0x0f)
    2981                    $C$DW$243       .dwtag  DW_TAG_member
    2982                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$21)
    2983                            .dwattr $C$DW$243, DW_AT_name("imagePitch")
    2984                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("imagePitch")
    2985                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2986                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2987                            .dwattr $C$DW$243, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\VLIB_a
    2988                            .dwattr $C$DW$243, DW_AT_decl_line(0x29)
    2989                            .dwattr $C$DW$243, DW_AT_decl_column(0x0f)
    2990                    $C$DW$244       .dwtag  DW_TAG_member
    2991                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   63

    2992                            .dwattr $C$DW$244, DW_AT_name("threshold")
    2993                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("threshold")
    2994                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2995                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2996                            .dwattr $C$DW$244, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\VLIB_a
    2997                            .dwattr $C$DW$244, DW_AT_decl_line(0x2a)
    2998                            .dwattr $C$DW$244, DW_AT_decl_column(0x0f)
    2999                    $C$DW$245       .dwtag  DW_TAG_member
    3000                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$24)
    3001                            .dwattr $C$DW$245, DW_AT_name("desc")
    3002                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("desc")
    3003                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3004                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3005                            .dwattr $C$DW$245, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\VLIB_a
    3006                            .dwattr $C$DW$245, DW_AT_decl_line(0x2b)
    3007                            .dwattr $C$DW$245, DW_AT_decl_column(0x0f)
    3008                            .dwendtag $C$DW$T$25
    3009                    
    3010                            .dwattr $C$DW$T$25, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\VLIB_
    3011                            .dwattr $C$DW$T$25, DW_AT_decl_line(0x23)
    3012                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3013                    $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    3014                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$25)
    3015                            .dwattr $C$DW$T$70, DW_AT_address_class(0x20)
    3016                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("afast9_detectCorners_testParams_t")
    3017                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$25)
    3018                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3019                            .dwattr $C$DW$T$72, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\VLIB_
    3020                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x2c)
    3021                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    3022                    $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    3023                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    3024                            .dwattr $C$DW$T$73, DW_AT_address_class(0x20)
    3025                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    3026                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    3027                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    3028                    
    3029                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    3030                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x18)
    3031                    $C$DW$246       .dwtag  DW_TAG_member
    3032                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$10)
    3033                            .dwattr $C$DW$246, DW_AT_name("fd")
    3034                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("fd")
    3035                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3036                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3037                            .dwattr $C$DW$246, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3038                            .dwattr $C$DW$246, DW_AT_decl_line(0x49)
    3039                            .dwattr $C$DW$246, DW_AT_decl_column(0x0b)
    3040                    $C$DW$247       .dwtag  DW_TAG_member
    3041                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$26)
    3042                            .dwattr $C$DW$247, DW_AT_name("buf")
    3043                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("buf")
    3044                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3045                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3046                            .dwattr $C$DW$247, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   64

    3047                            .dwattr $C$DW$247, DW_AT_decl_line(0x4a)
    3048                            .dwattr $C$DW$247, DW_AT_decl_column(0x16)
    3049                    $C$DW$248       .dwtag  DW_TAG_member
    3050                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$26)
    3051                            .dwattr $C$DW$248, DW_AT_name("pos")
    3052                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("pos")
    3053                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3054                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3055                            .dwattr $C$DW$248, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3056                            .dwattr $C$DW$248, DW_AT_decl_line(0x4b)
    3057                            .dwattr $C$DW$248, DW_AT_decl_column(0x16)
    3058                    $C$DW$249       .dwtag  DW_TAG_member
    3059                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$26)
    3060                            .dwattr $C$DW$249, DW_AT_name("bufend")
    3061                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("bufend")
    3062                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3063                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3064                            .dwattr $C$DW$249, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3065                            .dwattr $C$DW$249, DW_AT_decl_line(0x4c)
    3066                            .dwattr $C$DW$249, DW_AT_decl_column(0x16)
    3067                    $C$DW$250       .dwtag  DW_TAG_member
    3068                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$26)
    3069                            .dwattr $C$DW$250, DW_AT_name("buff_stop")
    3070                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("buff_stop")
    3071                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3072                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3073                            .dwattr $C$DW$250, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3074                            .dwattr $C$DW$250, DW_AT_decl_line(0x4d)
    3075                            .dwattr $C$DW$250, DW_AT_decl_column(0x16)
    3076                    $C$DW$251       .dwtag  DW_TAG_member
    3077                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$11)
    3078                            .dwattr $C$DW$251, DW_AT_name("flags")
    3079                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("flags")
    3080                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3081                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3082                            .dwattr $C$DW$251, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3083                            .dwattr $C$DW$251, DW_AT_decl_line(0x4e)
    3084                            .dwattr $C$DW$251, DW_AT_decl_column(0x16)
    3085                            .dwendtag $C$DW$T$27
    3086                    
    3087                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3088                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x48)
    3089                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    3090                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3091                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$27)
    3092                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3093                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3094                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x4f)
    3095                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    3096                    
    3097                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    3098                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x08)
    3099                    $C$DW$252       .dwtag  DW_TAG_member
    3100                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$10)
    3101                            .dwattr $C$DW$252, DW_AT_name("quot")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   65

    3102                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("quot")
    3103                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3104                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3105                            .dwattr $C$DW$252, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3106                            .dwattr $C$DW$252, DW_AT_decl_line(0x3e)
    3107                            .dwattr $C$DW$252, DW_AT_decl_column(0x16)
    3108                    $C$DW$253       .dwtag  DW_TAG_member
    3109                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$10)
    3110                            .dwattr $C$DW$253, DW_AT_name("rem")
    3111                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("rem")
    3112                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3113                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3114                            .dwattr $C$DW$253, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3115                            .dwattr $C$DW$253, DW_AT_decl_line(0x3e)
    3116                            .dwattr $C$DW$253, DW_AT_decl_column(0x1c)
    3117                            .dwendtag $C$DW$T$28
    3118                    
    3119                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3120                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x3e)
    3121                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3122                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3123                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$28)
    3124                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    3125                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3126                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3e)
    3127                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x23)
    3128                    
    3129                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3130                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    3131                    $C$DW$254       .dwtag  DW_TAG_member
    3132                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$10)
    3133                            .dwattr $C$DW$254, DW_AT_name("quot")
    3134                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("quot")
    3135                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3136                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3137                            .dwattr $C$DW$254, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3138                            .dwattr $C$DW$254, DW_AT_decl_line(0x40)
    3139                            .dwattr $C$DW$254, DW_AT_decl_column(0x17)
    3140                    $C$DW$255       .dwtag  DW_TAG_member
    3141                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$10)
    3142                            .dwattr $C$DW$255, DW_AT_name("rem")
    3143                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("rem")
    3144                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3145                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3146                            .dwattr $C$DW$255, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3147                            .dwattr $C$DW$255, DW_AT_decl_line(0x40)
    3148                            .dwattr $C$DW$255, DW_AT_decl_column(0x1d)
    3149                            .dwendtag $C$DW$T$29
    3150                    
    3151                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3152                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x40)
    3153                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3154                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3155                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$29)
    3156                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   66

    3157                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3158                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x40)
    3159                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x24)
    3160                    
    3161                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3162                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x10)
    3163                    $C$DW$256       .dwtag  DW_TAG_member
    3164                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$14)
    3165                            .dwattr $C$DW$256, DW_AT_name("quot")
    3166                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("quot")
    3167                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3168                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3169                            .dwattr $C$DW$256, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3170                            .dwattr $C$DW$256, DW_AT_decl_line(0x43)
    3171                            .dwattr $C$DW$256, DW_AT_decl_column(0x1c)
    3172                    $C$DW$257       .dwtag  DW_TAG_member
    3173                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$14)
    3174                            .dwattr $C$DW$257, DW_AT_name("rem")
    3175                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("rem")
    3176                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3177                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3178                            .dwattr $C$DW$257, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3179                            .dwattr $C$DW$257, DW_AT_decl_line(0x43)
    3180                            .dwattr $C$DW$257, DW_AT_decl_column(0x22)
    3181                            .dwendtag $C$DW$T$30
    3182                    
    3183                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3184                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x43)
    3185                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    3186                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3187                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$30)
    3188                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3189                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3190                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x43)
    3191                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x29)
    3192                    
    3193                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3194                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x24)
    3195                    $C$DW$258       .dwtag  DW_TAG_member
    3196                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$31)
    3197                            .dwattr $C$DW$258, DW_AT_name("area")
    3198                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("area")
    3199                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3200                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3201                            .dwattr $C$DW$258, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\com
    3202                            .dwattr $C$DW$258, DW_AT_decl_line(0x69)
    3203                            .dwattr $C$DW$258, DW_AT_decl_column(0x0d)
    3204                    $C$DW$259       .dwtag  DW_TAG_member
    3205                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$31)
    3206                            .dwattr $C$DW$259, DW_AT_name("xsum")
    3207                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("xsum")
    3208                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3209                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3210                            .dwattr $C$DW$259, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\com
    3211                            .dwattr $C$DW$259, DW_AT_decl_line(0x6a)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   67

    3212                            .dwattr $C$DW$259, DW_AT_decl_column(0x0d)
    3213                    $C$DW$260       .dwtag  DW_TAG_member
    3214                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$31)
    3215                            .dwattr $C$DW$260, DW_AT_name("ysum")
    3216                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("ysum")
    3217                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3218                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3219                            .dwattr $C$DW$260, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\com
    3220                            .dwattr $C$DW$260, DW_AT_decl_line(0x6b)
    3221                            .dwattr $C$DW$260, DW_AT_decl_column(0x0d)
    3222                    $C$DW$261       .dwtag  DW_TAG_member
    3223                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$31)
    3224                            .dwattr $C$DW$261, DW_AT_name("xmin")
    3225                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("xmin")
    3226                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3227                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3228                            .dwattr $C$DW$261, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\com
    3229                            .dwattr $C$DW$261, DW_AT_decl_line(0x6d)
    3230                            .dwattr $C$DW$261, DW_AT_decl_column(0x0d)
    3231                    $C$DW$262       .dwtag  DW_TAG_member
    3232                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$31)
    3233                            .dwattr $C$DW$262, DW_AT_name("ymin")
    3234                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("ymin")
    3235                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3236                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3237                            .dwattr $C$DW$262, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\com
    3238                            .dwattr $C$DW$262, DW_AT_decl_line(0x6e)
    3239                            .dwattr $C$DW$262, DW_AT_decl_column(0x0d)
    3240                    $C$DW$263       .dwtag  DW_TAG_member
    3241                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$31)
    3242                            .dwattr $C$DW$263, DW_AT_name("xmax")
    3243                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("xmax")
    3244                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3245                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3246                            .dwattr $C$DW$263, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\com
    3247                            .dwattr $C$DW$263, DW_AT_decl_line(0x6f)
    3248                            .dwattr $C$DW$263, DW_AT_decl_column(0x0d)
    3249                    $C$DW$264       .dwtag  DW_TAG_member
    3250                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$31)
    3251                            .dwattr $C$DW$264, DW_AT_name("ymax")
    3252                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("ymax")
    3253                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3254                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3255                            .dwattr $C$DW$264, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\com
    3256                            .dwattr $C$DW$264, DW_AT_decl_line(0x70)
    3257                            .dwattr $C$DW$264, DW_AT_decl_column(0x0d)
    3258                    $C$DW$265       .dwtag  DW_TAG_member
    3259                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$31)
    3260                            .dwattr $C$DW$265, DW_AT_name("seedx")
    3261                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("seedx")
    3262                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3263                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3264                            .dwattr $C$DW$265, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\com
    3265                            .dwattr $C$DW$265, DW_AT_decl_line(0x72)
    3266                            .dwattr $C$DW$265, DW_AT_decl_column(0x0d)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   68

    3267                    $C$DW$266       .dwtag  DW_TAG_member
    3268                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$31)
    3269                            .dwattr $C$DW$266, DW_AT_name("seedy")
    3270                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("seedy")
    3271                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3272                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3273                            .dwattr $C$DW$266, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\com
    3274                            .dwattr $C$DW$266, DW_AT_decl_line(0x73)
    3275                            .dwattr $C$DW$266, DW_AT_decl_column(0x0d)
    3276                            .dwendtag $C$DW$T$32
    3277                    
    3278                            .dwattr $C$DW$T$32, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\co
    3279                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x68)
    3280                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3281                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    3282                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$32)
    3283                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3284                            .dwattr $C$DW$T$79, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\co
    3285                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x75)
    3286                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    3287                    
    3288                    $C$DW$T$34      .dwtag  DW_TAG_structure_type
    3289                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x10)
    3290                    $C$DW$267       .dwtag  DW_TAG_member
    3291                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$8)
    3292                            .dwattr $C$DW$267, DW_AT_name("daylight")
    3293                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("daylight")
    3294                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3295                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3296                            .dwattr $C$DW$267, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3297                            .dwattr $C$DW$267, DW_AT_decl_line(0x52)
    3298                            .dwattr $C$DW$267, DW_AT_decl_column(0x0b)
    3299                    $C$DW$268       .dwtag  DW_TAG_member
    3300                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$10)
    3301                            .dwattr $C$DW$268, DW_AT_name("timezone")
    3302                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("timezone")
    3303                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3304                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3305                            .dwattr $C$DW$268, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3306                            .dwattr $C$DW$268, DW_AT_decl_line(0x53)
    3307                            .dwattr $C$DW$268, DW_AT_decl_column(0x0b)
    3308                    $C$DW$269       .dwtag  DW_TAG_member
    3309                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$33)
    3310                            .dwattr $C$DW$269, DW_AT_name("tzname")
    3311                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("tzname")
    3312                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3313                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3314                            .dwattr $C$DW$269, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3315                            .dwattr $C$DW$269, DW_AT_decl_line(0x54)
    3316                            .dwattr $C$DW$269, DW_AT_decl_column(0x0b)
    3317                    $C$DW$270       .dwtag  DW_TAG_member
    3318                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$33)
    3319                            .dwattr $C$DW$270, DW_AT_name("dstname")
    3320                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("dstname")
    3321                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   69

    3322                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3323                            .dwattr $C$DW$270, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3324                            .dwattr $C$DW$270, DW_AT_decl_line(0x55)
    3325                            .dwattr $C$DW$270, DW_AT_decl_column(0x0b)
    3326                            .dwendtag $C$DW$T$34
    3327                    
    3328                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3329                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x51)
    3330                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x01)
    3331                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    3332                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$34)
    3333                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    3334                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3335                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x56)
    3336                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    3337                    
    3338                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3339                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x14)
    3340                    $C$DW$271       .dwtag  DW_TAG_member
    3341                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$31)
    3342                            .dwattr $C$DW$271, DW_AT_name("width")
    3343                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("width")
    3344                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3345                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3346                            .dwattr $C$DW$271, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3347                            .dwattr $C$DW$271, DW_AT_decl_line(0xaa)
    3348                            .dwattr $C$DW$271, DW_AT_decl_column(0x0d)
    3349                    $C$DW$272       .dwtag  DW_TAG_member
    3350                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$31)
    3351                            .dwattr $C$DW$272, DW_AT_name("height")
    3352                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("height")
    3353                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3354                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3355                            .dwattr $C$DW$272, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3356                            .dwattr $C$DW$272, DW_AT_decl_line(0xab)
    3357                            .dwattr $C$DW$272, DW_AT_decl_column(0x0d)
    3358                    $C$DW$273       .dwtag  DW_TAG_member
    3359                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$31)
    3360                            .dwattr $C$DW$273, DW_AT_name("marginPixels")
    3361                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("marginPixels")
    3362                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3363                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3364                            .dwattr $C$DW$273, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3365                            .dwattr $C$DW$273, DW_AT_decl_line(0xac)
    3366                            .dwattr $C$DW$273, DW_AT_decl_column(0x0d)
    3367                    $C$DW$274       .dwtag  DW_TAG_member
    3368                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    3369                            .dwattr $C$DW$274, DW_AT_name("fastDifferenceThreshold")
    3370                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    3371                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3372                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3373                            .dwattr $C$DW$274, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3374                            .dwattr $C$DW$274, DW_AT_decl_line(0xae)
    3375                            .dwattr $C$DW$274, DW_AT_decl_column(0x0d)
    3376                    $C$DW$275       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   70

    3377                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$31)
    3378                            .dwattr $C$DW$275, DW_AT_name("n_features_desired")
    3379                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("n_features_desired")
    3380                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3381                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3382                            .dwattr $C$DW$275, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3383                            .dwattr $C$DW$275, DW_AT_decl_line(0xb2)
    3384                            .dwattr $C$DW$275, DW_AT_decl_column(0x0d)
    3385                            .dwendtag $C$DW$T$35
    3386                    
    3387                            .dwattr $C$DW$T$35, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    3388                            .dwattr $C$DW$T$35, DW_AT_decl_line(0xa9)
    3389                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3390                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CORBParameters")
    3391                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$35)
    3392                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    3393                            .dwattr $C$DW$T$81, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    3394                            .dwattr $C$DW$T$81, DW_AT_decl_line(0xb3)
    3395                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x02)
    3396                    
    3397                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3398                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x5a008)
    3399                    $C$DW$276       .dwtag  DW_TAG_member
    3400                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$31)
    3401                            .dwattr $C$DW$276, DW_AT_name("octave")
    3402                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("octave")
    3403                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3404                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3405                            .dwattr $C$DW$276, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3406                            .dwattr $C$DW$276, DW_AT_decl_line(0xb9)
    3407                            .dwattr $C$DW$276, DW_AT_decl_column(0x0d)
    3408                    $C$DW$277       .dwtag  DW_TAG_member
    3409                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$37)
    3410                            .dwattr $C$DW$277, DW_AT_name("relative_patterns")
    3411                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("relative_patterns")
    3412                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3413                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3414                            .dwattr $C$DW$277, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3415                            .dwattr $C$DW$277, DW_AT_decl_line(0xbb)
    3416                            .dwattr $C$DW$277, DW_AT_decl_column(0x0d)
    3417                    $C$DW$278       .dwtag  DW_TAG_member
    3418                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$39)
    3419                            .dwattr $C$DW$278, DW_AT_name("rotated_patterns")
    3420                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("rotated_patterns")
    3421                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c004]
    3422                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3423                            .dwattr $C$DW$278, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3424                            .dwattr $C$DW$278, DW_AT_decl_line(0xbc)
    3425                            .dwattr $C$DW$278, DW_AT_decl_column(0x0d)
    3426                    $C$DW$279       .dwtag  DW_TAG_member
    3427                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$31)
    3428                            .dwattr $C$DW$279, DW_AT_name("integralImageWidth")
    3429                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("integralImageWidth")
    3430                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a004]
    3431                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   71

    3432                            .dwattr $C$DW$279, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3433                            .dwattr $C$DW$279, DW_AT_decl_line(0xbd)
    3434                            .dwattr $C$DW$279, DW_AT_decl_column(0x0d)
    3435                            .dwendtag $C$DW$T$40
    3436                    
    3437                            .dwattr $C$DW$T$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    3438                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xb8)
    3439                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3440                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CORBPatterns")
    3441                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$40)
    3442                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3443                            .dwattr $C$DW$T$44, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    3444                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xbe)
    3445                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x02)
    3446                    
    3447                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3448                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x400)
    3449                    $C$DW$280       .dwtag  DW_TAG_member
    3450                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$41)
    3451                            .dwattr $C$DW$280, DW_AT_name("orientation_horizontal_offsets")
    3452                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("orientation_horizontal_offsets")
    3453                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3454                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3455                            .dwattr $C$DW$280, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3456                            .dwattr $C$DW$280, DW_AT_decl_line(0xc4)
    3457                            .dwattr $C$DW$280, DW_AT_decl_column(0x0d)
    3458                    $C$DW$281       .dwtag  DW_TAG_member
    3459                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$41)
    3460                            .dwattr $C$DW$281, DW_AT_name("orientation_vertical_offsets")
    3461                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("orientation_vertical_offsets")
    3462                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
    3463                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3464                            .dwattr $C$DW$281, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3465                            .dwattr $C$DW$281, DW_AT_decl_line(0xc5)
    3466                            .dwattr $C$DW$281, DW_AT_decl_column(0x0d)
    3467                    $C$DW$282       .dwtag  DW_TAG_member
    3468                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$42)
    3469                            .dwattr $C$DW$282, DW_AT_name("u_max")
    3470                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("u_max")
    3471                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c0]
    3472                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3473                            .dwattr $C$DW$282, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3474                            .dwattr $C$DW$282, DW_AT_decl_line(0xc6)
    3475                            .dwattr $C$DW$282, DW_AT_decl_column(0x0d)
    3476                            .dwendtag $C$DW$T$43
    3477                    
    3478                            .dwattr $C$DW$T$43, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    3479                            .dwattr $C$DW$T$43, DW_AT_decl_line(0xc3)
    3480                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    3481                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOrientationOffsets")
    3482                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$43)
    3483                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3484                            .dwattr $C$DW$T$45, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    3485                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xc7)
    3486                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x02)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   72

    3487                    
    3488                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3489                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x5a420)
    3490                    $C$DW$283       .dwtag  DW_TAG_member
    3491                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$44)
    3492                            .dwattr $C$DW$283, DW_AT_name("patterns")
    3493                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("patterns")
    3494                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3495                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3496                            .dwattr $C$DW$283, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3497                            .dwattr $C$DW$283, DW_AT_decl_line(0xcd)
    3498                            .dwattr $C$DW$283, DW_AT_decl_column(0x1c)
    3499                    $C$DW$284       .dwtag  DW_TAG_member
    3500                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$45)
    3501                            .dwattr $C$DW$284, DW_AT_name("offsets")
    3502                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("offsets")
    3503                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a008]
    3504                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3505                            .dwattr $C$DW$284, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3506                            .dwattr $C$DW$284, DW_AT_decl_line(0xce)
    3507                            .dwattr $C$DW$284, DW_AT_decl_column(0x1c)
    3508                    $C$DW$285       .dwtag  DW_TAG_member
    3509                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    3510                            .dwattr $C$DW$285, DW_AT_name("image")
    3511                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("image")
    3512                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a408]
    3513                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3514                            .dwattr $C$DW$285, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3515                            .dwattr $C$DW$285, DW_AT_decl_line(0xcf)
    3516                            .dwattr $C$DW$285, DW_AT_decl_column(0x1c)
    3517                    $C$DW$286       .dwtag  DW_TAG_member
    3518                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$20)
    3519                            .dwattr $C$DW$286, DW_AT_name("prefimage")
    3520                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("prefimage")
    3521                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a40c]
    3522                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3523                            .dwattr $C$DW$286, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3524                            .dwattr $C$DW$286, DW_AT_decl_line(0xd0)
    3525                            .dwattr $C$DW$286, DW_AT_decl_column(0x1c)
    3526                    $C$DW$287       .dwtag  DW_TAG_member
    3527                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$47)
    3528                            .dwattr $C$DW$287, DW_AT_name("harrisImage")
    3529                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("harrisImage")
    3530                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a410]
    3531                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3532                            .dwattr $C$DW$287, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3533                            .dwattr $C$DW$287, DW_AT_decl_line(0xd1)
    3534                            .dwattr $C$DW$287, DW_AT_decl_column(0x1c)
    3535                    $C$DW$288       .dwtag  DW_TAG_member
    3536                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$49)
    3537                            .dwattr $C$DW$288, DW_AT_name("integralImage")
    3538                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("integralImage")
    3539                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a414]
    3540                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3541                            .dwattr $C$DW$288, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   73

    3542                            .dwattr $C$DW$288, DW_AT_decl_line(0xd2)
    3543                            .dwattr $C$DW$288, DW_AT_decl_column(0x1c)
    3544                    $C$DW$289       .dwtag  DW_TAG_member
    3545                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$24)
    3546                            .dwattr $C$DW$289, DW_AT_name("scratchBuffer")
    3547                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("scratchBuffer")
    3548                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a418]
    3549                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3550                            .dwattr $C$DW$289, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3551                            .dwattr $C$DW$289, DW_AT_decl_line(0xd3)
    3552                            .dwattr $C$DW$289, DW_AT_decl_column(0x1c)
    3553                    $C$DW$290       .dwtag  DW_TAG_member
    3554                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$51)
    3555                            .dwattr $C$DW$290, DW_AT_name("orbPattern31")
    3556                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("orbPattern31")
    3557                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a41c]
    3558                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3559                            .dwattr $C$DW$290, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3560                            .dwattr $C$DW$290, DW_AT_decl_line(0xd4)
    3561                            .dwattr $C$DW$290, DW_AT_decl_column(0x1c)
    3562                            .dwendtag $C$DW$T$52
    3563                    
    3564                            .dwattr $C$DW$T$52, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    3565                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xcc)
    3566                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    3567                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CORBInput")
    3568                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$52)
    3569                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    3570                            .dwattr $C$DW$T$82, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    3571                            .dwattr $C$DW$T$82, DW_AT_decl_line(0xd5)
    3572                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x02)
    3573                    
    3574                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3575                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x38)
    3576                    $C$DW$291       .dwtag  DW_TAG_member
    3577                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$31)
    3578                            .dwattr $C$DW$291, DW_AT_name("x")
    3579                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("x")
    3580                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3581                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3582                            .dwattr $C$DW$291, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3583                            .dwattr $C$DW$291, DW_AT_decl_line(0xdc)
    3584                            .dwattr $C$DW$291, DW_AT_decl_column(0x0d)
    3585                    $C$DW$292       .dwtag  DW_TAG_member
    3586                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$31)
    3587                            .dwattr $C$DW$292, DW_AT_name("y")
    3588                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("y")
    3589                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3590                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3591                            .dwattr $C$DW$292, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3592                            .dwattr $C$DW$292, DW_AT_decl_line(0xde)
    3593                            .dwattr $C$DW$292, DW_AT_decl_column(0x0d)
    3594                    $C$DW$293       .dwtag  DW_TAG_member
    3595                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$31)
    3596                            .dwattr $C$DW$293, DW_AT_name("octave")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   74

    3597                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("octave")
    3598                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3599                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3600                            .dwattr $C$DW$293, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3601                            .dwattr $C$DW$293, DW_AT_decl_line(0xe0)
    3602                            .dwattr $C$DW$293, DW_AT_decl_column(0x0d)
    3603                    $C$DW$294       .dwtag  DW_TAG_member
    3604                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$53)
    3605                            .dwattr $C$DW$294, DW_AT_name("angle")
    3606                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("angle")
    3607                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3608                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3609                            .dwattr $C$DW$294, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3610                            .dwattr $C$DW$294, DW_AT_decl_line(0xe3)
    3611                            .dwattr $C$DW$294, DW_AT_decl_column(0x0e)
    3612                    $C$DW$295       .dwtag  DW_TAG_member
    3613                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$31)
    3614                            .dwattr $C$DW$295, DW_AT_name("fastResponse")
    3615                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("fastResponse")
    3616                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3617                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3618                            .dwattr $C$DW$295, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3619                            .dwattr $C$DW$295, DW_AT_decl_line(0xe4)
    3620                            .dwattr $C$DW$295, DW_AT_decl_column(0x0e)
    3621                    $C$DW$296       .dwtag  DW_TAG_member
    3622                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$46)
    3623                            .dwattr $C$DW$296, DW_AT_name("harrisResponse")
    3624                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("harrisResponse")
    3625                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3626                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3627                            .dwattr $C$DW$296, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3628                            .dwattr $C$DW$296, DW_AT_decl_line(0xe5)
    3629                            .dwattr $C$DW$296, DW_AT_decl_column(0x0e)
    3630                    $C$DW$297       .dwtag  DW_TAG_member
    3631                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$54)
    3632                            .dwattr $C$DW$297, DW_AT_name("descriptor")
    3633                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("descriptor")
    3634                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3635                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3636                            .dwattr $C$DW$297, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3637                            .dwattr $C$DW$297, DW_AT_decl_line(0xe6)
    3638                            .dwattr $C$DW$297, DW_AT_decl_column(0x0e)
    3639                            .dwendtag $C$DW$T$55
    3640                    
    3641                            .dwattr $C$DW$T$55, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    3642                            .dwattr $C$DW$T$55, DW_AT_decl_line(0xdb)
    3643                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    3644                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CORBFeature")
    3645                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3646                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3647                            .dwattr $C$DW$T$56, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    3648                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xe7)
    3649                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x02)
    3650                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    3651                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   75

    3652                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    3653                    
    3654                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3655                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x08)
    3656                    $C$DW$298       .dwtag  DW_TAG_member
    3657                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$57)
    3658                            .dwattr $C$DW$298, DW_AT_name("features")
    3659                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("features")
    3660                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3661                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3662                            .dwattr $C$DW$298, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3663                            .dwattr $C$DW$298, DW_AT_decl_line(0xed)
    3664                            .dwattr $C$DW$298, DW_AT_decl_column(0x12)
    3665                    $C$DW$299       .dwtag  DW_TAG_member
    3666                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$31)
    3667                            .dwattr $C$DW$299, DW_AT_name("n_features")
    3668                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("n_features")
    3669                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3670                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3671                            .dwattr $C$DW$299, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\..
    3672                            .dwattr $C$DW$299, DW_AT_decl_line(0xee)
    3673                            .dwattr $C$DW$299, DW_AT_decl_column(0x12)
    3674                            .dwendtag $C$DW$T$58
    3675                    
    3676                            .dwattr $C$DW$T$58, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    3677                            .dwattr $C$DW$T$58, DW_AT_decl_line(0xec)
    3678                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    3679                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOutput")
    3680                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$58)
    3681                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3682                            .dwattr $C$DW$T$83, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\c66\.
    3683                            .dwattr $C$DW$T$83, DW_AT_decl_line(0xef)
    3684                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x02)
    3685                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3686                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3687                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3688                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3689                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3690                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    3691                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$3)
    3692                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3693                            .dwattr $C$DW$T$84, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\co
    3694                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x5c)
    3695                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x19)
    3696                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3697                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3698                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3699                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3700                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3701                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3702                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3703                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3704                    $C$DW$T$111     .dwtag  DW_TAG_pointer_type
    3705                            .dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$5)
    3706                            .dwattr $C$DW$T$111, DW_AT_address_class(0x20)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   76

    3707                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    3708                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$5)
    3709                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3710                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3711                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2a)
    3712                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1d)
    3713                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3714                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3715                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    3716                    $C$DW$T$125     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    3717                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$50)
    3718                            .dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
    3719                            .dwattr $C$DW$T$125, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3720                            .dwattr $C$DW$T$125, DW_AT_decl_line(0x39)
    3721                            .dwattr $C$DW$T$125, DW_AT_decl_column(0x17)
    3722                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3723                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3724                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3725                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3726                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    3727                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$6)
    3728                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    3729                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    3730                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    3731                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    3732                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3733                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
    3734                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    3735                    $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    3736                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    3737                            .dwattr $C$DW$T$20, DW_AT_address_class(0x20)
    3738                    $C$DW$T$127     .dwtag  DW_TAG_restrict_type
    3739                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$20)
    3740                    
    3741                    $C$DW$T$54      .dwtag  DW_TAG_array_type
    3742                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$19)
    3743                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3744                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x20)
    3745                    $C$DW$300       .dwtag  DW_TAG_subrange_type
    3746                            .dwattr $C$DW$300, DW_AT_upper_bound(0x1f)
    3747                            .dwendtag $C$DW$T$54
    3748                    
    3749                    $C$DW$T$128     .dwtag  DW_TAG_const_type
    3750                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$19)
    3751                    $C$DW$T$129     .dwtag  DW_TAG_pointer_type
    3752                            .dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
    3753                            .dwattr $C$DW$T$129, DW_AT_address_class(0x20)
    3754                    $C$DW$T$130     .dwtag  DW_TAG_restrict_type
    3755                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$129)
    3756                    $C$DW$T$131     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    3757                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$19)
    3758                            .dwattr $C$DW$T$131, DW_AT_language(DW_LANG_C)
    3759                            .dwattr $C$DW$T$131, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3760                            .dwattr $C$DW$T$131, DW_AT_decl_line(0x3a)
    3761                            .dwattr $C$DW$T$131, DW_AT_decl_column(0x16)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   77

    3762                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3763                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3764                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3765                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3766                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3767                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3768                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3769                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3770                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3771                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$8)
    3772                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3773                            .dwattr $C$DW$T$46, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3774                            .dwattr $C$DW$T$46, DW_AT_decl_line(0x2c)
    3775                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x1d)
    3776                    $C$DW$T$47      .dwtag  DW_TAG_pointer_type
    3777                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$46)
    3778                            .dwattr $C$DW$T$47, DW_AT_address_class(0x20)
    3779                    $C$DW$T$132     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    3780                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$46)
    3781                            .dwattr $C$DW$T$132, DW_AT_language(DW_LANG_C)
    3782                            .dwattr $C$DW$T$132, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3783                            .dwattr $C$DW$T$132, DW_AT_decl_line(0x3c)
    3784                            .dwattr $C$DW$T$132, DW_AT_decl_column(0x17)
    3785                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3786                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3787                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3788                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3789                    $C$DW$T$133     .dwtag  DW_TAG_pointer_type
    3790                            .dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$9)
    3791                            .dwattr $C$DW$T$133, DW_AT_address_class(0x20)
    3792                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3793                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    3794                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    3795                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3796                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x2d)
    3797                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x1c)
    3798                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    3799                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    3800                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
    3801                    $C$DW$T$135     .dwtag  DW_TAG_restrict_type
    3802                            .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$22)
    3803                    $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    3804                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$21)
    3805                            .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    3806                            .dwattr $C$DW$T$136, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3807                            .dwattr $C$DW$T$136, DW_AT_decl_line(0x3d)
    3808                            .dwattr $C$DW$T$136, DW_AT_decl_column(0x16)
    3809                    $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3810                            .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$9)
    3811                            .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    3812                            .dwattr $C$DW$T$134, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3813                            .dwattr $C$DW$T$134, DW_AT_decl_line(0x53)
    3814                            .dwattr $C$DW$T$134, DW_AT_decl_column(0x1a)
    3815                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3816                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   78

    3817                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3818                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3819                    $C$DW$T$158     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    3820                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$10)
    3821                            .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    3822                            .dwattr $C$DW$T$158, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3823                            .dwattr $C$DW$T$158, DW_AT_decl_line(0x53)
    3824                            .dwattr $C$DW$T$158, DW_AT_decl_column(0x0d)
    3825                    $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3826                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$10)
    3827                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3828                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3829                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x2e)
    3830                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x1d)
    3831                    $C$DW$T$150     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    3832                            .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$31)
    3833                            .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
    3834                            .dwattr $C$DW$T$150, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\c
    3835                            .dwattr $C$DW$T$150, DW_AT_decl_line(0x77)
    3836                            .dwattr $C$DW$T$150, DW_AT_decl_column(0x11)
    3837                    
    3838                    $C$DW$T$36      .dwtag  DW_TAG_array_type
    3839                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$31)
    3840                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3841                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x2000)
    3842                    $C$DW$301       .dwtag  DW_TAG_subrange_type
    3843                            .dwattr $C$DW$301, DW_AT_upper_bound(0x7ff)
    3844                            .dwendtag $C$DW$T$36
    3845                    
    3846                    
    3847                    $C$DW$T$37      .dwtag  DW_TAG_array_type
    3848                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$31)
    3849                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    3850                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x3c000)
    3851                    $C$DW$302       .dwtag  DW_TAG_subrange_type
    3852                            .dwattr $C$DW$302, DW_AT_upper_bound(0x1d)
    3853                    $C$DW$303       .dwtag  DW_TAG_subrange_type
    3854                            .dwattr $C$DW$303, DW_AT_upper_bound(0x7ff)
    3855                            .dwendtag $C$DW$T$37
    3856                    
    3857                    
    3858                    $C$DW$T$38      .dwtag  DW_TAG_array_type
    3859                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$31)
    3860                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3861                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x1000)
    3862                    $C$DW$304       .dwtag  DW_TAG_subrange_type
    3863                            .dwattr $C$DW$304, DW_AT_upper_bound(0x3ff)
    3864                            .dwendtag $C$DW$T$38
    3865                    
    3866                    
    3867                    $C$DW$T$39      .dwtag  DW_TAG_array_type
    3868                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$31)
    3869                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3870                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e000)
    3871                    $C$DW$305       .dwtag  DW_TAG_subrange_type
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   79

    3872                            .dwattr $C$DW$305, DW_AT_upper_bound(0x1d)
    3873                    $C$DW$306       .dwtag  DW_TAG_subrange_type
    3874                            .dwattr $C$DW$306, DW_AT_upper_bound(0x3ff)
    3875                            .dwendtag $C$DW$T$39
    3876                    
    3877                    
    3878                    $C$DW$T$41      .dwtag  DW_TAG_array_type
    3879                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$31)
    3880                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3881                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x1e0)
    3882                    $C$DW$307       .dwtag  DW_TAG_subrange_type
    3883                            .dwattr $C$DW$307, DW_AT_upper_bound(0x77)
    3884                            .dwendtag $C$DW$T$41
    3885                    
    3886                    
    3887                    $C$DW$T$42      .dwtag  DW_TAG_array_type
    3888                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$31)
    3889                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3890                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x40)
    3891                    $C$DW$308       .dwtag  DW_TAG_subrange_type
    3892                            .dwattr $C$DW$308, DW_AT_upper_bound(0x0f)
    3893                            .dwendtag $C$DW$T$42
    3894                    
    3895                    
    3896                    $C$DW$T$59      .dwtag  DW_TAG_array_type
    3897                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$31)
    3898                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    3899                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x10)
    3900                    $C$DW$309       .dwtag  DW_TAG_subrange_type
    3901                            .dwattr $C$DW$309, DW_AT_upper_bound(0x03)
    3902                            .dwendtag $C$DW$T$59
    3903                    
    3904                    $C$DW$T$107     .dwtag  DW_TAG_pointer_type
    3905                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$31)
    3906                            .dwattr $C$DW$T$107, DW_AT_address_class(0x20)
    3907                    $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    3908                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$31)
    3909                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    3910                            .dwattr $C$DW$T$153, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3911                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x4b)
    3912                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x17)
    3913                    $C$DW$T$154     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    3914                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$31)
    3915                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    3916                            .dwattr $C$DW$T$154, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3917                            .dwattr $C$DW$T$154, DW_AT_decl_line(0x4e)
    3918                            .dwattr $C$DW$T$154, DW_AT_decl_column(0x17)
    3919                    $C$DW$T$155     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    3920                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$31)
    3921                            .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    3922                            .dwattr $C$DW$T$155, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3923                            .dwattr $C$DW$T$155, DW_AT_decl_line(0x49)
    3924                            .dwattr $C$DW$T$155, DW_AT_decl_column(0x17)
    3925                    $C$DW$T$156     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    3926                            .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$31)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:22 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast9_detectCorners/VLIB_afast9_detectCorners_d.se66 PAGE   80

    3927                            .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    3928                            .dwattr $C$DW$T$156, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3929                            .dwattr $C$DW$T$156, DW_AT_decl_line(0x3e)
    3930                            .dwattr $C$DW$T$156, DW_AT_decl_column(0x17)
    3931                    $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    3932                            .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$10)
    3933                            .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    3934                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3935                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x58)
    3936                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x1a)
    3937                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    3938                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3939                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3940                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    3941                    $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_VAL")
    3942                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$11)
    3943                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    3944                            .dwattr $C$DW$T$159, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast9_detectCorners\..\c
    3945                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x5d)
    3946                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x17)
    3947                    $C$DW$T$170     .dwtag  DW_TAG_typedef, DW_AT_name("clock_t")
    3948                            .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$11)
    3949                            .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    3950                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3951                            .dwattr $C$DW$T$170, DW_AT_decl_line(0x37)
    3952                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x16)
    3953                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3954                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$11)
    3955                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3956                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3957                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x45)
    3958                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x19)
    3959                    $C$DW$T$163     .dwtag  DW_TAG_typedef, DW_AT_name("time_t")
    3960                            .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$11)
    3961                            .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    3962                            .dwattr $C$DW$T$163, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3963                            .dwattr $C$DW$T$163, DW_AT_decl_line(0x38)
    3964                            .dwattr $C$DW$T$163, DW_AT_decl_column(0x16)
    3965                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    3966                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$11)
    3967                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
