TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Thu Mar 19 12:44:14 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    2894                    $C$DW$T$68      .dwtag  DW_TAG_enumeration_type
    2895                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x04)
    2896                    $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    2897                            .dwattr $C$DW$238, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\../com
    2898                            .dwattr $C$DW$238, DW_AT_decl_line(0x72)
    2899                            .dwattr $C$DW$238, DW_AT_decl_column(0x05)
    2900                    $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    2901                            .dwattr $C$DW$239, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\../com
    2902                            .dwattr $C$DW$239, DW_AT_decl_line(0x73)
    2903                            .dwattr $C$DW$239, DW_AT_decl_column(0x05)
    2904                            .dwendtag $C$DW$T$68
    2905                    
    2906                            .dwattr $C$DW$T$68, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\../co
    2907                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x71)
    2908                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x06)
    2909                    
    2910                    $C$DW$T$69      .dwtag  DW_TAG_enumeration_type
    2911                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x04)
    2912                    $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_FALSE"), DW_AT_const_value(0x00)
    2913                            .dwattr $C$DW$240, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    2914                            .dwattr $C$DW$240, DW_AT_decl_line(0x8f)
    2915                            .dwattr $C$DW$240, DW_AT_decl_column(0x05)
    2916                    $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_TRUE"), DW_AT_const_value(0x01)
    2917                            .dwattr $C$DW$241, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    2918                            .dwattr $C$DW$241, DW_AT_decl_line(0x90)
    2919                            .dwattr $C$DW$241, DW_AT_decl_column(0x05)
    2920                            .dwendtag $C$DW$T$69
    2921                    
    2922                            .dwattr $C$DW$T$69, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    2923                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x8e)
    2924                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x0e)
    2925                    $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CORB_Bool")
    2926                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2927                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2928                            .dwattr $C$DW$T$70, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    2929                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x91)
    2930                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x02)
    2931                    
    2932                    $C$DW$T$71      .dwtag  DW_TAG_enumeration_type
    2933                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    2934                    $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_OK"), DW_AT_const_value(0x00)
    2935                            .dwattr $C$DW$242, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    2936                            .dwattr $C$DW$242, DW_AT_decl_line(0xa2)
    2937                            .dwattr $C$DW$242, DW_AT_decl_column(0x05)
    2938                    $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_FAIL"), DW_AT_const_value(-1)
    2939                            .dwattr $C$DW$243, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    2940                            .dwattr $C$DW$243, DW_AT_decl_line(0xa3)
    2941                            .dwattr $C$DW$243, DW_AT_decl_column(0x05)
    2942                            .dwendtag $C$DW$T$71
    2943                    
    2944                            .dwattr $C$DW$T$71, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    2945                            .dwattr $C$DW$T$71, DW_AT_decl_line(0xa1)
    2946                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x0e)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   61

    2947                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("CORBResult")
    2948                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    2949                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2950                            .dwattr $C$DW$T$72, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    2951                            .dwattr $C$DW$T$72, DW_AT_decl_line(0xa4)
    2952                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x02)
    2953                    
    2954                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2955                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x14)
    2956                    $C$DW$244       .dwtag  DW_TAG_member
    2957                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2958                            .dwattr $C$DW$244, DW_AT_name("width")
    2959                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("width")
    2960                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2961                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2962                            .dwattr $C$DW$244, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    2963                            .dwattr $C$DW$244, DW_AT_decl_line(0xaa)
    2964                            .dwattr $C$DW$244, DW_AT_decl_column(0x0d)
    2965                    $C$DW$245       .dwtag  DW_TAG_member
    2966                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2967                            .dwattr $C$DW$245, DW_AT_name("height")
    2968                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("height")
    2969                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2970                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2971                            .dwattr $C$DW$245, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    2972                            .dwattr $C$DW$245, DW_AT_decl_line(0xab)
    2973                            .dwattr $C$DW$245, DW_AT_decl_column(0x0d)
    2974                    $C$DW$246       .dwtag  DW_TAG_member
    2975                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$19)
    2976                            .dwattr $C$DW$246, DW_AT_name("marginPixels")
    2977                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("marginPixels")
    2978                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2979                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2980                            .dwattr $C$DW$246, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    2981                            .dwattr $C$DW$246, DW_AT_decl_line(0xac)
    2982                            .dwattr $C$DW$246, DW_AT_decl_column(0x0d)
    2983                    $C$DW$247       .dwtag  DW_TAG_member
    2984                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$20)
    2985                            .dwattr $C$DW$247, DW_AT_name("fastDifferenceThreshold")
    2986                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    2987                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2988                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2989                            .dwattr $C$DW$247, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    2990                            .dwattr $C$DW$247, DW_AT_decl_line(0xae)
    2991                            .dwattr $C$DW$247, DW_AT_decl_column(0x0d)
    2992                    $C$DW$248       .dwtag  DW_TAG_member
    2993                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    2994                            .dwattr $C$DW$248, DW_AT_name("n_features_desired")
    2995                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("n_features_desired")
    2996                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2997                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2998                            .dwattr $C$DW$248, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    2999                            .dwattr $C$DW$248, DW_AT_decl_line(0xb2)
    3000                            .dwattr $C$DW$248, DW_AT_decl_column(0x0d)
    3001                            .dwendtag $C$DW$T$21
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   62

    3002                    
    3003                            .dwattr $C$DW$T$21, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3004                            .dwattr $C$DW$T$21, DW_AT_decl_line(0xa9)
    3005                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    3006                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CORBParameters")
    3007                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$21)
    3008                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3009                            .dwattr $C$DW$T$74, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3010                            .dwattr $C$DW$T$74, DW_AT_decl_line(0xb3)
    3011                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x02)
    3012                    $C$DW$T$75      .dwtag  DW_TAG_const_type
    3013                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3014                    
    3015                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3016                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x38)
    3017                    $C$DW$249       .dwtag  DW_TAG_member
    3018                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$19)
    3019                            .dwattr $C$DW$249, DW_AT_name("x")
    3020                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("x")
    3021                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3022                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3023                            .dwattr $C$DW$249, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3024                            .dwattr $C$DW$249, DW_AT_decl_line(0xdc)
    3025                            .dwattr $C$DW$249, DW_AT_decl_column(0x0d)
    3026                    $C$DW$250       .dwtag  DW_TAG_member
    3027                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    3028                            .dwattr $C$DW$250, DW_AT_name("y")
    3029                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("y")
    3030                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3031                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3032                            .dwattr $C$DW$250, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3033                            .dwattr $C$DW$250, DW_AT_decl_line(0xde)
    3034                            .dwattr $C$DW$250, DW_AT_decl_column(0x0d)
    3035                    $C$DW$251       .dwtag  DW_TAG_member
    3036                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    3037                            .dwattr $C$DW$251, DW_AT_name("octave")
    3038                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("octave")
    3039                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3040                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3041                            .dwattr $C$DW$251, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3042                            .dwattr $C$DW$251, DW_AT_decl_line(0xe0)
    3043                            .dwattr $C$DW$251, DW_AT_decl_column(0x0d)
    3044                    $C$DW$252       .dwtag  DW_TAG_member
    3045                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
    3046                            .dwattr $C$DW$252, DW_AT_name("angle")
    3047                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("angle")
    3048                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3049                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3050                            .dwattr $C$DW$252, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3051                            .dwattr $C$DW$252, DW_AT_decl_line(0xe3)
    3052                            .dwattr $C$DW$252, DW_AT_decl_column(0x0e)
    3053                    $C$DW$253       .dwtag  DW_TAG_member
    3054                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    3055                            .dwattr $C$DW$253, DW_AT_name("fastResponse")
    3056                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("fastResponse")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   63

    3057                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3058                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3059                            .dwattr $C$DW$253, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3060                            .dwattr $C$DW$253, DW_AT_decl_line(0xe4)
    3061                            .dwattr $C$DW$253, DW_AT_decl_column(0x0e)
    3062                    $C$DW$254       .dwtag  DW_TAG_member
    3063                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$23)
    3064                            .dwattr $C$DW$254, DW_AT_name("harrisResponse")
    3065                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("harrisResponse")
    3066                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3067                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3068                            .dwattr $C$DW$254, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3069                            .dwattr $C$DW$254, DW_AT_decl_line(0xe5)
    3070                            .dwattr $C$DW$254, DW_AT_decl_column(0x0e)
    3071                    $C$DW$255       .dwtag  DW_TAG_member
    3072                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$24)
    3073                            .dwattr $C$DW$255, DW_AT_name("descriptor")
    3074                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("descriptor")
    3075                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3076                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3077                            .dwattr $C$DW$255, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3078                            .dwattr $C$DW$255, DW_AT_decl_line(0xe6)
    3079                            .dwattr $C$DW$255, DW_AT_decl_column(0x0e)
    3080                            .dwendtag $C$DW$T$25
    3081                    
    3082                            .dwattr $C$DW$T$25, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3083                            .dwattr $C$DW$T$25, DW_AT_decl_line(0xdb)
    3084                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3085                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CORBFeature")
    3086                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$25)
    3087                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3088                            .dwattr $C$DW$T$48, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3089                            .dwattr $C$DW$T$48, DW_AT_decl_line(0xe7)
    3090                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x02)
    3091                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    3092                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3093                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    3094                    $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    3095                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$25)
    3096                            .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
    3097                    
    3098                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3099                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x20)
    3100                    $C$DW$256       .dwtag  DW_TAG_member
    3101                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    3102                            .dwattr $C$DW$256, DW_AT_name("testPattern")
    3103                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("testPattern")
    3104                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3105                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3106                            .dwattr $C$DW$256, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\VLIB_o
    3107                            .dwattr $C$DW$256, DW_AT_decl_line(0x24)
    3108                            .dwattr $C$DW$256, DW_AT_decl_column(0x0f)
    3109                    $C$DW$257       .dwtag  DW_TAG_member
    3110                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$26)
    3111                            .dwattr $C$DW$257, DW_AT_name("staticIn")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   64

    3112                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("staticIn")
    3113                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3114                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3115                            .dwattr $C$DW$257, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\VLIB_o
    3116                            .dwattr $C$DW$257, DW_AT_decl_line(0x25)
    3117                            .dwattr $C$DW$257, DW_AT_decl_column(0x0f)
    3118                    $C$DW$258       .dwtag  DW_TAG_member
    3119                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$28)
    3120                            .dwattr $C$DW$258, DW_AT_name("staticInFeatures")
    3121                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("staticInFeatures")
    3122                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3123                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3124                            .dwattr $C$DW$258, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\VLIB_o
    3125                            .dwattr $C$DW$258, DW_AT_decl_line(0x26)
    3126                            .dwattr $C$DW$258, DW_AT_decl_column(0x0f)
    3127                    $C$DW$259       .dwtag  DW_TAG_member
    3128                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$28)
    3129                            .dwattr $C$DW$259, DW_AT_name("staticOut")
    3130                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("staticOut")
    3131                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3132                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3133                            .dwattr $C$DW$259, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\VLIB_o
    3134                            .dwattr $C$DW$259, DW_AT_decl_line(0x27)
    3135                            .dwattr $C$DW$259, DW_AT_decl_column(0x0f)
    3136                    $C$DW$260       .dwtag  DW_TAG_member
    3137                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$27)
    3138                            .dwattr $C$DW$260, DW_AT_name("imageWidth")
    3139                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("imageWidth")
    3140                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3141                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3142                            .dwattr $C$DW$260, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\VLIB_o
    3143                            .dwattr $C$DW$260, DW_AT_decl_line(0x28)
    3144                            .dwattr $C$DW$260, DW_AT_decl_column(0x0f)
    3145                    $C$DW$261       .dwtag  DW_TAG_member
    3146                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$27)
    3147                            .dwattr $C$DW$261, DW_AT_name("imageHeight")
    3148                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("imageHeight")
    3149                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3150                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3151                            .dwattr $C$DW$261, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\VLIB_o
    3152                            .dwattr $C$DW$261, DW_AT_decl_line(0x29)
    3153                            .dwattr $C$DW$261, DW_AT_decl_column(0x0f)
    3154                    $C$DW$262       .dwtag  DW_TAG_member
    3155                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$29)
    3156                            .dwattr $C$DW$262, DW_AT_name("true_num_features")
    3157                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("true_num_features")
    3158                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3159                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3160                            .dwattr $C$DW$262, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\VLIB_o
    3161                            .dwattr $C$DW$262, DW_AT_decl_line(0x2a)
    3162                            .dwattr $C$DW$262, DW_AT_decl_column(0x0f)
    3163                    $C$DW$263       .dwtag  DW_TAG_member
    3164                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$20)
    3165                            .dwattr $C$DW$263, DW_AT_name("fastDifferenceThreshold")
    3166                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("fastDifferenceThreshold")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   65

    3167                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3168                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3169                            .dwattr $C$DW$263, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\VLIB_o
    3170                            .dwattr $C$DW$263, DW_AT_decl_line(0x2b)
    3171                            .dwattr $C$DW$263, DW_AT_decl_column(0x0f)
    3172                    $C$DW$264       .dwtag  DW_TAG_member
    3173                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$31)
    3174                            .dwattr $C$DW$264, DW_AT_name("desc")
    3175                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("desc")
    3176                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3177                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3178                            .dwattr $C$DW$264, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\VLIB_o
    3179                            .dwattr $C$DW$264, DW_AT_decl_line(0x2c)
    3180                            .dwattr $C$DW$264, DW_AT_decl_column(0x0f)
    3181                            .dwendtag $C$DW$T$32
    3182                    
    3183                            .dwattr $C$DW$T$32, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\VLIB_
    3184                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x23)
    3185                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3186                    $C$DW$T$80      .dwtag  DW_TAG_pointer_type
    3187                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$32)
    3188                            .dwattr $C$DW$T$80, DW_AT_address_class(0x20)
    3189                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("originalfast12_score_testParams_t")
    3190                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$32)
    3191                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    3192                            .dwattr $C$DW$T$82, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\VLIB_
    3193                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x2d)
    3194                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    3195                    $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    3196                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3197                            .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
    3198                    $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    3199                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3200                            .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
    3201                    
    3202                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3203                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x5a008)
    3204                    $C$DW$265       .dwtag  DW_TAG_member
    3205                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3206                            .dwattr $C$DW$265, DW_AT_name("octave")
    3207                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("octave")
    3208                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3209                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3210                            .dwattr $C$DW$265, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3211                            .dwattr $C$DW$265, DW_AT_decl_line(0xb9)
    3212                            .dwattr $C$DW$265, DW_AT_decl_column(0x0d)
    3213                    $C$DW$266       .dwtag  DW_TAG_member
    3214                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$34)
    3215                            .dwattr $C$DW$266, DW_AT_name("relative_patterns")
    3216                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("relative_patterns")
    3217                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3218                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3219                            .dwattr $C$DW$266, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3220                            .dwattr $C$DW$266, DW_AT_decl_line(0xbb)
    3221                            .dwattr $C$DW$266, DW_AT_decl_column(0x0d)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   66

    3222                    $C$DW$267       .dwtag  DW_TAG_member
    3223                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$36)
    3224                            .dwattr $C$DW$267, DW_AT_name("rotated_patterns")
    3225                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("rotated_patterns")
    3226                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c004]
    3227                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3228                            .dwattr $C$DW$267, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3229                            .dwattr $C$DW$267, DW_AT_decl_line(0xbc)
    3230                            .dwattr $C$DW$267, DW_AT_decl_column(0x0d)
    3231                    $C$DW$268       .dwtag  DW_TAG_member
    3232                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    3233                            .dwattr $C$DW$268, DW_AT_name("integralImageWidth")
    3234                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("integralImageWidth")
    3235                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a004]
    3236                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3237                            .dwattr $C$DW$268, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3238                            .dwattr $C$DW$268, DW_AT_decl_line(0xbd)
    3239                            .dwattr $C$DW$268, DW_AT_decl_column(0x0d)
    3240                            .dwendtag $C$DW$T$37
    3241                    
    3242                            .dwattr $C$DW$T$37, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3243                            .dwattr $C$DW$T$37, DW_AT_decl_line(0xb8)
    3244                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    3245                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CORBPatterns")
    3246                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$37)
    3247                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3248                            .dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3249                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xbe)
    3250                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x02)
    3251                    
    3252                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3253                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x400)
    3254                    $C$DW$269       .dwtag  DW_TAG_member
    3255                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$38)
    3256                            .dwattr $C$DW$269, DW_AT_name("orientation_horizontal_offsets")
    3257                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("orientation_horizontal_offsets")
    3258                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3259                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3260                            .dwattr $C$DW$269, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3261                            .dwattr $C$DW$269, DW_AT_decl_line(0xc4)
    3262                            .dwattr $C$DW$269, DW_AT_decl_column(0x0d)
    3263                    $C$DW$270       .dwtag  DW_TAG_member
    3264                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$38)
    3265                            .dwattr $C$DW$270, DW_AT_name("orientation_vertical_offsets")
    3266                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("orientation_vertical_offsets")
    3267                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
    3268                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3269                            .dwattr $C$DW$270, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3270                            .dwattr $C$DW$270, DW_AT_decl_line(0xc5)
    3271                            .dwattr $C$DW$270, DW_AT_decl_column(0x0d)
    3272                    $C$DW$271       .dwtag  DW_TAG_member
    3273                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$39)
    3274                            .dwattr $C$DW$271, DW_AT_name("u_max")
    3275                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("u_max")
    3276                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c0]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   67

    3277                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3278                            .dwattr $C$DW$271, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3279                            .dwattr $C$DW$271, DW_AT_decl_line(0xc6)
    3280                            .dwattr $C$DW$271, DW_AT_decl_column(0x0d)
    3281                            .dwendtag $C$DW$T$40
    3282                    
    3283                            .dwattr $C$DW$T$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3284                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xc3)
    3285                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3286                    $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOrientationOffsets")
    3287                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    3288                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3289                            .dwattr $C$DW$T$42, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3290                            .dwattr $C$DW$T$42, DW_AT_decl_line(0xc7)
    3291                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x02)
    3292                    
    3293                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3294                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x5a420)
    3295                    $C$DW$272       .dwtag  DW_TAG_member
    3296                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$41)
    3297                            .dwattr $C$DW$272, DW_AT_name("patterns")
    3298                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("patterns")
    3299                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3300                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3301                            .dwattr $C$DW$272, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3302                            .dwattr $C$DW$272, DW_AT_decl_line(0xcd)
    3303                            .dwattr $C$DW$272, DW_AT_decl_column(0x1c)
    3304                    $C$DW$273       .dwtag  DW_TAG_member
    3305                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$42)
    3306                            .dwattr $C$DW$273, DW_AT_name("offsets")
    3307                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("offsets")
    3308                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a008]
    3309                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3310                            .dwattr $C$DW$273, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3311                            .dwattr $C$DW$273, DW_AT_decl_line(0xce)
    3312                            .dwattr $C$DW$273, DW_AT_decl_column(0x1c)
    3313                    $C$DW$274       .dwtag  DW_TAG_member
    3314                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$26)
    3315                            .dwattr $C$DW$274, DW_AT_name("image")
    3316                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("image")
    3317                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a408]
    3318                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3319                            .dwattr $C$DW$274, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3320                            .dwattr $C$DW$274, DW_AT_decl_line(0xcf)
    3321                            .dwattr $C$DW$274, DW_AT_decl_column(0x1c)
    3322                    $C$DW$275       .dwtag  DW_TAG_member
    3323                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$26)
    3324                            .dwattr $C$DW$275, DW_AT_name("prefimage")
    3325                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("prefimage")
    3326                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a40c]
    3327                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3328                            .dwattr $C$DW$275, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3329                            .dwattr $C$DW$275, DW_AT_decl_line(0xd0)
    3330                            .dwattr $C$DW$275, DW_AT_decl_column(0x1c)
    3331                    $C$DW$276       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   68

    3332                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$43)
    3333                            .dwattr $C$DW$276, DW_AT_name("harrisImage")
    3334                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("harrisImage")
    3335                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a410]
    3336                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3337                            .dwattr $C$DW$276, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3338                            .dwattr $C$DW$276, DW_AT_decl_line(0xd1)
    3339                            .dwattr $C$DW$276, DW_AT_decl_column(0x1c)
    3340                    $C$DW$277       .dwtag  DW_TAG_member
    3341                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$44)
    3342                            .dwattr $C$DW$277, DW_AT_name("integralImage")
    3343                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("integralImage")
    3344                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a414]
    3345                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3346                            .dwattr $C$DW$277, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3347                            .dwattr $C$DW$277, DW_AT_decl_line(0xd2)
    3348                            .dwattr $C$DW$277, DW_AT_decl_column(0x1c)
    3349                    $C$DW$278       .dwtag  DW_TAG_member
    3350                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$31)
    3351                            .dwattr $C$DW$278, DW_AT_name("scratchBuffer")
    3352                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("scratchBuffer")
    3353                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a418]
    3354                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3355                            .dwattr $C$DW$278, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3356                            .dwattr $C$DW$278, DW_AT_decl_line(0xd3)
    3357                            .dwattr $C$DW$278, DW_AT_decl_column(0x1c)
    3358                    $C$DW$279       .dwtag  DW_TAG_member
    3359                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$46)
    3360                            .dwattr $C$DW$279, DW_AT_name("orbPattern31")
    3361                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("orbPattern31")
    3362                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a41c]
    3363                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3364                            .dwattr $C$DW$279, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3365                            .dwattr $C$DW$279, DW_AT_decl_line(0xd4)
    3366                            .dwattr $C$DW$279, DW_AT_decl_column(0x1c)
    3367                            .dwendtag $C$DW$T$47
    3368                    
    3369                            .dwattr $C$DW$T$47, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3370                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xcc)
    3371                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    3372                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CORBInput")
    3373                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$47)
    3374                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3375                            .dwattr $C$DW$T$85, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3376                            .dwattr $C$DW$T$85, DW_AT_decl_line(0xd5)
    3377                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x02)
    3378                    $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3379                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3380                            .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    3381                    
    3382                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3383                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    3384                    $C$DW$280       .dwtag  DW_TAG_member
    3385                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$49)
    3386                            .dwattr $C$DW$280, DW_AT_name("features")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   69

    3387                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("features")
    3388                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3389                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3390                            .dwattr $C$DW$280, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3391                            .dwattr $C$DW$280, DW_AT_decl_line(0xed)
    3392                            .dwattr $C$DW$280, DW_AT_decl_column(0x12)
    3393                    $C$DW$281       .dwtag  DW_TAG_member
    3394                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$19)
    3395                            .dwattr $C$DW$281, DW_AT_name("n_features")
    3396                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("n_features")
    3397                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3398                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3399                            .dwattr $C$DW$281, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3400                            .dwattr $C$DW$281, DW_AT_decl_line(0xee)
    3401                            .dwattr $C$DW$281, DW_AT_decl_column(0x12)
    3402                            .dwendtag $C$DW$T$50
    3403                    
    3404                            .dwattr $C$DW$T$50, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3405                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xec)
    3406                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    3407                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOutput")
    3408                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$50)
    3409                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    3410                            .dwattr $C$DW$T$88, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3411                            .dwattr $C$DW$T$88, DW_AT_decl_line(0xef)
    3412                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x02)
    3413                    $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    3414                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    3415                            .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    3416                    
    3417                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3418                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x18)
    3419                    $C$DW$282       .dwtag  DW_TAG_member
    3420                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$10)
    3421                            .dwattr $C$DW$282, DW_AT_name("fd")
    3422                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("fd")
    3423                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3424                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3425                            .dwattr $C$DW$282, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3426                            .dwattr $C$DW$282, DW_AT_decl_line(0x49)
    3427                            .dwattr $C$DW$282, DW_AT_decl_column(0x0b)
    3428                    $C$DW$283       .dwtag  DW_TAG_member
    3429                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$51)
    3430                            .dwattr $C$DW$283, DW_AT_name("buf")
    3431                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("buf")
    3432                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3433                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3434                            .dwattr $C$DW$283, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3435                            .dwattr $C$DW$283, DW_AT_decl_line(0x4a)
    3436                            .dwattr $C$DW$283, DW_AT_decl_column(0x16)
    3437                    $C$DW$284       .dwtag  DW_TAG_member
    3438                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$51)
    3439                            .dwattr $C$DW$284, DW_AT_name("pos")
    3440                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("pos")
    3441                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   70

    3442                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3443                            .dwattr $C$DW$284, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3444                            .dwattr $C$DW$284, DW_AT_decl_line(0x4b)
    3445                            .dwattr $C$DW$284, DW_AT_decl_column(0x16)
    3446                    $C$DW$285       .dwtag  DW_TAG_member
    3447                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$51)
    3448                            .dwattr $C$DW$285, DW_AT_name("bufend")
    3449                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("bufend")
    3450                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3451                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3452                            .dwattr $C$DW$285, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3453                            .dwattr $C$DW$285, DW_AT_decl_line(0x4c)
    3454                            .dwattr $C$DW$285, DW_AT_decl_column(0x16)
    3455                    $C$DW$286       .dwtag  DW_TAG_member
    3456                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$51)
    3457                            .dwattr $C$DW$286, DW_AT_name("buff_stop")
    3458                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("buff_stop")
    3459                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3460                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3461                            .dwattr $C$DW$286, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3462                            .dwattr $C$DW$286, DW_AT_decl_line(0x4d)
    3463                            .dwattr $C$DW$286, DW_AT_decl_column(0x16)
    3464                    $C$DW$287       .dwtag  DW_TAG_member
    3465                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$11)
    3466                            .dwattr $C$DW$287, DW_AT_name("flags")
    3467                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("flags")
    3468                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3469                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3470                            .dwattr $C$DW$287, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3471                            .dwattr $C$DW$287, DW_AT_decl_line(0x4e)
    3472                            .dwattr $C$DW$287, DW_AT_decl_column(0x16)
    3473                            .dwendtag $C$DW$T$52
    3474                    
    3475                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3476                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x48)
    3477                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    3478                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3479                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$52)
    3480                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    3481                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3482                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x4f)
    3483                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    3484                    
    3485                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3486                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x08)
    3487                    $C$DW$288       .dwtag  DW_TAG_member
    3488                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$10)
    3489                            .dwattr $C$DW$288, DW_AT_name("quot")
    3490                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("quot")
    3491                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3492                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3493                            .dwattr $C$DW$288, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3494                            .dwattr $C$DW$288, DW_AT_decl_line(0x3e)
    3495                            .dwattr $C$DW$288, DW_AT_decl_column(0x16)
    3496                    $C$DW$289       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   71

    3497                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$10)
    3498                            .dwattr $C$DW$289, DW_AT_name("rem")
    3499                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("rem")
    3500                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3501                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3502                            .dwattr $C$DW$289, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3503                            .dwattr $C$DW$289, DW_AT_decl_line(0x3e)
    3504                            .dwattr $C$DW$289, DW_AT_decl_column(0x1c)
    3505                            .dwendtag $C$DW$T$53
    3506                    
    3507                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3508                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x3e)
    3509                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x10)
    3510                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3511                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$53)
    3512                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    3513                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3514                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x3e)
    3515                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x23)
    3516                    
    3517                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3518                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x08)
    3519                    $C$DW$290       .dwtag  DW_TAG_member
    3520                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$10)
    3521                            .dwattr $C$DW$290, DW_AT_name("quot")
    3522                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("quot")
    3523                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3524                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3525                            .dwattr $C$DW$290, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3526                            .dwattr $C$DW$290, DW_AT_decl_line(0x40)
    3527                            .dwattr $C$DW$290, DW_AT_decl_column(0x17)
    3528                    $C$DW$291       .dwtag  DW_TAG_member
    3529                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$10)
    3530                            .dwattr $C$DW$291, DW_AT_name("rem")
    3531                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("rem")
    3532                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3533                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3534                            .dwattr $C$DW$291, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3535                            .dwattr $C$DW$291, DW_AT_decl_line(0x40)
    3536                            .dwattr $C$DW$291, DW_AT_decl_column(0x1d)
    3537                            .dwendtag $C$DW$T$54
    3538                    
    3539                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3540                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x40)
    3541                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x10)
    3542                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3543                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$54)
    3544                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    3545                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3546                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x40)
    3547                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x24)
    3548                    
    3549                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3550                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
    3551                    $C$DW$292       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   72

    3552                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$14)
    3553                            .dwattr $C$DW$292, DW_AT_name("quot")
    3554                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("quot")
    3555                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3556                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3557                            .dwattr $C$DW$292, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3558                            .dwattr $C$DW$292, DW_AT_decl_line(0x43)
    3559                            .dwattr $C$DW$292, DW_AT_decl_column(0x1c)
    3560                    $C$DW$293       .dwtag  DW_TAG_member
    3561                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$14)
    3562                            .dwattr $C$DW$293, DW_AT_name("rem")
    3563                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("rem")
    3564                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3565                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3566                            .dwattr $C$DW$293, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3567                            .dwattr $C$DW$293, DW_AT_decl_line(0x43)
    3568                            .dwattr $C$DW$293, DW_AT_decl_column(0x22)
    3569                            .dwendtag $C$DW$T$55
    3570                    
    3571                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3572                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x43)
    3573                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    3574                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3575                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$55)
    3576                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    3577                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3578                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x43)
    3579                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x29)
    3580                    
    3581                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    3582                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x24)
    3583                    $C$DW$294       .dwtag  DW_TAG_member
    3584                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    3585                            .dwattr $C$DW$294, DW_AT_name("area")
    3586                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("area")
    3587                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3588                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3589                            .dwattr $C$DW$294, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3590                            .dwattr $C$DW$294, DW_AT_decl_line(0x69)
    3591                            .dwattr $C$DW$294, DW_AT_decl_column(0x0d)
    3592                    $C$DW$295       .dwtag  DW_TAG_member
    3593                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    3594                            .dwattr $C$DW$295, DW_AT_name("xsum")
    3595                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("xsum")
    3596                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3597                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3598                            .dwattr $C$DW$295, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3599                            .dwattr $C$DW$295, DW_AT_decl_line(0x6a)
    3600                            .dwattr $C$DW$295, DW_AT_decl_column(0x0d)
    3601                    $C$DW$296       .dwtag  DW_TAG_member
    3602                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    3603                            .dwattr $C$DW$296, DW_AT_name("ysum")
    3604                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("ysum")
    3605                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3606                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   73

    3607                            .dwattr $C$DW$296, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3608                            .dwattr $C$DW$296, DW_AT_decl_line(0x6b)
    3609                            .dwattr $C$DW$296, DW_AT_decl_column(0x0d)
    3610                    $C$DW$297       .dwtag  DW_TAG_member
    3611                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    3612                            .dwattr $C$DW$297, DW_AT_name("xmin")
    3613                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("xmin")
    3614                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3615                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3616                            .dwattr $C$DW$297, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3617                            .dwattr $C$DW$297, DW_AT_decl_line(0x6d)
    3618                            .dwattr $C$DW$297, DW_AT_decl_column(0x0d)
    3619                    $C$DW$298       .dwtag  DW_TAG_member
    3620                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    3621                            .dwattr $C$DW$298, DW_AT_name("ymin")
    3622                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("ymin")
    3623                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3624                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3625                            .dwattr $C$DW$298, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3626                            .dwattr $C$DW$298, DW_AT_decl_line(0x6e)
    3627                            .dwattr $C$DW$298, DW_AT_decl_column(0x0d)
    3628                    $C$DW$299       .dwtag  DW_TAG_member
    3629                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    3630                            .dwattr $C$DW$299, DW_AT_name("xmax")
    3631                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("xmax")
    3632                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3633                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3634                            .dwattr $C$DW$299, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3635                            .dwattr $C$DW$299, DW_AT_decl_line(0x6f)
    3636                            .dwattr $C$DW$299, DW_AT_decl_column(0x0d)
    3637                    $C$DW$300       .dwtag  DW_TAG_member
    3638                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
    3639                            .dwattr $C$DW$300, DW_AT_name("ymax")
    3640                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("ymax")
    3641                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3642                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3643                            .dwattr $C$DW$300, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3644                            .dwattr $C$DW$300, DW_AT_decl_line(0x70)
    3645                            .dwattr $C$DW$300, DW_AT_decl_column(0x0d)
    3646                    $C$DW$301       .dwtag  DW_TAG_member
    3647                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
    3648                            .dwattr $C$DW$301, DW_AT_name("seedx")
    3649                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("seedx")
    3650                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3651                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3652                            .dwattr $C$DW$301, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
    3653                            .dwattr $C$DW$301, DW_AT_decl_line(0x72)
    3654                            .dwattr $C$DW$301, DW_AT_decl_column(0x0d)
    3655                    $C$DW$302       .dwtag  DW_TAG_member
    3656                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$19)
    3657                            .dwattr $C$DW$302, DW_AT_name("seedy")
    3658                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("seedy")
    3659                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3660                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3661                            .dwattr $C$DW$302, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\com
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   74

    3662                            .dwattr $C$DW$302, DW_AT_decl_line(0x73)
    3663                            .dwattr $C$DW$302, DW_AT_decl_column(0x0d)
    3664                            .dwendtag $C$DW$T$56
    3665                    
    3666                            .dwattr $C$DW$T$56, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3667                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x68)
    3668                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    3669                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    3670                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$56)
    3671                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    3672                            .dwattr $C$DW$T$95, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3673                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x75)
    3674                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    3675                    
    3676                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3677                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    3678                    $C$DW$303       .dwtag  DW_TAG_member
    3679                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$8)
    3680                            .dwattr $C$DW$303, DW_AT_name("daylight")
    3681                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("daylight")
    3682                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3683                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3684                            .dwattr $C$DW$303, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3685                            .dwattr $C$DW$303, DW_AT_decl_line(0x52)
    3686                            .dwattr $C$DW$303, DW_AT_decl_column(0x0b)
    3687                    $C$DW$304       .dwtag  DW_TAG_member
    3688                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$10)
    3689                            .dwattr $C$DW$304, DW_AT_name("timezone")
    3690                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("timezone")
    3691                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3692                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3693                            .dwattr $C$DW$304, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3694                            .dwattr $C$DW$304, DW_AT_decl_line(0x53)
    3695                            .dwattr $C$DW$304, DW_AT_decl_column(0x0b)
    3696                    $C$DW$305       .dwtag  DW_TAG_member
    3697                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$57)
    3698                            .dwattr $C$DW$305, DW_AT_name("tzname")
    3699                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("tzname")
    3700                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3701                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3702                            .dwattr $C$DW$305, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3703                            .dwattr $C$DW$305, DW_AT_decl_line(0x54)
    3704                            .dwattr $C$DW$305, DW_AT_decl_column(0x0b)
    3705                    $C$DW$306       .dwtag  DW_TAG_member
    3706                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$57)
    3707                            .dwattr $C$DW$306, DW_AT_name("dstname")
    3708                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("dstname")
    3709                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3710                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3711                            .dwattr $C$DW$306, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3712                            .dwattr $C$DW$306, DW_AT_decl_line(0x55)
    3713                            .dwattr $C$DW$306, DW_AT_decl_column(0x0b)
    3714                            .dwendtag $C$DW$T$58
    3715                    
    3716                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   75

    3717                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x51)
    3718                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    3719                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    3720                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$58)
    3721                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    3722                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3723                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x56)
    3724                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x03)
    3725                    
    3726                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3727                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x20)
    3728                    $C$DW$307       .dwtag  DW_TAG_member
    3729                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$60)
    3730                            .dwattr $C$DW$307, DW_AT_name("val")
    3731                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("val")
    3732                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3733                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3734                            .dwattr $C$DW$307, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\../com
    3735                            .dwattr $C$DW$307, DW_AT_decl_line(0x25)
    3736                            .dwattr $C$DW$307, DW_AT_decl_column(0x0c)
    3737                            .dwendtag $C$DW$T$61
    3738                    
    3739                            .dwattr $C$DW$T$61, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\../co
    3740                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x24)
    3741                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x10)
    3742                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("RotationMatrix")
    3743                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$61)
    3744                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    3745                            .dwattr $C$DW$T$97, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\../co
    3746                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x26)
    3747                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x02)
    3748                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3749                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3750                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3751                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3752                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3753                    $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    3754                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$3)
    3755                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    3756                            .dwattr $C$DW$T$98, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\co
    3757                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x5c)
    3758                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x19)
    3759                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3760                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3761                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3762                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3763                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3764                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3765                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3766                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3767                    $C$DW$T$130     .dwtag  DW_TAG_pointer_type
    3768                            .dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$5)
    3769                            .dwattr $C$DW$T$130, DW_AT_address_class(0x20)
    3770                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    3771                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$5)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   76

    3772                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3773                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3774                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x2a)
    3775                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x1d)
    3776                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3777                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3778                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3779                    $C$DW$T$142     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    3780                            .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$45)
    3781                            .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
    3782                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3783                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x39)
    3784                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x17)
    3785                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3786                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3787                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3788                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3789                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3790                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$6)
    3791                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    3792                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    3793                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    3794                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    3795                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3796                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x2b)
    3797                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x1c)
    3798                    
    3799                    $C$DW$T$24      .dwtag  DW_TAG_array_type
    3800                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$20)
    3801                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3802                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x20)
    3803                    $C$DW$308       .dwtag  DW_TAG_subrange_type
    3804                            .dwattr $C$DW$308, DW_AT_upper_bound(0x1f)
    3805                            .dwendtag $C$DW$T$24
    3806                    
    3807                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    3808                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$20)
    3809                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    3810                    $C$DW$T$119     .dwtag  DW_TAG_const_type
    3811                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$20)
    3812                    $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    3813                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    3814                            .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    3815                    $C$DW$T$121     .dwtag  DW_TAG_restrict_type
    3816                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    3817                    $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    3818                            .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$20)
    3819                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    3820                            .dwattr $C$DW$T$144, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3821                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x3a)
    3822                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x16)
    3823                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3824                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3825                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3826                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   77

    3827                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3828                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3829                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3830                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3831                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3832                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$8)
    3833                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3834                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3835                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x2c)
    3836                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x1d)
    3837                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    3838                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$23)
    3839                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    3840                    $C$DW$T$145     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    3841                            .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$23)
    3842                            .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    3843                            .dwattr $C$DW$T$145, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3844                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x3c)
    3845                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x17)
    3846                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3847                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3848                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3849                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3850                    $C$DW$T$146     .dwtag  DW_TAG_pointer_type
    3851                            .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$9)
    3852                            .dwattr $C$DW$T$146, DW_AT_address_class(0x20)
    3853                    $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3854                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
    3855                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3856                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3857                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2d)
    3858                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x1c)
    3859                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    3860                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    3861                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    3862                    $C$DW$T$148     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    3863                            .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$27)
    3864                            .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    3865                            .dwattr $C$DW$T$148, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3866                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x3d)
    3867                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x16)
    3868                    $C$DW$T$147     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3869                            .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$9)
    3870                            .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
    3871                            .dwattr $C$DW$T$147, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3872                            .dwattr $C$DW$T$147, DW_AT_decl_line(0x53)
    3873                            .dwattr $C$DW$T$147, DW_AT_decl_column(0x1a)
    3874                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3875                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3876                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3877                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3878                    $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    3879                            .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$10)
    3880                            .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    3881                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   78

    3882                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x53)
    3883                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x0d)
    3884                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3885                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$10)
    3886                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    3887                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3888                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2e)
    3889                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1d)
    3890                    $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    3891                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$19)
    3892                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    3893                            .dwattr $C$DW$T$159, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_score\..\c
    3894                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x77)
    3895                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x11)
    3896                    
    3897                    $C$DW$T$33      .dwtag  DW_TAG_array_type
    3898                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$19)
    3899                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3900                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x2000)
    3901                    $C$DW$309       .dwtag  DW_TAG_subrange_type
    3902                            .dwattr $C$DW$309, DW_AT_upper_bound(0x7ff)
    3903                            .dwendtag $C$DW$T$33
    3904                    
    3905                    
    3906                    $C$DW$T$34      .dwtag  DW_TAG_array_type
    3907                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$19)
    3908                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    3909                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x3c000)
    3910                    $C$DW$310       .dwtag  DW_TAG_subrange_type
    3911                            .dwattr $C$DW$310, DW_AT_upper_bound(0x1d)
    3912                    $C$DW$311       .dwtag  DW_TAG_subrange_type
    3913                            .dwattr $C$DW$311, DW_AT_upper_bound(0x7ff)
    3914                            .dwendtag $C$DW$T$34
    3915                    
    3916                    
    3917                    $C$DW$T$35      .dwtag  DW_TAG_array_type
    3918                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    3919                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    3920                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x1000)
    3921                    $C$DW$312       .dwtag  DW_TAG_subrange_type
    3922                            .dwattr $C$DW$312, DW_AT_upper_bound(0x3ff)
    3923                            .dwendtag $C$DW$T$35
    3924                    
    3925                    
    3926                    $C$DW$T$36      .dwtag  DW_TAG_array_type
    3927                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$19)
    3928                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    3929                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x1e000)
    3930                    $C$DW$313       .dwtag  DW_TAG_subrange_type
    3931                            .dwattr $C$DW$313, DW_AT_upper_bound(0x1d)
    3932                    $C$DW$314       .dwtag  DW_TAG_subrange_type
    3933                            .dwattr $C$DW$314, DW_AT_upper_bound(0x3ff)
    3934                            .dwendtag $C$DW$T$36
    3935                    
    3936                    
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:14 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_score/VLIB_originalfast12_score_d.se66 PAGE   79

    3937                    $C$DW$T$38      .dwtag  DW_TAG_array_type
    3938                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$19)
    3939                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3940                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x1e0)
    3941                    $C$DW$315       .dwtag  DW_TAG_subrange_type
    3942                            .dwattr $C$DW$315, DW_AT_upper_bound(0x77)
    3943                            .dwendtag $C$DW$T$38
    3944                    
    3945                    
    3946                    $C$DW$T$39      .dwtag  DW_TAG_array_type
    3947                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$19)
    3948                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3949                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x40)
    3950                    $C$DW$316       .dwtag  DW_TAG_subrange_type
    3951                            .dwattr $C$DW$316, DW_AT_upper_bound(0x0f)
    3952                            .dwendtag $C$DW$T$39
    3953                    
    3954                    
    3955                    $C$DW$T$62      .dwtag  DW_TAG_array_type
    3956                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$19)
    3957                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3958                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x10)
    3959                    $C$DW$317       .dwtag  DW_TAG_subrange_type
    3960                            .dwattr $C$DW$317, DW_AT_upper_bound(0x03)
    3961                            .dwendtag $C$DW$T$62
    3962                    
    3963                    $C$DW$T$126     .dwtag  DW_TAG_pointer_type
    3964                            .dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$19)
    3965                            .dwattr $C$DW$T$126, DW_AT_address_class(0x20)
    3966                    $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    3967                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$19)
    3968                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    3969                            .dwattr $C$DW$T$160, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3970                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x4b)
    3971                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x17)
    3972                    $C$DW$T$161     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    3973                            .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$19)
    3974                            .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
    3975                            .dwattr $C$DW$T$161, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3976                            .dwattr $C$DW$T$161, DW_AT_decl_line(0x4e)
    3977                            .dwattr $C$DW$T$161, DW_AT_decl_column(0x17)
    3978                    $C$DW$T$162     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    3979                            .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$19)
    3980                            .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    3981                            .dwattr $C$DW$T$162, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3982                            .dwattr $C$DW$T$162, DW_AT_decl_line(0x49)
    3983                            .dwattr $C$DW$T$162, DW_AT_decl_column(0x17)
    3984                    $C$DW$T$163     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    3985                            .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$19)
    3986                            .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    3987                            .dwattr $C$DW$T$163, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3988                            .dwattr $C$DW$T$163, DW_AT_decl_line(0x3e)
