TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Thu Mar 19 12:43:45 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    2901                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x03)
    2902                    
    2903                    $C$DW$T$78      .dwtag  DW_TAG_enumeration_type
    2904                            .dwattr $C$DW$T$78, DW_AT_byte_size(0x04)
    2905                    $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_OPT"), DW_AT_const_value(0x00)
    2906                            .dwattr $C$DW$240, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../c
    2907                            .dwattr $C$DW$240, DW_AT_decl_line(0x6a)
    2908                            .dwattr $C$DW$240, DW_AT_decl_column(0x05)
    2909                    $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CN"), DW_AT_const_value(0x01)
    2910                            .dwattr $C$DW$241, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../c
    2911                            .dwattr $C$DW$241, DW_AT_decl_line(0x6b)
    2912                            .dwattr $C$DW$241, DW_AT_decl_column(0x05)
    2913                    $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CNT"), DW_AT_const_value(0x02)
    2914                            .dwattr $C$DW$242, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../c
    2915                            .dwattr $C$DW$242, DW_AT_decl_line(0x6c)
    2916                            .dwattr $C$DW$242, DW_AT_decl_column(0x05)
    2917                            .dwendtag $C$DW$T$78
    2918                    
    2919                            .dwattr $C$DW$T$78, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../
    2920                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x69)
    2921                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x06)
    2922                    
    2923                    $C$DW$T$79      .dwtag  DW_TAG_enumeration_type
    2924                            .dwattr $C$DW$T$79, DW_AT_byte_size(0x04)
    2925                    $C$DW$243       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    2926                            .dwattr $C$DW$243, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../c
    2927                            .dwattr $C$DW$243, DW_AT_decl_line(0x72)
    2928                            .dwattr $C$DW$243, DW_AT_decl_column(0x05)
    2929                    $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    2930                            .dwattr $C$DW$244, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../c
    2931                            .dwattr $C$DW$244, DW_AT_decl_line(0x73)
    2932                            .dwattr $C$DW$244, DW_AT_decl_column(0x05)
    2933                            .dwendtag $C$DW$T$79
    2934                    
    2935                            .dwattr $C$DW$T$79, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../
    2936                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x71)
    2937                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x06)
    2938                    
    2939                    $C$DW$T$80      .dwtag  DW_TAG_enumeration_type
    2940                            .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    2941                    $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_FALSE"), DW_AT_const_value(0x00)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   60

    2942                            .dwattr $C$DW$245, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    2943                            .dwattr $C$DW$245, DW_AT_decl_line(0x8f)
    2944                            .dwattr $C$DW$245, DW_AT_decl_column(0x05)
    2945                    $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_TRUE"), DW_AT_const_value(0x01)
    2946                            .dwattr $C$DW$246, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    2947                            .dwattr $C$DW$246, DW_AT_decl_line(0x90)
    2948                            .dwattr $C$DW$246, DW_AT_decl_column(0x05)
    2949                            .dwendtag $C$DW$T$80
    2950                    
    2951                            .dwattr $C$DW$T$80, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    2952                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x8e)
    2953                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x0e)
    2954                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CORB_Bool")
    2955                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$80)
    2956                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2957                            .dwattr $C$DW$T$81, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    2958                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x91)
    2959                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x02)
    2960                    
    2961                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2962                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x24)
    2963                    $C$DW$247       .dwtag  DW_TAG_member
    2964                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    2965                            .dwattr $C$DW$247, DW_AT_name("testPattern")
    2966                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("testPattern")
    2967                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2968                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2969                            .dwattr $C$DW$247, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    2970                            .dwattr $C$DW$247, DW_AT_decl_line(0x24)
    2971                            .dwattr $C$DW$247, DW_AT_decl_column(0x0f)
    2972                    $C$DW$248       .dwtag  DW_TAG_member
    2973                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$21)
    2974                            .dwattr $C$DW$248, DW_AT_name("staticInFeatures")
    2975                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("staticInFeatures")
    2976                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2977                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2978                            .dwattr $C$DW$248, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    2979                            .dwattr $C$DW$248, DW_AT_decl_line(0x25)
    2980                            .dwattr $C$DW$248, DW_AT_decl_column(0x0f)
    2981                    $C$DW$249       .dwtag  DW_TAG_member
    2982                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$22)
    2983                            .dwattr $C$DW$249, DW_AT_name("staticInImage")
    2984                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("staticInImage")
    2985                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2986                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2987                            .dwattr $C$DW$249, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    2988                            .dwattr $C$DW$249, DW_AT_decl_line(0x26)
    2989                            .dwattr $C$DW$249, DW_AT_decl_column(0x0f)
    2990                    $C$DW$250       .dwtag  DW_TAG_member
    2991                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$24)
    2992                            .dwattr $C$DW$250, DW_AT_name("staticOut1")
    2993                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("staticOut1")
    2994                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2995                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2996                            .dwattr $C$DW$250, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   61

    2997                            .dwattr $C$DW$250, DW_AT_decl_line(0x27)
    2998                            .dwattr $C$DW$250, DW_AT_decl_column(0x0f)
    2999                    $C$DW$251       .dwtag  DW_TAG_member
    3000                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$24)
    3001                            .dwattr $C$DW$251, DW_AT_name("staticOut2")
    3002                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("staticOut2")
    3003                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3004                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3005                            .dwattr $C$DW$251, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    3006                            .dwattr $C$DW$251, DW_AT_decl_line(0x28)
    3007                            .dwattr $C$DW$251, DW_AT_decl_column(0x0f)
    3008                    $C$DW$252       .dwtag  DW_TAG_member
    3009                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
    3010                            .dwattr $C$DW$252, DW_AT_name("orbPattern")
    3011                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("orbPattern")
    3012                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3013                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3014                            .dwattr $C$DW$252, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    3015                            .dwattr $C$DW$252, DW_AT_decl_line(0x29)
    3016                            .dwattr $C$DW$252, DW_AT_decl_column(0x0f)
    3017                    $C$DW$253       .dwtag  DW_TAG_member
    3018                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$20)
    3019                            .dwattr $C$DW$253, DW_AT_name("imageWidth")
    3020                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("imageWidth")
    3021                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3022                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3023                            .dwattr $C$DW$253, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    3024                            .dwattr $C$DW$253, DW_AT_decl_line(0x2a)
    3025                            .dwattr $C$DW$253, DW_AT_decl_column(0x0f)
    3026                    $C$DW$254       .dwtag  DW_TAG_member
    3027                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$20)
    3028                            .dwattr $C$DW$254, DW_AT_name("imageHeight")
    3029                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("imageHeight")
    3030                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    3031                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3032                            .dwattr $C$DW$254, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    3033                            .dwattr $C$DW$254, DW_AT_decl_line(0x2b)
    3034                            .dwattr $C$DW$254, DW_AT_decl_column(0x0f)
    3035                    $C$DW$255       .dwtag  DW_TAG_member
    3036                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$25)
    3037                            .dwattr $C$DW$255, DW_AT_name("true_num_features")
    3038                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("true_num_features")
    3039                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3040                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3041                            .dwattr $C$DW$255, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    3042                            .dwattr $C$DW$255, DW_AT_decl_line(0x2c)
    3043                            .dwattr $C$DW$255, DW_AT_decl_column(0x0f)
    3044                    $C$DW$256       .dwtag  DW_TAG_member
    3045                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$27)
    3046                            .dwattr $C$DW$256, DW_AT_name("desc")
    3047                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("desc")
    3048                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3049                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3050                            .dwattr $C$DW$256, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLIB
    3051                            .dwattr $C$DW$256, DW_AT_decl_line(0x2d)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   62

    3052                            .dwattr $C$DW$256, DW_AT_decl_column(0x0f)
    3053                            .dwendtag $C$DW$T$28
    3054                    
    3055                            .dwattr $C$DW$T$28, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLI
    3056                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x23)
    3057                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    3058                    $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    3059                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$28)
    3060                            .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    3061                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("orb_computeOrientation_testParams_t")
    3062                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$28)
    3063                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3064                            .dwattr $C$DW$T$84, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\VLI
    3065                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x2e)
    3066                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    3067                    $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    3068                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    3069                            .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
    3070                    $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3071                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3072                            .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    3073                    
    3074                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3075                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x18)
    3076                    $C$DW$257       .dwtag  DW_TAG_member
    3077                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$10)
    3078                            .dwattr $C$DW$257, DW_AT_name("fd")
    3079                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("fd")
    3080                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3081                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3082                            .dwattr $C$DW$257, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3083                            .dwattr $C$DW$257, DW_AT_decl_line(0x49)
    3084                            .dwattr $C$DW$257, DW_AT_decl_column(0x0b)
    3085                    $C$DW$258       .dwtag  DW_TAG_member
    3086                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$29)
    3087                            .dwattr $C$DW$258, DW_AT_name("buf")
    3088                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("buf")
    3089                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3090                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3091                            .dwattr $C$DW$258, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3092                            .dwattr $C$DW$258, DW_AT_decl_line(0x4a)
    3093                            .dwattr $C$DW$258, DW_AT_decl_column(0x16)
    3094                    $C$DW$259       .dwtag  DW_TAG_member
    3095                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$29)
    3096                            .dwattr $C$DW$259, DW_AT_name("pos")
    3097                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("pos")
    3098                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3099                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3100                            .dwattr $C$DW$259, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3101                            .dwattr $C$DW$259, DW_AT_decl_line(0x4b)
    3102                            .dwattr $C$DW$259, DW_AT_decl_column(0x16)
    3103                    $C$DW$260       .dwtag  DW_TAG_member
    3104                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$29)
    3105                            .dwattr $C$DW$260, DW_AT_name("bufend")
    3106                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("bufend")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   63

    3107                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3108                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3109                            .dwattr $C$DW$260, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3110                            .dwattr $C$DW$260, DW_AT_decl_line(0x4c)
    3111                            .dwattr $C$DW$260, DW_AT_decl_column(0x16)
    3112                    $C$DW$261       .dwtag  DW_TAG_member
    3113                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$29)
    3114                            .dwattr $C$DW$261, DW_AT_name("buff_stop")
    3115                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("buff_stop")
    3116                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3117                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3118                            .dwattr $C$DW$261, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3119                            .dwattr $C$DW$261, DW_AT_decl_line(0x4d)
    3120                            .dwattr $C$DW$261, DW_AT_decl_column(0x16)
    3121                    $C$DW$262       .dwtag  DW_TAG_member
    3122                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$11)
    3123                            .dwattr $C$DW$262, DW_AT_name("flags")
    3124                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("flags")
    3125                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3126                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3127                            .dwattr $C$DW$262, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3128                            .dwattr $C$DW$262, DW_AT_decl_line(0x4e)
    3129                            .dwattr $C$DW$262, DW_AT_decl_column(0x16)
    3130                            .dwendtag $C$DW$T$30
    3131                    
    3132                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3133                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x48)
    3134                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    3135                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3136                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$30)
    3137                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3138                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3139                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x4f)
    3140                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x03)
    3141                    
    3142                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3143                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
    3144                    $C$DW$263       .dwtag  DW_TAG_member
    3145                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$10)
    3146                            .dwattr $C$DW$263, DW_AT_name("quot")
    3147                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("quot")
    3148                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3149                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3150                            .dwattr $C$DW$263, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3151                            .dwattr $C$DW$263, DW_AT_decl_line(0x3e)
    3152                            .dwattr $C$DW$263, DW_AT_decl_column(0x16)
    3153                    $C$DW$264       .dwtag  DW_TAG_member
    3154                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$10)
    3155                            .dwattr $C$DW$264, DW_AT_name("rem")
    3156                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("rem")
    3157                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3158                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3159                            .dwattr $C$DW$264, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3160                            .dwattr $C$DW$264, DW_AT_decl_line(0x3e)
    3161                            .dwattr $C$DW$264, DW_AT_decl_column(0x1c)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   64

    3162                            .dwendtag $C$DW$T$31
    3163                    
    3164                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3165                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x3e)
    3166                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    3167                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3168                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$31)
    3169                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    3170                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3171                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x3e)
    3172                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x23)
    3173                    
    3174                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3175                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x08)
    3176                    $C$DW$265       .dwtag  DW_TAG_member
    3177                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$10)
    3178                            .dwattr $C$DW$265, DW_AT_name("quot")
    3179                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("quot")
    3180                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3181                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3182                            .dwattr $C$DW$265, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3183                            .dwattr $C$DW$265, DW_AT_decl_line(0x40)
    3184                            .dwattr $C$DW$265, DW_AT_decl_column(0x17)
    3185                    $C$DW$266       .dwtag  DW_TAG_member
    3186                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$10)
    3187                            .dwattr $C$DW$266, DW_AT_name("rem")
    3188                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("rem")
    3189                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3190                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3191                            .dwattr $C$DW$266, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3192                            .dwattr $C$DW$266, DW_AT_decl_line(0x40)
    3193                            .dwattr $C$DW$266, DW_AT_decl_column(0x1d)
    3194                            .dwendtag $C$DW$T$32
    3195                    
    3196                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3197                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x40)
    3198                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3199                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3200                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$32)
    3201                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    3202                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3203                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x40)
    3204                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x24)
    3205                    
    3206                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3207                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x10)
    3208                    $C$DW$267       .dwtag  DW_TAG_member
    3209                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$14)
    3210                            .dwattr $C$DW$267, DW_AT_name("quot")
    3211                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("quot")
    3212                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3213                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3214                            .dwattr $C$DW$267, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3215                            .dwattr $C$DW$267, DW_AT_decl_line(0x43)
    3216                            .dwattr $C$DW$267, DW_AT_decl_column(0x1c)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   65

    3217                    $C$DW$268       .dwtag  DW_TAG_member
    3218                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$14)
    3219                            .dwattr $C$DW$268, DW_AT_name("rem")
    3220                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("rem")
    3221                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3222                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3223                            .dwattr $C$DW$268, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3224                            .dwattr $C$DW$268, DW_AT_decl_line(0x43)
    3225                            .dwattr $C$DW$268, DW_AT_decl_column(0x22)
    3226                            .dwendtag $C$DW$T$33
    3227                    
    3228                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3229                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x43)
    3230                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3231                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3232                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$33)
    3233                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    3234                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3235                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x43)
    3236                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x29)
    3237                    
    3238                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3239                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x24)
    3240                    $C$DW$269       .dwtag  DW_TAG_member
    3241                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$34)
    3242                            .dwattr $C$DW$269, DW_AT_name("area")
    3243                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("area")
    3244                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3245                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3246                            .dwattr $C$DW$269, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3247                            .dwattr $C$DW$269, DW_AT_decl_line(0x69)
    3248                            .dwattr $C$DW$269, DW_AT_decl_column(0x0d)
    3249                    $C$DW$270       .dwtag  DW_TAG_member
    3250                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$34)
    3251                            .dwattr $C$DW$270, DW_AT_name("xsum")
    3252                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("xsum")
    3253                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3254                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3255                            .dwattr $C$DW$270, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3256                            .dwattr $C$DW$270, DW_AT_decl_line(0x6a)
    3257                            .dwattr $C$DW$270, DW_AT_decl_column(0x0d)
    3258                    $C$DW$271       .dwtag  DW_TAG_member
    3259                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$34)
    3260                            .dwattr $C$DW$271, DW_AT_name("ysum")
    3261                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("ysum")
    3262                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3263                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3264                            .dwattr $C$DW$271, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3265                            .dwattr $C$DW$271, DW_AT_decl_line(0x6b)
    3266                            .dwattr $C$DW$271, DW_AT_decl_column(0x0d)
    3267                    $C$DW$272       .dwtag  DW_TAG_member
    3268                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$34)
    3269                            .dwattr $C$DW$272, DW_AT_name("xmin")
    3270                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("xmin")
    3271                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   66

    3272                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3273                            .dwattr $C$DW$272, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3274                            .dwattr $C$DW$272, DW_AT_decl_line(0x6d)
    3275                            .dwattr $C$DW$272, DW_AT_decl_column(0x0d)
    3276                    $C$DW$273       .dwtag  DW_TAG_member
    3277                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$34)
    3278                            .dwattr $C$DW$273, DW_AT_name("ymin")
    3279                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("ymin")
    3280                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3281                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3282                            .dwattr $C$DW$273, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3283                            .dwattr $C$DW$273, DW_AT_decl_line(0x6e)
    3284                            .dwattr $C$DW$273, DW_AT_decl_column(0x0d)
    3285                    $C$DW$274       .dwtag  DW_TAG_member
    3286                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$34)
    3287                            .dwattr $C$DW$274, DW_AT_name("xmax")
    3288                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("xmax")
    3289                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3290                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3291                            .dwattr $C$DW$274, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3292                            .dwattr $C$DW$274, DW_AT_decl_line(0x6f)
    3293                            .dwattr $C$DW$274, DW_AT_decl_column(0x0d)
    3294                    $C$DW$275       .dwtag  DW_TAG_member
    3295                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$34)
    3296                            .dwattr $C$DW$275, DW_AT_name("ymax")
    3297                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("ymax")
    3298                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3299                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3300                            .dwattr $C$DW$275, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3301                            .dwattr $C$DW$275, DW_AT_decl_line(0x70)
    3302                            .dwattr $C$DW$275, DW_AT_decl_column(0x0d)
    3303                    $C$DW$276       .dwtag  DW_TAG_member
    3304                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$34)
    3305                            .dwattr $C$DW$276, DW_AT_name("seedx")
    3306                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("seedx")
    3307                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3308                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3309                            .dwattr $C$DW$276, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3310                            .dwattr $C$DW$276, DW_AT_decl_line(0x72)
    3311                            .dwattr $C$DW$276, DW_AT_decl_column(0x0d)
    3312                    $C$DW$277       .dwtag  DW_TAG_member
    3313                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$34)
    3314                            .dwattr $C$DW$277, DW_AT_name("seedy")
    3315                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("seedy")
    3316                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3317                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3318                            .dwattr $C$DW$277, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3319                            .dwattr $C$DW$277, DW_AT_decl_line(0x73)
    3320                            .dwattr $C$DW$277, DW_AT_decl_column(0x0d)
    3321                            .dwendtag $C$DW$T$35
    3322                    
    3323                            .dwattr $C$DW$T$35, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3324                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x68)
    3325                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3326                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   67

    3327                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$35)
    3328                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    3329                            .dwattr $C$DW$T$91, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3330                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x75)
    3331                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    3332                    
    3333                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3334                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    3335                    $C$DW$278       .dwtag  DW_TAG_member
    3336                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$8)
    3337                            .dwattr $C$DW$278, DW_AT_name("daylight")
    3338                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("daylight")
    3339                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3340                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3341                            .dwattr $C$DW$278, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3342                            .dwattr $C$DW$278, DW_AT_decl_line(0x52)
    3343                            .dwattr $C$DW$278, DW_AT_decl_column(0x0b)
    3344                    $C$DW$279       .dwtag  DW_TAG_member
    3345                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$10)
    3346                            .dwattr $C$DW$279, DW_AT_name("timezone")
    3347                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("timezone")
    3348                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3349                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3350                            .dwattr $C$DW$279, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3351                            .dwattr $C$DW$279, DW_AT_decl_line(0x53)
    3352                            .dwattr $C$DW$279, DW_AT_decl_column(0x0b)
    3353                    $C$DW$280       .dwtag  DW_TAG_member
    3354                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$36)
    3355                            .dwattr $C$DW$280, DW_AT_name("tzname")
    3356                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("tzname")
    3357                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3358                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3359                            .dwattr $C$DW$280, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3360                            .dwattr $C$DW$280, DW_AT_decl_line(0x54)
    3361                            .dwattr $C$DW$280, DW_AT_decl_column(0x0b)
    3362                    $C$DW$281       .dwtag  DW_TAG_member
    3363                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$36)
    3364                            .dwattr $C$DW$281, DW_AT_name("dstname")
    3365                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("dstname")
    3366                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3367                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3368                            .dwattr $C$DW$281, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3369                            .dwattr $C$DW$281, DW_AT_decl_line(0x55)
    3370                            .dwattr $C$DW$281, DW_AT_decl_column(0x0b)
    3371                            .dwendtag $C$DW$T$37
    3372                    
    3373                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3374                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x51)
    3375                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    3376                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    3377                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$37)
    3378                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    3379                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3380                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x56)
    3381                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x03)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   68

    3382                    
    3383                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    3384                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x14)
    3385                    $C$DW$282       .dwtag  DW_TAG_member
    3386                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$34)
    3387                            .dwattr $C$DW$282, DW_AT_name("width")
    3388                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("width")
    3389                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3390                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3391                            .dwattr $C$DW$282, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3392                            .dwattr $C$DW$282, DW_AT_decl_line(0xaa)
    3393                            .dwattr $C$DW$282, DW_AT_decl_column(0x0d)
    3394                    $C$DW$283       .dwtag  DW_TAG_member
    3395                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$34)
    3396                            .dwattr $C$DW$283, DW_AT_name("height")
    3397                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("height")
    3398                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3399                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3400                            .dwattr $C$DW$283, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3401                            .dwattr $C$DW$283, DW_AT_decl_line(0xab)
    3402                            .dwattr $C$DW$283, DW_AT_decl_column(0x0d)
    3403                    $C$DW$284       .dwtag  DW_TAG_member
    3404                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$34)
    3405                            .dwattr $C$DW$284, DW_AT_name("marginPixels")
    3406                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("marginPixels")
    3407                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3408                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3409                            .dwattr $C$DW$284, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3410                            .dwattr $C$DW$284, DW_AT_decl_line(0xac)
    3411                            .dwattr $C$DW$284, DW_AT_decl_column(0x0d)
    3412                    $C$DW$285       .dwtag  DW_TAG_member
    3413                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    3414                            .dwattr $C$DW$285, DW_AT_name("fastDifferenceThreshold")
    3415                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    3416                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3417                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3418                            .dwattr $C$DW$285, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3419                            .dwattr $C$DW$285, DW_AT_decl_line(0xae)
    3420                            .dwattr $C$DW$285, DW_AT_decl_column(0x0d)
    3421                    $C$DW$286       .dwtag  DW_TAG_member
    3422                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$34)
    3423                            .dwattr $C$DW$286, DW_AT_name("n_features_desired")
    3424                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("n_features_desired")
    3425                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3426                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3427                            .dwattr $C$DW$286, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3428                            .dwattr $C$DW$286, DW_AT_decl_line(0xb2)
    3429                            .dwattr $C$DW$286, DW_AT_decl_column(0x0d)
    3430                            .dwendtag $C$DW$T$38
    3431                    
    3432                            .dwattr $C$DW$T$38, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3433                            .dwattr $C$DW$T$38, DW_AT_decl_line(0xa9)
    3434                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
    3435                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("CORBParameters")
    3436                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$38)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   69

    3437                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    3438                            .dwattr $C$DW$T$93, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3439                            .dwattr $C$DW$T$93, DW_AT_decl_line(0xb3)
    3440                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x02)
    3441                    
    3442                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3443                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x5a008)
    3444                    $C$DW$287       .dwtag  DW_TAG_member
    3445                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$34)
    3446                            .dwattr $C$DW$287, DW_AT_name("octave")
    3447                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("octave")
    3448                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3449                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3450                            .dwattr $C$DW$287, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3451                            .dwattr $C$DW$287, DW_AT_decl_line(0xb9)
    3452                            .dwattr $C$DW$287, DW_AT_decl_column(0x0d)
    3453                    $C$DW$288       .dwtag  DW_TAG_member
    3454                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$40)
    3455                            .dwattr $C$DW$288, DW_AT_name("relative_patterns")
    3456                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("relative_patterns")
    3457                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3458                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3459                            .dwattr $C$DW$288, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3460                            .dwattr $C$DW$288, DW_AT_decl_line(0xbb)
    3461                            .dwattr $C$DW$288, DW_AT_decl_column(0x0d)
    3462                    $C$DW$289       .dwtag  DW_TAG_member
    3463                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$42)
    3464                            .dwattr $C$DW$289, DW_AT_name("rotated_patterns")
    3465                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("rotated_patterns")
    3466                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c004]
    3467                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3468                            .dwattr $C$DW$289, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3469                            .dwattr $C$DW$289, DW_AT_decl_line(0xbc)
    3470                            .dwattr $C$DW$289, DW_AT_decl_column(0x0d)
    3471                    $C$DW$290       .dwtag  DW_TAG_member
    3472                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$34)
    3473                            .dwattr $C$DW$290, DW_AT_name("integralImageWidth")
    3474                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("integralImageWidth")
    3475                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a004]
    3476                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3477                            .dwattr $C$DW$290, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3478                            .dwattr $C$DW$290, DW_AT_decl_line(0xbd)
    3479                            .dwattr $C$DW$290, DW_AT_decl_column(0x0d)
    3480                            .dwendtag $C$DW$T$43
    3481                    
    3482                            .dwattr $C$DW$T$43, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3483                            .dwattr $C$DW$T$43, DW_AT_decl_line(0xb8)
    3484                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    3485                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("CORBPatterns")
    3486                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$43)
    3487                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3488                            .dwattr $C$DW$T$47, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3489                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xbe)
    3490                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x02)
    3491                    
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   70

    3492                    $C$DW$T$46      .dwtag  DW_TAG_structure_type
    3493                            .dwattr $C$DW$T$46, DW_AT_byte_size(0x400)
    3494                    $C$DW$291       .dwtag  DW_TAG_member
    3495                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$44)
    3496                            .dwattr $C$DW$291, DW_AT_name("orientation_horizontal_offsets")
    3497                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("orientation_horizontal_offsets")
    3498                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3499                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3500                            .dwattr $C$DW$291, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3501                            .dwattr $C$DW$291, DW_AT_decl_line(0xc4)
    3502                            .dwattr $C$DW$291, DW_AT_decl_column(0x0d)
    3503                    $C$DW$292       .dwtag  DW_TAG_member
    3504                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$44)
    3505                            .dwattr $C$DW$292, DW_AT_name("orientation_vertical_offsets")
    3506                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("orientation_vertical_offsets")
    3507                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
    3508                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3509                            .dwattr $C$DW$292, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3510                            .dwattr $C$DW$292, DW_AT_decl_line(0xc5)
    3511                            .dwattr $C$DW$292, DW_AT_decl_column(0x0d)
    3512                    $C$DW$293       .dwtag  DW_TAG_member
    3513                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$45)
    3514                            .dwattr $C$DW$293, DW_AT_name("u_max")
    3515                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("u_max")
    3516                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c0]
    3517                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3518                            .dwattr $C$DW$293, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3519                            .dwattr $C$DW$293, DW_AT_decl_line(0xc6)
    3520                            .dwattr $C$DW$293, DW_AT_decl_column(0x0d)
    3521                            .dwendtag $C$DW$T$46
    3522                    
    3523                            .dwattr $C$DW$T$46, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3524                            .dwattr $C$DW$T$46, DW_AT_decl_line(0xc3)
    3525                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x10)
    3526                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOrientationOffsets")
    3527                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$46)
    3528                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3529                            .dwattr $C$DW$T$48, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3530                            .dwattr $C$DW$T$48, DW_AT_decl_line(0xc7)
    3531                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x02)
    3532                    
    3533                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3534                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x5a420)
    3535                    $C$DW$294       .dwtag  DW_TAG_member
    3536                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$47)
    3537                            .dwattr $C$DW$294, DW_AT_name("patterns")
    3538                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("patterns")
    3539                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3540                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3541                            .dwattr $C$DW$294, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3542                            .dwattr $C$DW$294, DW_AT_decl_line(0xcd)
    3543                            .dwattr $C$DW$294, DW_AT_decl_column(0x1c)
    3544                    $C$DW$295       .dwtag  DW_TAG_member
    3545                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$48)
    3546                            .dwattr $C$DW$295, DW_AT_name("offsets")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   71

    3547                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("offsets")
    3548                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a008]
    3549                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3550                            .dwattr $C$DW$295, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3551                            .dwattr $C$DW$295, DW_AT_decl_line(0xce)
    3552                            .dwattr $C$DW$295, DW_AT_decl_column(0x1c)
    3553                    $C$DW$296       .dwtag  DW_TAG_member
    3554                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$22)
    3555                            .dwattr $C$DW$296, DW_AT_name("image")
    3556                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("image")
    3557                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a408]
    3558                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3559                            .dwattr $C$DW$296, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3560                            .dwattr $C$DW$296, DW_AT_decl_line(0xcf)
    3561                            .dwattr $C$DW$296, DW_AT_decl_column(0x1c)
    3562                    $C$DW$297       .dwtag  DW_TAG_member
    3563                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$22)
    3564                            .dwattr $C$DW$297, DW_AT_name("prefimage")
    3565                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("prefimage")
    3566                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a40c]
    3567                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3568                            .dwattr $C$DW$297, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3569                            .dwattr $C$DW$297, DW_AT_decl_line(0xd0)
    3570                            .dwattr $C$DW$297, DW_AT_decl_column(0x1c)
    3571                    $C$DW$298       .dwtag  DW_TAG_member
    3572                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$24)
    3573                            .dwattr $C$DW$298, DW_AT_name("harrisImage")
    3574                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("harrisImage")
    3575                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a410]
    3576                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3577                            .dwattr $C$DW$298, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3578                            .dwattr $C$DW$298, DW_AT_decl_line(0xd1)
    3579                            .dwattr $C$DW$298, DW_AT_decl_column(0x1c)
    3580                    $C$DW$299       .dwtag  DW_TAG_member
    3581                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$49)
    3582                            .dwattr $C$DW$299, DW_AT_name("integralImage")
    3583                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("integralImage")
    3584                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a414]
    3585                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3586                            .dwattr $C$DW$299, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3587                            .dwattr $C$DW$299, DW_AT_decl_line(0xd2)
    3588                            .dwattr $C$DW$299, DW_AT_decl_column(0x1c)
    3589                    $C$DW$300       .dwtag  DW_TAG_member
    3590                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$27)
    3591                            .dwattr $C$DW$300, DW_AT_name("scratchBuffer")
    3592                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("scratchBuffer")
    3593                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a418]
    3594                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3595                            .dwattr $C$DW$300, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3596                            .dwattr $C$DW$300, DW_AT_decl_line(0xd3)
    3597                            .dwattr $C$DW$300, DW_AT_decl_column(0x1c)
    3598                    $C$DW$301       .dwtag  DW_TAG_member
    3599                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$51)
    3600                            .dwattr $C$DW$301, DW_AT_name("orbPattern31")
    3601                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("orbPattern31")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   72

    3602                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a41c]
    3603                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3604                            .dwattr $C$DW$301, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3605                            .dwattr $C$DW$301, DW_AT_decl_line(0xd4)
    3606                            .dwattr $C$DW$301, DW_AT_decl_column(0x1c)
    3607                            .dwendtag $C$DW$T$52
    3608                    
    3609                            .dwattr $C$DW$T$52, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3610                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xcc)
    3611                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    3612                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("CORBInput")
    3613                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$52)
    3614                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    3615                            .dwattr $C$DW$T$94, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3616                            .dwattr $C$DW$T$94, DW_AT_decl_line(0xd5)
    3617                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x02)
    3618                    
    3619                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3620                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x38)
    3621                    $C$DW$302       .dwtag  DW_TAG_member
    3622                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$34)
    3623                            .dwattr $C$DW$302, DW_AT_name("x")
    3624                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("x")
    3625                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3626                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3627                            .dwattr $C$DW$302, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3628                            .dwattr $C$DW$302, DW_AT_decl_line(0xdc)
    3629                            .dwattr $C$DW$302, DW_AT_decl_column(0x0d)
    3630                    $C$DW$303       .dwtag  DW_TAG_member
    3631                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$34)
    3632                            .dwattr $C$DW$303, DW_AT_name("y")
    3633                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("y")
    3634                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3635                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3636                            .dwattr $C$DW$303, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3637                            .dwattr $C$DW$303, DW_AT_decl_line(0xde)
    3638                            .dwattr $C$DW$303, DW_AT_decl_column(0x0d)
    3639                    $C$DW$304       .dwtag  DW_TAG_member
    3640                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$34)
    3641                            .dwattr $C$DW$304, DW_AT_name("octave")
    3642                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("octave")
    3643                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3644                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3645                            .dwattr $C$DW$304, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3646                            .dwattr $C$DW$304, DW_AT_decl_line(0xe0)
    3647                            .dwattr $C$DW$304, DW_AT_decl_column(0x0d)
    3648                    $C$DW$305       .dwtag  DW_TAG_member
    3649                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$53)
    3650                            .dwattr $C$DW$305, DW_AT_name("angle")
    3651                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("angle")
    3652                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3653                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3654                            .dwattr $C$DW$305, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3655                            .dwattr $C$DW$305, DW_AT_decl_line(0xe3)
    3656                            .dwattr $C$DW$305, DW_AT_decl_column(0x0e)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   73

    3657                    $C$DW$306       .dwtag  DW_TAG_member
    3658                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$34)
    3659                            .dwattr $C$DW$306, DW_AT_name("fastResponse")
    3660                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("fastResponse")
    3661                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3662                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3663                            .dwattr $C$DW$306, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3664                            .dwattr $C$DW$306, DW_AT_decl_line(0xe4)
    3665                            .dwattr $C$DW$306, DW_AT_decl_column(0x0e)
    3666                    $C$DW$307       .dwtag  DW_TAG_member
    3667                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$23)
    3668                            .dwattr $C$DW$307, DW_AT_name("harrisResponse")
    3669                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("harrisResponse")
    3670                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3671                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3672                            .dwattr $C$DW$307, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3673                            .dwattr $C$DW$307, DW_AT_decl_line(0xe5)
    3674                            .dwattr $C$DW$307, DW_AT_decl_column(0x0e)
    3675                    $C$DW$308       .dwtag  DW_TAG_member
    3676                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$54)
    3677                            .dwattr $C$DW$308, DW_AT_name("descriptor")
    3678                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("descriptor")
    3679                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3680                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3681                            .dwattr $C$DW$308, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3682                            .dwattr $C$DW$308, DW_AT_decl_line(0xe6)
    3683                            .dwattr $C$DW$308, DW_AT_decl_column(0x0e)
    3684                            .dwendtag $C$DW$T$55
    3685                    
    3686                            .dwattr $C$DW$T$55, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3687                            .dwattr $C$DW$T$55, DW_AT_decl_line(0xdb)
    3688                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    3689                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CORBFeature")
    3690                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3691                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3692                            .dwattr $C$DW$T$56, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3693                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xe7)
    3694                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x02)
    3695                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    3696                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    3697                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    3698                    
    3699                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3700                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x08)
    3701                    $C$DW$309       .dwtag  DW_TAG_member
    3702                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$57)
    3703                            .dwattr $C$DW$309, DW_AT_name("features")
    3704                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("features")
    3705                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3706                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3707                            .dwattr $C$DW$309, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3708                            .dwattr $C$DW$309, DW_AT_decl_line(0xed)
    3709                            .dwattr $C$DW$309, DW_AT_decl_column(0x12)
    3710                    $C$DW$310       .dwtag  DW_TAG_member
    3711                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$34)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   74

    3712                            .dwattr $C$DW$310, DW_AT_name("n_features")
    3713                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("n_features")
    3714                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3715                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3716                            .dwattr $C$DW$310, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\c
    3717                            .dwattr $C$DW$310, DW_AT_decl_line(0xee)
    3718                            .dwattr $C$DW$310, DW_AT_decl_column(0x12)
    3719                            .dwendtag $C$DW$T$58
    3720                    
    3721                            .dwattr $C$DW$T$58, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3722                            .dwattr $C$DW$T$58, DW_AT_decl_line(0xec)
    3723                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    3724                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOutput")
    3725                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$58)
    3726                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    3727                            .dwattr $C$DW$T$95, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3728                            .dwattr $C$DW$T$95, DW_AT_decl_line(0xef)
    3729                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x02)
    3730                    
    3731                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3732                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x20)
    3733                    $C$DW$311       .dwtag  DW_TAG_member
    3734                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$60)
    3735                            .dwattr $C$DW$311, DW_AT_name("val")
    3736                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("val")
    3737                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3738                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3739                            .dwattr $C$DW$311, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../c
    3740                            .dwattr $C$DW$311, DW_AT_decl_line(0x25)
    3741                            .dwattr $C$DW$311, DW_AT_decl_column(0x0c)
    3742                            .dwendtag $C$DW$T$61
    3743                    
    3744                            .dwattr $C$DW$T$61, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../
    3745                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x24)
    3746                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x10)
    3747                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("RotationMatrix")
    3748                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$61)
    3749                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    3750                            .dwattr $C$DW$T$96, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\../
    3751                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x26)
    3752                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x02)
    3753                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3754                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3755                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3756                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3757                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3758                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    3759                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$3)
    3760                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    3761                            .dwattr $C$DW$T$97, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..\
    3762                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x5c)
    3763                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x19)
    3764                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3765                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3766                            .dwattr $C$DW$T$4, DW_AT_name("bool")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   75

    3767                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3768                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3769                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3770                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3771                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3772                    $C$DW$T$124     .dwtag  DW_TAG_pointer_type
    3773                            .dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$5)
    3774                            .dwattr $C$DW$T$124, DW_AT_address_class(0x20)
    3775                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    3776                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$5)
    3777                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3778                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3779                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2a)
    3780                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1d)
    3781                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3782                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3783                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    3784                    $C$DW$T$136     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    3785                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$50)
    3786                            .dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
    3787                            .dwattr $C$DW$T$136, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3788                            .dwattr $C$DW$T$136, DW_AT_decl_line(0x39)
    3789                            .dwattr $C$DW$T$136, DW_AT_decl_column(0x17)
    3790                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3791                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3792                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3793                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3794                    $C$DW$T$29      .dwtag  DW_TAG_pointer_type
    3795                            .dwattr $C$DW$T$29, DW_AT_type(*$C$DW$T$6)
    3796                            .dwattr $C$DW$T$29, DW_AT_address_class(0x20)
    3797                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    3798                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    3799                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    3800                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3801                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
    3802                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    3803                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    3804                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$19)
    3805                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
    3806                    $C$DW$T$67      .dwtag  DW_TAG_restrict_type
    3807                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$22)
    3808                    
    3809                    $C$DW$T$54      .dwtag  DW_TAG_array_type
    3810                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$19)
    3811                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3812                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x20)
    3813                    $C$DW$312       .dwtag  DW_TAG_subrange_type
    3814                            .dwattr $C$DW$312, DW_AT_upper_bound(0x1f)
    3815                            .dwendtag $C$DW$T$54
    3816                    
    3817                    $C$DW$T$138     .dwtag  DW_TAG_const_type
    3818                            .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$19)
    3819                    $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    3820                            .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$19)
    3821                            .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   76

    3822                            .dwattr $C$DW$T$139, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3823                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x3a)
    3824                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x16)
    3825                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3826                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3827                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3828                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3829                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3830                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3831                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3832                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3833                    $C$DW$T$140     .dwtag  DW_TAG_pointer_type
    3834                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$8)
    3835                            .dwattr $C$DW$T$140, DW_AT_address_class(0x20)
    3836                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3837                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$8)
    3838                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3839                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3840                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x2c)
    3841                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x1d)
    3842                    $C$DW$T$24      .dwtag  DW_TAG_pointer_type
    3843                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$23)
    3844                            .dwattr $C$DW$T$24, DW_AT_address_class(0x20)
    3845                    $C$DW$T$69      .dwtag  DW_TAG_restrict_type
    3846                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$24)
    3847                    $C$DW$T$141     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    3848                            .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$23)
    3849                            .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    3850                            .dwattr $C$DW$T$141, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3851                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x3c)
    3852                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x17)
    3853                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3854                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3855                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3856                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3857                    $C$DW$T$142     .dwtag  DW_TAG_pointer_type
    3858                            .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$9)
    3859                            .dwattr $C$DW$T$142, DW_AT_address_class(0x20)
    3860                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3861                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    3862                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    3863                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3864                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x2d)
    3865                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x1c)
    3866                    $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    3867                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    3868                            .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    3869                    $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    3870                            .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$20)
    3871                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    3872                            .dwattr $C$DW$T$144, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3873                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x3d)
    3874                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x16)
    3875                    $C$DW$T$143     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3876                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$9)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   77

    3877                            .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
    3878                            .dwattr $C$DW$T$143, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3879                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x53)
    3880                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x1a)
    3881                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3882                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3883                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3884                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3885                    $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    3886                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$10)
    3887                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    3888                            .dwattr $C$DW$T$160, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3889                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x53)
    3890                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x0d)
    3891                    $C$DW$T$34      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3892                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$10)
    3893                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    3894                            .dwattr $C$DW$T$34, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3895                            .dwattr $C$DW$T$34, DW_AT_decl_line(0x2e)
    3896                            .dwattr $C$DW$T$34, DW_AT_decl_column(0x1d)
    3897                    $C$DW$T$154     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    3898                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$34)
    3899                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    3900                            .dwattr $C$DW$T$154, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_computeOrientation\..
    3901                            .dwattr $C$DW$T$154, DW_AT_decl_line(0x77)
    3902                            .dwattr $C$DW$T$154, DW_AT_decl_column(0x11)
    3903                    
    3904                    $C$DW$T$39      .dwtag  DW_TAG_array_type
    3905                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$34)
    3906                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3907                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x2000)
    3908                    $C$DW$313       .dwtag  DW_TAG_subrange_type
    3909                            .dwattr $C$DW$313, DW_AT_upper_bound(0x7ff)
    3910                            .dwendtag $C$DW$T$39
    3911                    
    3912                    
    3913                    $C$DW$T$40      .dwtag  DW_TAG_array_type
    3914                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$34)
    3915                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    3916                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x3c000)
    3917                    $C$DW$314       .dwtag  DW_TAG_subrange_type
    3918                            .dwattr $C$DW$314, DW_AT_upper_bound(0x1d)
    3919                    $C$DW$315       .dwtag  DW_TAG_subrange_type
    3920                            .dwattr $C$DW$315, DW_AT_upper_bound(0x7ff)
    3921                            .dwendtag $C$DW$T$40
    3922                    
    3923                    
    3924                    $C$DW$T$41      .dwtag  DW_TAG_array_type
    3925                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$34)
    3926                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3927                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x1000)
    3928                    $C$DW$316       .dwtag  DW_TAG_subrange_type
    3929                            .dwattr $C$DW$316, DW_AT_upper_bound(0x3ff)
    3930                            .dwendtag $C$DW$T$41
    3931                    
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   78

    3932                    
    3933                    $C$DW$T$42      .dwtag  DW_TAG_array_type
    3934                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$34)
    3935                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3936                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x1e000)
    3937                    $C$DW$317       .dwtag  DW_TAG_subrange_type
    3938                            .dwattr $C$DW$317, DW_AT_upper_bound(0x1d)
    3939                    $C$DW$318       .dwtag  DW_TAG_subrange_type
    3940                            .dwattr $C$DW$318, DW_AT_upper_bound(0x3ff)
    3941                            .dwendtag $C$DW$T$42
    3942                    
    3943                    
    3944                    $C$DW$T$44      .dwtag  DW_TAG_array_type
    3945                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$34)
    3946                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3947                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x1e0)
    3948                    $C$DW$319       .dwtag  DW_TAG_subrange_type
    3949                            .dwattr $C$DW$319, DW_AT_upper_bound(0x77)
    3950                            .dwendtag $C$DW$T$44
    3951                    
    3952                    
    3953                    $C$DW$T$45      .dwtag  DW_TAG_array_type
    3954                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$34)
    3955                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3956                            .dwattr $C$DW$T$45, DW_AT_byte_size(0x40)
    3957                    $C$DW$320       .dwtag  DW_TAG_subrange_type
    3958                            .dwattr $C$DW$320, DW_AT_upper_bound(0x0f)
    3959                            .dwendtag $C$DW$T$45
    3960                    
    3961                    
    3962                    $C$DW$T$62      .dwtag  DW_TAG_array_type
    3963                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$34)
    3964                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3965                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x10)
    3966                    $C$DW$321       .dwtag  DW_TAG_subrange_type
    3967                            .dwattr $C$DW$321, DW_AT_upper_bound(0x03)
    3968                            .dwendtag $C$DW$T$62
    3969                    
    3970                    $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    3971                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$34)
    3972                            .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    3973                    $C$DW$T$155     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    3974                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$34)
    3975                            .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    3976                            .dwattr $C$DW$T$155, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3977                            .dwattr $C$DW$T$155, DW_AT_decl_line(0x4b)
    3978                            .dwattr $C$DW$T$155, DW_AT_decl_column(0x17)
    3979                    $C$DW$T$156     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    3980                            .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$34)
    3981                            .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    3982                            .dwattr $C$DW$T$156, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3983                            .dwattr $C$DW$T$156, DW_AT_decl_line(0x4e)
    3984                            .dwattr $C$DW$T$156, DW_AT_decl_column(0x17)
    3985                    $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    3986                            .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$34)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:47 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_computeOrientation/VLIB_ORB_computeOrientation_d.se66 PAGE   79

    3987                            .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    3988                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3989                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x49)
    3990                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x17)
    3991                    $C$DW$T$158     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
