TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Thu Mar 19 12:44:07 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    3180                    $C$DW$T$68      .dwtag  DW_TAG_enumeration_type
    3181                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x04)
    3182                    $C$DW$256       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    3183                            .dwattr $C$DW$256, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3184                            .dwattr $C$DW$256, DW_AT_decl_line(0x72)
    3185                            .dwattr $C$DW$256, DW_AT_decl_column(0x05)
    3186                    $C$DW$257       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    3187                            .dwattr $C$DW$257, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3188                            .dwattr $C$DW$257, DW_AT_decl_line(0x73)
    3189                            .dwattr $C$DW$257, DW_AT_decl_column(0x05)
    3190                            .dwendtag $C$DW$T$68
    3191                    
    3192                            .dwattr $C$DW$T$68, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3193                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x71)
    3194                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x06)
    3195                    
    3196                    $C$DW$T$69      .dwtag  DW_TAG_enumeration_type
    3197                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x04)
    3198                    $C$DW$258       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_FALSE"), DW_AT_const_value(0x00)
    3199                            .dwattr $C$DW$258, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3200                            .dwattr $C$DW$258, DW_AT_decl_line(0x8f)
    3201                            .dwattr $C$DW$258, DW_AT_decl_column(0x05)
    3202                    $C$DW$259       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_TRUE"), DW_AT_const_value(0x01)
    3203                            .dwattr $C$DW$259, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3204                            .dwattr $C$DW$259, DW_AT_decl_line(0x90)
    3205                            .dwattr $C$DW$259, DW_AT_decl_column(0x05)
    3206                            .dwendtag $C$DW$T$69
    3207                    
    3208                            .dwattr $C$DW$T$69, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3209                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x8e)
    3210                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x0e)
    3211                    $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CORB_Bool")
    3212                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    3213                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3214                            .dwattr $C$DW$T$70, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3215                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x91)
    3216                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x02)
    3217                    
    3218                    $C$DW$T$71      .dwtag  DW_TAG_enumeration_type
    3219                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    3220                    $C$DW$260       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_OK"), DW_AT_const_value(0x00)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   67

    3221                            .dwattr $C$DW$260, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3222                            .dwattr $C$DW$260, DW_AT_decl_line(0xa2)
    3223                            .dwattr $C$DW$260, DW_AT_decl_column(0x05)
    3224                    $C$DW$261       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_FAIL"), DW_AT_const_value(-1)
    3225                            .dwattr $C$DW$261, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3226                            .dwattr $C$DW$261, DW_AT_decl_line(0xa3)
    3227                            .dwattr $C$DW$261, DW_AT_decl_column(0x05)
    3228                            .dwendtag $C$DW$T$71
    3229                    
    3230                            .dwattr $C$DW$T$71, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3231                            .dwattr $C$DW$T$71, DW_AT_decl_line(0xa1)
    3232                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x0e)
    3233                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("CORBResult")
    3234                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    3235                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    3236                            .dwattr $C$DW$T$72, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3237                            .dwattr $C$DW$T$72, DW_AT_decl_line(0xa4)
    3238                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x02)
    3239                    
    3240                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3241                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x14)
    3242                    $C$DW$262       .dwtag  DW_TAG_member
    3243                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$19)
    3244                            .dwattr $C$DW$262, DW_AT_name("width")
    3245                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("width")
    3246                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3247                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3248                            .dwattr $C$DW$262, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3249                            .dwattr $C$DW$262, DW_AT_decl_line(0xaa)
    3250                            .dwattr $C$DW$262, DW_AT_decl_column(0x0d)
    3251                    $C$DW$263       .dwtag  DW_TAG_member
    3252                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    3253                            .dwattr $C$DW$263, DW_AT_name("height")
    3254                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("height")
    3255                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3256                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3257                            .dwattr $C$DW$263, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3258                            .dwattr $C$DW$263, DW_AT_decl_line(0xab)
    3259                            .dwattr $C$DW$263, DW_AT_decl_column(0x0d)
    3260                    $C$DW$264       .dwtag  DW_TAG_member
    3261                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3262                            .dwattr $C$DW$264, DW_AT_name("marginPixels")
    3263                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("marginPixels")
    3264                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3265                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3266                            .dwattr $C$DW$264, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3267                            .dwattr $C$DW$264, DW_AT_decl_line(0xac)
    3268                            .dwattr $C$DW$264, DW_AT_decl_column(0x0d)
    3269                    $C$DW$265       .dwtag  DW_TAG_member
    3270                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    3271                            .dwattr $C$DW$265, DW_AT_name("fastDifferenceThreshold")
    3272                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    3273                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3274                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3275                            .dwattr $C$DW$265, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   68

    3276                            .dwattr $C$DW$265, DW_AT_decl_line(0xae)
    3277                            .dwattr $C$DW$265, DW_AT_decl_column(0x0d)
    3278                    $C$DW$266       .dwtag  DW_TAG_member
    3279                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$19)
    3280                            .dwattr $C$DW$266, DW_AT_name("n_features_desired")
    3281                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("n_features_desired")
    3282                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3283                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3284                            .dwattr $C$DW$266, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3285                            .dwattr $C$DW$266, DW_AT_decl_line(0xb2)
    3286                            .dwattr $C$DW$266, DW_AT_decl_column(0x0d)
    3287                            .dwendtag $C$DW$T$21
    3288                    
    3289                            .dwattr $C$DW$T$21, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3290                            .dwattr $C$DW$T$21, DW_AT_decl_line(0xa9)
    3291                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    3292                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("CORBParameters")
    3293                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$21)
    3294                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    3295                            .dwattr $C$DW$T$74, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3296                            .dwattr $C$DW$T$74, DW_AT_decl_line(0xb3)
    3297                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x02)
    3298                    $C$DW$T$75      .dwtag  DW_TAG_const_type
    3299                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3300                    
    3301                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3302                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x38)
    3303                    $C$DW$267       .dwtag  DW_TAG_member
    3304                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    3305                            .dwattr $C$DW$267, DW_AT_name("x")
    3306                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("x")
    3307                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3308                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3309                            .dwattr $C$DW$267, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3310                            .dwattr $C$DW$267, DW_AT_decl_line(0xdc)
    3311                            .dwattr $C$DW$267, DW_AT_decl_column(0x0d)
    3312                    $C$DW$268       .dwtag  DW_TAG_member
    3313                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$19)
    3314                            .dwattr $C$DW$268, DW_AT_name("y")
    3315                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("y")
    3316                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3317                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3318                            .dwattr $C$DW$268, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3319                            .dwattr $C$DW$268, DW_AT_decl_line(0xde)
    3320                            .dwattr $C$DW$268, DW_AT_decl_column(0x0d)
    3321                    $C$DW$269       .dwtag  DW_TAG_member
    3322                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$19)
    3323                            .dwattr $C$DW$269, DW_AT_name("octave")
    3324                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("octave")
    3325                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3326                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3327                            .dwattr $C$DW$269, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3328                            .dwattr $C$DW$269, DW_AT_decl_line(0xe0)
    3329                            .dwattr $C$DW$269, DW_AT_decl_column(0x0d)
    3330                    $C$DW$270       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   69

    3331                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$22)
    3332                            .dwattr $C$DW$270, DW_AT_name("angle")
    3333                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("angle")
    3334                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3335                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3336                            .dwattr $C$DW$270, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3337                            .dwattr $C$DW$270, DW_AT_decl_line(0xe3)
    3338                            .dwattr $C$DW$270, DW_AT_decl_column(0x0e)
    3339                    $C$DW$271       .dwtag  DW_TAG_member
    3340                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    3341                            .dwattr $C$DW$271, DW_AT_name("fastResponse")
    3342                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("fastResponse")
    3343                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3344                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3345                            .dwattr $C$DW$271, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3346                            .dwattr $C$DW$271, DW_AT_decl_line(0xe4)
    3347                            .dwattr $C$DW$271, DW_AT_decl_column(0x0e)
    3348                    $C$DW$272       .dwtag  DW_TAG_member
    3349                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$23)
    3350                            .dwattr $C$DW$272, DW_AT_name("harrisResponse")
    3351                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("harrisResponse")
    3352                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3353                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3354                            .dwattr $C$DW$272, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3355                            .dwattr $C$DW$272, DW_AT_decl_line(0xe5)
    3356                            .dwattr $C$DW$272, DW_AT_decl_column(0x0e)
    3357                    $C$DW$273       .dwtag  DW_TAG_member
    3358                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$24)
    3359                            .dwattr $C$DW$273, DW_AT_name("descriptor")
    3360                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("descriptor")
    3361                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3362                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3363                            .dwattr $C$DW$273, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3364                            .dwattr $C$DW$273, DW_AT_decl_line(0xe6)
    3365                            .dwattr $C$DW$273, DW_AT_decl_column(0x0e)
    3366                            .dwendtag $C$DW$T$25
    3367                    
    3368                            .dwattr $C$DW$T$25, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3369                            .dwattr $C$DW$T$25, DW_AT_decl_line(0xdb)
    3370                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3371                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("CORBFeature")
    3372                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$25)
    3373                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3374                            .dwattr $C$DW$T$48, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3375                            .dwattr $C$DW$T$48, DW_AT_decl_line(0xe7)
    3376                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x02)
    3377                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    3378                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3379                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    3380                    $C$DW$T$79      .dwtag  DW_TAG_pointer_type
    3381                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$25)
    3382                            .dwattr $C$DW$T$79, DW_AT_address_class(0x20)
    3383                    
    3384                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3385                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x20)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   70

    3386                    $C$DW$274       .dwtag  DW_TAG_member
    3387                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$20)
    3388                            .dwattr $C$DW$274, DW_AT_name("testPattern")
    3389                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("testPattern")
    3390                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3391                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3392                            .dwattr $C$DW$274, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3393                            .dwattr $C$DW$274, DW_AT_decl_line(0x25)
    3394                            .dwattr $C$DW$274, DW_AT_decl_column(0x15)
    3395                    $C$DW$275       .dwtag  DW_TAG_member
    3396                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$26)
    3397                            .dwattr $C$DW$275, DW_AT_name("staticIn")
    3398                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("staticIn")
    3399                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3400                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3401                            .dwattr $C$DW$275, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3402                            .dwattr $C$DW$275, DW_AT_decl_line(0x26)
    3403                            .dwattr $C$DW$275, DW_AT_decl_column(0x15)
    3404                    $C$DW$276       .dwtag  DW_TAG_member
    3405                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$28)
    3406                            .dwattr $C$DW$276, DW_AT_name("staticOut")
    3407                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("staticOut")
    3408                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3409                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3410                            .dwattr $C$DW$276, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3411                            .dwattr $C$DW$276, DW_AT_decl_line(0x27)
    3412                            .dwattr $C$DW$276, DW_AT_decl_column(0x15)
    3413                    $C$DW$277       .dwtag  DW_TAG_member
    3414                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    3415                            .dwattr $C$DW$277, DW_AT_name("out_n_features")
    3416                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("out_n_features")
    3417                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3418                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3419                            .dwattr $C$DW$277, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3420                            .dwattr $C$DW$277, DW_AT_decl_line(0x28)
    3421                            .dwattr $C$DW$277, DW_AT_decl_column(0x15)
    3422                    $C$DW$278       .dwtag  DW_TAG_member
    3423                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$27)
    3424                            .dwattr $C$DW$278, DW_AT_name("imageWidth")
    3425                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("imageWidth")
    3426                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3427                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3428                            .dwattr $C$DW$278, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3429                            .dwattr $C$DW$278, DW_AT_decl_line(0x29)
    3430                            .dwattr $C$DW$278, DW_AT_decl_column(0x15)
    3431                    $C$DW$279       .dwtag  DW_TAG_member
    3432                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$27)
    3433                            .dwattr $C$DW$279, DW_AT_name("imageHeight")
    3434                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("imageHeight")
    3435                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3436                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3437                            .dwattr $C$DW$279, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3438                            .dwattr $C$DW$279, DW_AT_decl_line(0x2a)
    3439                            .dwattr $C$DW$279, DW_AT_decl_column(0x15)
    3440                    $C$DW$280       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   71

    3441                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$27)
    3442                            .dwattr $C$DW$280, DW_AT_name("imagePitch")
    3443                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("imagePitch")
    3444                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3445                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3446                            .dwattr $C$DW$280, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3447                            .dwattr $C$DW$280, DW_AT_decl_line(0x2b)
    3448                            .dwattr $C$DW$280, DW_AT_decl_column(0x15)
    3449                    $C$DW$281       .dwtag  DW_TAG_member
    3450                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$29)
    3451                            .dwattr $C$DW$281, DW_AT_name("max_num_features")
    3452                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("max_num_features")
    3453                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3454                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3455                            .dwattr $C$DW$281, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3456                            .dwattr $C$DW$281, DW_AT_decl_line(0x2c)
    3457                            .dwattr $C$DW$281, DW_AT_decl_column(0x15)
    3458                    $C$DW$282       .dwtag  DW_TAG_member
    3459                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$31)
    3460                            .dwattr $C$DW$282, DW_AT_name("desc")
    3461                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("desc")
    3462                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3463                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3464                            .dwattr $C$DW$282, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3465                            .dwattr $C$DW$282, DW_AT_decl_line(0x2d)
    3466                            .dwattr $C$DW$282, DW_AT_decl_column(0x15)
    3467                            .dwendtag $C$DW$T$32
    3468                    
    3469                            .dwattr $C$DW$T$32, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3470                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x24)
    3471                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3472                    $C$DW$T$80      .dwtag  DW_TAG_pointer_type
    3473                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$32)
    3474                            .dwattr $C$DW$T$80, DW_AT_address_class(0x20)
    3475                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("originalfast12_detectCorners_testParams_t")
    3476                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$32)
    3477                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    3478                            .dwattr $C$DW$T$82, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3479                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x2e)
    3480                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    3481                    $C$DW$T$83      .dwtag  DW_TAG_pointer_type
    3482                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    3483                            .dwattr $C$DW$T$83, DW_AT_address_class(0x20)
    3484                    $C$DW$T$84      .dwtag  DW_TAG_pointer_type
    3485                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$83)
    3486                            .dwattr $C$DW$T$84, DW_AT_address_class(0x20)
    3487                    
    3488                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    3489                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x5a008)
    3490                    $C$DW$283       .dwtag  DW_TAG_member
    3491                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$19)
    3492                            .dwattr $C$DW$283, DW_AT_name("octave")
    3493                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("octave")
    3494                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3495                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   72

    3496                            .dwattr $C$DW$283, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3497                            .dwattr $C$DW$283, DW_AT_decl_line(0xb9)
    3498                            .dwattr $C$DW$283, DW_AT_decl_column(0x0d)
    3499                    $C$DW$284       .dwtag  DW_TAG_member
    3500                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$34)
    3501                            .dwattr $C$DW$284, DW_AT_name("relative_patterns")
    3502                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("relative_patterns")
    3503                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3504                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3505                            .dwattr $C$DW$284, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3506                            .dwattr $C$DW$284, DW_AT_decl_line(0xbb)
    3507                            .dwattr $C$DW$284, DW_AT_decl_column(0x0d)
    3508                    $C$DW$285       .dwtag  DW_TAG_member
    3509                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$36)
    3510                            .dwattr $C$DW$285, DW_AT_name("rotated_patterns")
    3511                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("rotated_patterns")
    3512                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c004]
    3513                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3514                            .dwattr $C$DW$285, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3515                            .dwattr $C$DW$285, DW_AT_decl_line(0xbc)
    3516                            .dwattr $C$DW$285, DW_AT_decl_column(0x0d)
    3517                    $C$DW$286       .dwtag  DW_TAG_member
    3518                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    3519                            .dwattr $C$DW$286, DW_AT_name("integralImageWidth")
    3520                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("integralImageWidth")
    3521                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a004]
    3522                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3523                            .dwattr $C$DW$286, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3524                            .dwattr $C$DW$286, DW_AT_decl_line(0xbd)
    3525                            .dwattr $C$DW$286, DW_AT_decl_column(0x0d)
    3526                            .dwendtag $C$DW$T$37
    3527                    
    3528                            .dwattr $C$DW$T$37, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3529                            .dwattr $C$DW$T$37, DW_AT_decl_line(0xb8)
    3530                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
    3531                    $C$DW$T$41      .dwtag  DW_TAG_typedef, DW_AT_name("CORBPatterns")
    3532                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$37)
    3533                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    3534                            .dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3535                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xbe)
    3536                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x02)
    3537                    
    3538                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3539                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x400)
    3540                    $C$DW$287       .dwtag  DW_TAG_member
    3541                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$38)
    3542                            .dwattr $C$DW$287, DW_AT_name("orientation_horizontal_offsets")
    3543                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("orientation_horizontal_offsets")
    3544                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3545                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3546                            .dwattr $C$DW$287, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3547                            .dwattr $C$DW$287, DW_AT_decl_line(0xc4)
    3548                            .dwattr $C$DW$287, DW_AT_decl_column(0x0d)
    3549                    $C$DW$288       .dwtag  DW_TAG_member
    3550                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$38)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   73

    3551                            .dwattr $C$DW$288, DW_AT_name("orientation_vertical_offsets")
    3552                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("orientation_vertical_offsets")
    3553                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
    3554                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3555                            .dwattr $C$DW$288, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3556                            .dwattr $C$DW$288, DW_AT_decl_line(0xc5)
    3557                            .dwattr $C$DW$288, DW_AT_decl_column(0x0d)
    3558                    $C$DW$289       .dwtag  DW_TAG_member
    3559                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$39)
    3560                            .dwattr $C$DW$289, DW_AT_name("u_max")
    3561                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("u_max")
    3562                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c0]
    3563                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3564                            .dwattr $C$DW$289, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3565                            .dwattr $C$DW$289, DW_AT_decl_line(0xc6)
    3566                            .dwattr $C$DW$289, DW_AT_decl_column(0x0d)
    3567                            .dwendtag $C$DW$T$40
    3568                    
    3569                            .dwattr $C$DW$T$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3570                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xc3)
    3571                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3572                    $C$DW$T$42      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOrientationOffsets")
    3573                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$40)
    3574                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3575                            .dwattr $C$DW$T$42, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3576                            .dwattr $C$DW$T$42, DW_AT_decl_line(0xc7)
    3577                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x02)
    3578                    
    3579                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3580                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x5a420)
    3581                    $C$DW$290       .dwtag  DW_TAG_member
    3582                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$41)
    3583                            .dwattr $C$DW$290, DW_AT_name("patterns")
    3584                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("patterns")
    3585                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3586                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3587                            .dwattr $C$DW$290, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3588                            .dwattr $C$DW$290, DW_AT_decl_line(0xcd)
    3589                            .dwattr $C$DW$290, DW_AT_decl_column(0x1c)
    3590                    $C$DW$291       .dwtag  DW_TAG_member
    3591                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$42)
    3592                            .dwattr $C$DW$291, DW_AT_name("offsets")
    3593                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("offsets")
    3594                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a008]
    3595                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3596                            .dwattr $C$DW$291, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3597                            .dwattr $C$DW$291, DW_AT_decl_line(0xce)
    3598                            .dwattr $C$DW$291, DW_AT_decl_column(0x1c)
    3599                    $C$DW$292       .dwtag  DW_TAG_member
    3600                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$26)
    3601                            .dwattr $C$DW$292, DW_AT_name("image")
    3602                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("image")
    3603                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a408]
    3604                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3605                            .dwattr $C$DW$292, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   74

    3606                            .dwattr $C$DW$292, DW_AT_decl_line(0xcf)
    3607                            .dwattr $C$DW$292, DW_AT_decl_column(0x1c)
    3608                    $C$DW$293       .dwtag  DW_TAG_member
    3609                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$26)
    3610                            .dwattr $C$DW$293, DW_AT_name("prefimage")
    3611                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("prefimage")
    3612                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a40c]
    3613                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3614                            .dwattr $C$DW$293, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3615                            .dwattr $C$DW$293, DW_AT_decl_line(0xd0)
    3616                            .dwattr $C$DW$293, DW_AT_decl_column(0x1c)
    3617                    $C$DW$294       .dwtag  DW_TAG_member
    3618                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$43)
    3619                            .dwattr $C$DW$294, DW_AT_name("harrisImage")
    3620                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("harrisImage")
    3621                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a410]
    3622                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3623                            .dwattr $C$DW$294, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3624                            .dwattr $C$DW$294, DW_AT_decl_line(0xd1)
    3625                            .dwattr $C$DW$294, DW_AT_decl_column(0x1c)
    3626                    $C$DW$295       .dwtag  DW_TAG_member
    3627                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$44)
    3628                            .dwattr $C$DW$295, DW_AT_name("integralImage")
    3629                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("integralImage")
    3630                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a414]
    3631                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3632                            .dwattr $C$DW$295, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3633                            .dwattr $C$DW$295, DW_AT_decl_line(0xd2)
    3634                            .dwattr $C$DW$295, DW_AT_decl_column(0x1c)
    3635                    $C$DW$296       .dwtag  DW_TAG_member
    3636                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$31)
    3637                            .dwattr $C$DW$296, DW_AT_name("scratchBuffer")
    3638                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("scratchBuffer")
    3639                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a418]
    3640                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3641                            .dwattr $C$DW$296, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3642                            .dwattr $C$DW$296, DW_AT_decl_line(0xd3)
    3643                            .dwattr $C$DW$296, DW_AT_decl_column(0x1c)
    3644                    $C$DW$297       .dwtag  DW_TAG_member
    3645                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$46)
    3646                            .dwattr $C$DW$297, DW_AT_name("orbPattern31")
    3647                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("orbPattern31")
    3648                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a41c]
    3649                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3650                            .dwattr $C$DW$297, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3651                            .dwattr $C$DW$297, DW_AT_decl_line(0xd4)
    3652                            .dwattr $C$DW$297, DW_AT_decl_column(0x1c)
    3653                            .dwendtag $C$DW$T$47
    3654                    
    3655                            .dwattr $C$DW$T$47, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3656                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xcc)
    3657                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    3658                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CORBInput")
    3659                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$47)
    3660                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   75

    3661                            .dwattr $C$DW$T$85, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3662                            .dwattr $C$DW$T$85, DW_AT_decl_line(0xd5)
    3663                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x02)
    3664                    $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3665                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3666                            .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    3667                    
    3668                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3669                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x08)
    3670                    $C$DW$298       .dwtag  DW_TAG_member
    3671                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$49)
    3672                            .dwattr $C$DW$298, DW_AT_name("features")
    3673                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("features")
    3674                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3675                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3676                            .dwattr $C$DW$298, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3677                            .dwattr $C$DW$298, DW_AT_decl_line(0xed)
    3678                            .dwattr $C$DW$298, DW_AT_decl_column(0x12)
    3679                    $C$DW$299       .dwtag  DW_TAG_member
    3680                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    3681                            .dwattr $C$DW$299, DW_AT_name("n_features")
    3682                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("n_features")
    3683                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3684                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3685                            .dwattr $C$DW$299, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3686                            .dwattr $C$DW$299, DW_AT_decl_line(0xee)
    3687                            .dwattr $C$DW$299, DW_AT_decl_column(0x12)
    3688                            .dwendtag $C$DW$T$50
    3689                    
    3690                            .dwattr $C$DW$T$50, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3691                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xec)
    3692                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    3693                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOutput")
    3694                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$50)
    3695                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    3696                            .dwattr $C$DW$T$88, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3697                            .dwattr $C$DW$T$88, DW_AT_decl_line(0xef)
    3698                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x02)
    3699                    $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    3700                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    3701                            .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    3702                    
    3703                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3704                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x18)
    3705                    $C$DW$300       .dwtag  DW_TAG_member
    3706                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$10)
    3707                            .dwattr $C$DW$300, DW_AT_name("fd")
    3708                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("fd")
    3709                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3710                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3711                            .dwattr $C$DW$300, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3712                            .dwattr $C$DW$300, DW_AT_decl_line(0x49)
    3713                            .dwattr $C$DW$300, DW_AT_decl_column(0x0b)
    3714                    $C$DW$301       .dwtag  DW_TAG_member
    3715                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$51)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   76

    3716                            .dwattr $C$DW$301, DW_AT_name("buf")
    3717                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("buf")
    3718                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3719                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3720                            .dwattr $C$DW$301, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3721                            .dwattr $C$DW$301, DW_AT_decl_line(0x4a)
    3722                            .dwattr $C$DW$301, DW_AT_decl_column(0x16)
    3723                    $C$DW$302       .dwtag  DW_TAG_member
    3724                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$51)
    3725                            .dwattr $C$DW$302, DW_AT_name("pos")
    3726                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("pos")
    3727                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3728                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3729                            .dwattr $C$DW$302, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3730                            .dwattr $C$DW$302, DW_AT_decl_line(0x4b)
    3731                            .dwattr $C$DW$302, DW_AT_decl_column(0x16)
    3732                    $C$DW$303       .dwtag  DW_TAG_member
    3733                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$51)
    3734                            .dwattr $C$DW$303, DW_AT_name("bufend")
    3735                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("bufend")
    3736                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3737                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3738                            .dwattr $C$DW$303, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3739                            .dwattr $C$DW$303, DW_AT_decl_line(0x4c)
    3740                            .dwattr $C$DW$303, DW_AT_decl_column(0x16)
    3741                    $C$DW$304       .dwtag  DW_TAG_member
    3742                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$51)
    3743                            .dwattr $C$DW$304, DW_AT_name("buff_stop")
    3744                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("buff_stop")
    3745                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3746                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3747                            .dwattr $C$DW$304, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3748                            .dwattr $C$DW$304, DW_AT_decl_line(0x4d)
    3749                            .dwattr $C$DW$304, DW_AT_decl_column(0x16)
    3750                    $C$DW$305       .dwtag  DW_TAG_member
    3751                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$11)
    3752                            .dwattr $C$DW$305, DW_AT_name("flags")
    3753                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("flags")
    3754                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3755                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3756                            .dwattr $C$DW$305, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3757                            .dwattr $C$DW$305, DW_AT_decl_line(0x4e)
    3758                            .dwattr $C$DW$305, DW_AT_decl_column(0x16)
    3759                            .dwendtag $C$DW$T$52
    3760                    
    3761                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3762                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x48)
    3763                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    3764                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3765                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$52)
    3766                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    3767                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3768                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x4f)
    3769                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x03)
    3770                    
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   77

    3771                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3772                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x08)
    3773                    $C$DW$306       .dwtag  DW_TAG_member
    3774                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$10)
    3775                            .dwattr $C$DW$306, DW_AT_name("quot")
    3776                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("quot")
    3777                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3778                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3779                            .dwattr $C$DW$306, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3780                            .dwattr $C$DW$306, DW_AT_decl_line(0x3e)
    3781                            .dwattr $C$DW$306, DW_AT_decl_column(0x16)
    3782                    $C$DW$307       .dwtag  DW_TAG_member
    3783                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$10)
    3784                            .dwattr $C$DW$307, DW_AT_name("rem")
    3785                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("rem")
    3786                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3787                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3788                            .dwattr $C$DW$307, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3789                            .dwattr $C$DW$307, DW_AT_decl_line(0x3e)
    3790                            .dwattr $C$DW$307, DW_AT_decl_column(0x1c)
    3791                            .dwendtag $C$DW$T$53
    3792                    
    3793                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3794                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x3e)
    3795                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x10)
    3796                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3797                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$53)
    3798                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    3799                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3800                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x3e)
    3801                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x23)
    3802                    
    3803                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3804                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x08)
    3805                    $C$DW$308       .dwtag  DW_TAG_member
    3806                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$10)
    3807                            .dwattr $C$DW$308, DW_AT_name("quot")
    3808                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("quot")
    3809                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3810                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3811                            .dwattr $C$DW$308, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3812                            .dwattr $C$DW$308, DW_AT_decl_line(0x40)
    3813                            .dwattr $C$DW$308, DW_AT_decl_column(0x17)
    3814                    $C$DW$309       .dwtag  DW_TAG_member
    3815                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$10)
    3816                            .dwattr $C$DW$309, DW_AT_name("rem")
    3817                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("rem")
    3818                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3819                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3820                            .dwattr $C$DW$309, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3821                            .dwattr $C$DW$309, DW_AT_decl_line(0x40)
    3822                            .dwattr $C$DW$309, DW_AT_decl_column(0x1d)
    3823                            .dwendtag $C$DW$T$54
    3824                    
    3825                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   78

    3826                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x40)
    3827                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x10)
    3828                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3829                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$54)
    3830                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    3831                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3832                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x40)
    3833                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x24)
    3834                    
    3835                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3836                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
    3837                    $C$DW$310       .dwtag  DW_TAG_member
    3838                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$14)
    3839                            .dwattr $C$DW$310, DW_AT_name("quot")
    3840                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("quot")
    3841                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3842                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3843                            .dwattr $C$DW$310, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3844                            .dwattr $C$DW$310, DW_AT_decl_line(0x43)
    3845                            .dwattr $C$DW$310, DW_AT_decl_column(0x1c)
    3846                    $C$DW$311       .dwtag  DW_TAG_member
    3847                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$14)
    3848                            .dwattr $C$DW$311, DW_AT_name("rem")
    3849                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("rem")
    3850                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3851                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3852                            .dwattr $C$DW$311, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3853                            .dwattr $C$DW$311, DW_AT_decl_line(0x43)
    3854                            .dwattr $C$DW$311, DW_AT_decl_column(0x22)
    3855                            .dwendtag $C$DW$T$55
    3856                    
    3857                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3858                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x43)
    3859                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    3860                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3861                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$55)
    3862                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    3863                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3864                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x43)
    3865                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x29)
    3866                    
    3867                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    3868                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x24)
    3869                    $C$DW$312       .dwtag  DW_TAG_member
    3870                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$19)
    3871                            .dwattr $C$DW$312, DW_AT_name("area")
    3872                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("area")
    3873                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3874                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3875                            .dwattr $C$DW$312, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3876                            .dwattr $C$DW$312, DW_AT_decl_line(0x69)
    3877                            .dwattr $C$DW$312, DW_AT_decl_column(0x0d)
    3878                    $C$DW$313       .dwtag  DW_TAG_member
    3879                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$19)
    3880                            .dwattr $C$DW$313, DW_AT_name("xsum")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   79

    3881                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("xsum")
    3882                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3883                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3884                            .dwattr $C$DW$313, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3885                            .dwattr $C$DW$313, DW_AT_decl_line(0x6a)
    3886                            .dwattr $C$DW$313, DW_AT_decl_column(0x0d)
    3887                    $C$DW$314       .dwtag  DW_TAG_member
    3888                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$19)
    3889                            .dwattr $C$DW$314, DW_AT_name("ysum")
    3890                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("ysum")
    3891                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3892                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3893                            .dwattr $C$DW$314, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3894                            .dwattr $C$DW$314, DW_AT_decl_line(0x6b)
    3895                            .dwattr $C$DW$314, DW_AT_decl_column(0x0d)
    3896                    $C$DW$315       .dwtag  DW_TAG_member
    3897                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$19)
    3898                            .dwattr $C$DW$315, DW_AT_name("xmin")
    3899                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("xmin")
    3900                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3901                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3902                            .dwattr $C$DW$315, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3903                            .dwattr $C$DW$315, DW_AT_decl_line(0x6d)
    3904                            .dwattr $C$DW$315, DW_AT_decl_column(0x0d)
    3905                    $C$DW$316       .dwtag  DW_TAG_member
    3906                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$19)
    3907                            .dwattr $C$DW$316, DW_AT_name("ymin")
    3908                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("ymin")
    3909                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3910                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3911                            .dwattr $C$DW$316, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3912                            .dwattr $C$DW$316, DW_AT_decl_line(0x6e)
    3913                            .dwattr $C$DW$316, DW_AT_decl_column(0x0d)
    3914                    $C$DW$317       .dwtag  DW_TAG_member
    3915                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$19)
    3916                            .dwattr $C$DW$317, DW_AT_name("xmax")
    3917                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("xmax")
    3918                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3919                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3920                            .dwattr $C$DW$317, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3921                            .dwattr $C$DW$317, DW_AT_decl_line(0x6f)
    3922                            .dwattr $C$DW$317, DW_AT_decl_column(0x0d)
    3923                    $C$DW$318       .dwtag  DW_TAG_member
    3924                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$19)
    3925                            .dwattr $C$DW$318, DW_AT_name("ymax")
    3926                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("ymax")
    3927                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3928                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3929                            .dwattr $C$DW$318, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3930                            .dwattr $C$DW$318, DW_AT_decl_line(0x70)
    3931                            .dwattr $C$DW$318, DW_AT_decl_column(0x0d)
    3932                    $C$DW$319       .dwtag  DW_TAG_member
    3933                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$19)
    3934                            .dwattr $C$DW$319, DW_AT_name("seedx")
    3935                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("seedx")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   80

    3936                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3937                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3938                            .dwattr $C$DW$319, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3939                            .dwattr $C$DW$319, DW_AT_decl_line(0x72)
    3940                            .dwattr $C$DW$319, DW_AT_decl_column(0x0d)
    3941                    $C$DW$320       .dwtag  DW_TAG_member
    3942                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$19)
    3943                            .dwattr $C$DW$320, DW_AT_name("seedy")
    3944                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("seedy")
    3945                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3946                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3947                            .dwattr $C$DW$320, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    3948                            .dwattr $C$DW$320, DW_AT_decl_line(0x73)
    3949                            .dwattr $C$DW$320, DW_AT_decl_column(0x0d)
    3950                            .dwendtag $C$DW$T$56
    3951                    
    3952                            .dwattr $C$DW$T$56, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3953                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x68)
    3954                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    3955                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    3956                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$56)
    3957                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    3958                            .dwattr $C$DW$T$95, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    3959                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x75)
    3960                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    3961                    
    3962                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3963                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    3964                    $C$DW$321       .dwtag  DW_TAG_member
    3965                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$8)
    3966                            .dwattr $C$DW$321, DW_AT_name("daylight")
    3967                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("daylight")
    3968                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3969                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3970                            .dwattr $C$DW$321, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3971                            .dwattr $C$DW$321, DW_AT_decl_line(0x52)
    3972                            .dwattr $C$DW$321, DW_AT_decl_column(0x0b)
    3973                    $C$DW$322       .dwtag  DW_TAG_member
    3974                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$10)
    3975                            .dwattr $C$DW$322, DW_AT_name("timezone")
    3976                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("timezone")
    3977                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3978                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3979                            .dwattr $C$DW$322, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3980                            .dwattr $C$DW$322, DW_AT_decl_line(0x53)
    3981                            .dwattr $C$DW$322, DW_AT_decl_column(0x0b)
    3982                    $C$DW$323       .dwtag  DW_TAG_member
    3983                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$57)
    3984                            .dwattr $C$DW$323, DW_AT_name("tzname")
    3985                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("tzname")
    3986                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3987                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3988                            .dwattr $C$DW$323, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3989                            .dwattr $C$DW$323, DW_AT_decl_line(0x54)
    3990                            .dwattr $C$DW$323, DW_AT_decl_column(0x0b)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   81

    3991                    $C$DW$324       .dwtag  DW_TAG_member
    3992                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$57)
    3993                            .dwattr $C$DW$324, DW_AT_name("dstname")
    3994                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("dstname")
    3995                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3996                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    3997                            .dwattr $C$DW$324, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3998                            .dwattr $C$DW$324, DW_AT_decl_line(0x55)
    3999                            .dwattr $C$DW$324, DW_AT_decl_column(0x0b)
    4000                            .dwendtag $C$DW$T$58
    4001                    
    4002                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4003                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x51)
    4004                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    4005                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    4006                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$58)
    4007                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    4008                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4009                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x56)
    4010                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x03)
    4011                    
    4012                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4013                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x20)
    4014                    $C$DW$325       .dwtag  DW_TAG_member
    4015                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$60)
    4016                            .dwattr $C$DW$325, DW_AT_name("val")
    4017                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("val")
    4018                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4019                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4020                            .dwattr $C$DW$325, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorner
    4021                            .dwattr $C$DW$325, DW_AT_decl_line(0x25)
    4022                            .dwattr $C$DW$325, DW_AT_decl_column(0x0c)
    4023                            .dwendtag $C$DW$T$61
    4024                    
    4025                            .dwattr $C$DW$T$61, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    4026                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x24)
    4027                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x10)
    4028                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("RotationMatrix")
    4029                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$61)
    4030                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    4031                            .dwattr $C$DW$T$97, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    4032                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x26)
    4033                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x02)
    4034                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4035                            .dwattr $C$DW$T$2, DW_AT_name("void")
    4036                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4037                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4038                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    4039                    $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    4040                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$3)
    4041                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    4042                            .dwattr $C$DW$T$98, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorne
    4043                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x5c)
    4044                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x19)
    4045                    $C$DW$T$4       .dwtag  DW_TAG_base_type
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   82

    4046                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4047                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    4048                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4049                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    4050                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4051                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4052                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4053                    $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    4054                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$5)
    4055                            .dwattr $C$DW$T$131, DW_AT_address_class(0x20)
    4056                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    4057                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$5)
    4058                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    4059                            .dwattr $C$DW$T$45, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4060                            .dwattr $C$DW$T$45, DW_AT_decl_line(0x2a)
    4061                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x1d)
    4062                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4063                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    4064                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4065                    $C$DW$T$143     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    4066                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$45)
    4067                            .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
    4068                            .dwattr $C$DW$T$143, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4069                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x39)
    4070                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x17)
    4071                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    4072                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4073                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4074                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4075                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    4076                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$6)
    4077                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    4078                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    4079                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    4080                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4081                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4082                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x2b)
    4083                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x1c)
    4084                    
    4085                    $C$DW$T$24      .dwtag  DW_TAG_array_type
    4086                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$20)
    4087                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    4088                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x20)
    4089                    $C$DW$326       .dwtag  DW_TAG_subrange_type
    4090                            .dwattr $C$DW$326, DW_AT_upper_bound(0x1f)
    4091                            .dwendtag $C$DW$T$24
    4092                    
    4093                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    4094                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$20)
    4095                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    4096                    $C$DW$T$119     .dwtag  DW_TAG_const_type
    4097                            .dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$20)
    4098                    $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    4099                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$119)
    4100                            .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   83

    4101                    $C$DW$T$121     .dwtag  DW_TAG_restrict_type
    4102                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$120)
    4103                    $C$DW$T$145     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    4104                            .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$20)
    4105                            .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    4106                            .dwattr $C$DW$T$145, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4107                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x3a)
    4108                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x16)
    4109                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    4110                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4111                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4112                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4113                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    4114                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4115                            .dwattr $C$DW$T$8, DW_AT_name("short")
    4116                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    4117                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    4118                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$8)
    4119                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    4120                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4121                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x2c)
    4122                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x1d)
    4123                    $C$DW$T$43      .dwtag  DW_TAG_pointer_type
    4124                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$23)
    4125                            .dwattr $C$DW$T$43, DW_AT_address_class(0x20)
    4126                    $C$DW$T$146     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    4127                            .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$23)
    4128                            .dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
    4129                            .dwattr $C$DW$T$146, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4130                            .dwattr $C$DW$T$146, DW_AT_decl_line(0x3c)
    4131                            .dwattr $C$DW$T$146, DW_AT_decl_column(0x17)
    4132                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    4133                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4134                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4135                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4136                    $C$DW$T$147     .dwtag  DW_TAG_pointer_type
    4137                            .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$9)
    4138                            .dwattr $C$DW$T$147, DW_AT_address_class(0x20)
    4139                    $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    4140                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
    4141                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4142                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4143                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2d)
    4144                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x1c)
    4145                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    4146                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4147                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    4148                    $C$DW$T$149     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    4149                            .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$27)
    4150                            .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    4151                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4152                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x3d)
    4153                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x16)
    4154                    $C$DW$T$148     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    4155                            .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$9)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   84

    4156                            .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    4157                            .dwattr $C$DW$T$148, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4158                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x53)
    4159                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x1a)
    4160                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    4161                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4162                            .dwattr $C$DW$T$10, DW_AT_name("int")
    4163                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    4164                    $C$DW$T$125     .dwtag  DW_TAG_pointer_type
    4165                            .dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$10)
    4166                            .dwattr $C$DW$T$125, DW_AT_address_class(0x20)
    4167                    $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    4168                            .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$10)
    4169                            .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    4170                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4171                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x53)
    4172                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x0d)
    4173                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    4174                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$10)
    4175                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4176                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4177                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2e)
    4178                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1d)
    4179                    $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    4180                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$19)
    4181                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    4182                            .dwattr $C$DW$T$159, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast12_detectCorn
    4183                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x77)
    4184                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x11)
    4185                    
    4186                    $C$DW$T$33      .dwtag  DW_TAG_array_type
    4187                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$19)
    4188                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    4189                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x2000)
    4190                    $C$DW$327       .dwtag  DW_TAG_subrange_type
    4191                            .dwattr $C$DW$327, DW_AT_upper_bound(0x7ff)
    4192                            .dwendtag $C$DW$T$33
    4193                    
    4194                    
    4195                    $C$DW$T$34      .dwtag  DW_TAG_array_type
    4196                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$19)
    4197                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    4198                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x3c000)
    4199                    $C$DW$328       .dwtag  DW_TAG_subrange_type
    4200                            .dwattr $C$DW$328, DW_AT_upper_bound(0x1d)
    4201                    $C$DW$329       .dwtag  DW_TAG_subrange_type
    4202                            .dwattr $C$DW$329, DW_AT_upper_bound(0x7ff)
    4203                            .dwendtag $C$DW$T$34
    4204                    
    4205                    
    4206                    $C$DW$T$35      .dwtag  DW_TAG_array_type
    4207                            .dwattr $C$DW$T$35, DW_AT_type(*$C$DW$T$19)
    4208                            .dwattr $C$DW$T$35, DW_AT_language(DW_LANG_C)
    4209                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x1000)
    4210                    $C$DW$330       .dwtag  DW_TAG_subrange_type
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   85

    4211                            .dwattr $C$DW$330, DW_AT_upper_bound(0x3ff)
    4212                            .dwendtag $C$DW$T$35
    4213                    
    4214                    
    4215                    $C$DW$T$36      .dwtag  DW_TAG_array_type
    4216                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$19)
    4217                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4218                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x1e000)
    4219                    $C$DW$331       .dwtag  DW_TAG_subrange_type
    4220                            .dwattr $C$DW$331, DW_AT_upper_bound(0x1d)
    4221                    $C$DW$332       .dwtag  DW_TAG_subrange_type
    4222                            .dwattr $C$DW$332, DW_AT_upper_bound(0x3ff)
    4223                            .dwendtag $C$DW$T$36
    4224                    
    4225                    
    4226                    $C$DW$T$38      .dwtag  DW_TAG_array_type
    4227                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$19)
    4228                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4229                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x1e0)
    4230                    $C$DW$333       .dwtag  DW_TAG_subrange_type
    4231                            .dwattr $C$DW$333, DW_AT_upper_bound(0x77)
    4232                            .dwendtag $C$DW$T$38
    4233                    
    4234                    
    4235                    $C$DW$T$39      .dwtag  DW_TAG_array_type
    4236                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$19)
    4237                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4238                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x40)
    4239                    $C$DW$334       .dwtag  DW_TAG_subrange_type
    4240                            .dwattr $C$DW$334, DW_AT_upper_bound(0x0f)
    4241                            .dwendtag $C$DW$T$39
    4242                    
    4243                    
    4244                    $C$DW$T$62      .dwtag  DW_TAG_array_type
    4245                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$19)
    4246                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    4247                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x10)
    4248                    $C$DW$335       .dwtag  DW_TAG_subrange_type
    4249                            .dwattr $C$DW$335, DW_AT_upper_bound(0x03)
    4250                            .dwendtag $C$DW$T$62
    4251                    
    4252                    $C$DW$T$122     .dwtag  DW_TAG_pointer_type
    4253                            .dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$19)
    4254                            .dwattr $C$DW$T$122, DW_AT_address_class(0x20)
    4255                    $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    4256                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$19)
    4257                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    4258                            .dwattr $C$DW$T$160, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4259                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x4b)
    4260                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x17)
    4261                    $C$DW$T$161     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    4262                            .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$19)
    4263                            .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
    4264                            .dwattr $C$DW$T$161, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4265                            .dwattr $C$DW$T$161, DW_AT_decl_line(0x4e)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:08 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast12_detectCorners/VLIB_originalfast12_detectCorners_d.se66 PAGE   86

    4266                            .dwattr $C$DW$T$161, DW_AT_decl_column(0x17)
    4267                    $C$DW$T$162     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    4268                            .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$19)
    4269                            .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
