;******************************************************************************
;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
;* Date/Time created: Thu Mar 19 12:38:38 2015                                *
;******************************************************************************
	.compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_precision_bits=32 --mem_model:code=near --mem_model:const=data --mem_model:data=far --object_format=elf --silicon_version=6600 --symdebug:dwarf --symdebug:dwarf_version=3 

;******************************************************************************
;* GLOBAL FILE PARAMETERS                                                     *
;*                                                                            *
;*   Architecture      : TMS320C66xx                                          *
;*   Optimization      : Enabled at level 3                                   *
;*   Optimizing for    : Speed                                                *
;*                       Based on options: -o3, no -ms                        *
;*   Endian            : Little                                               *
;*   Interrupt Thrshld : 10000                                                *
;*   Data Access Model : Far                                                  *
;*   Pipelining        : Enabled                                              *

	.dwattr $C$DW$506, DW_AT_decl_column(0x05)
$C$DW$507	.dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERR_MEMORY_POINTER_NULL"), DW_AT_const_value(0x06)
	.dwattr $C$DW$507, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$507, DW_AT_decl_line(0x80)
	.dwattr $C$DW$507, DW_AT_decl_column(0x05)
$C$DW$508	.dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERR_DMA_FAILURE"), DW_AT_const_value(0x07)
	.dwattr $C$DW$508, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$508, DW_AT_decl_line(0x81)
	.dwattr $C$DW$508, DW_AT_decl_column(0x05)
$C$DW$509	.dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERR_FILE_OPEN_FAILURE"), DW_AT_const_value(0x08)
	.dwattr $C$DW$509, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$509, DW_AT_decl_line(0x82)
	.dwattr $C$DW$509, DW_AT_decl_column(0x05)
$C$DW$510	.dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERR_FILE_READ_FAILURE"), DW_AT_const_value(0x09)
	.dwattr $C$DW$510, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$510, DW_AT_decl_line(0x83)
	.dwattr $C$DW$510, DW_AT_decl_column(0x05)
$C$DW$511	.dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERR_FILE_WRITE_FAILURE"), DW_AT_const_value(0x0a)
	.dwattr $C$DW$511, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$511, DW_AT_decl_line(0x84)
	.dwattr $C$DW$511, DW_AT_decl_column(0x05)
$C$DW$512	.dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERR_FILE_CLOSE_FAILURE"), DW_AT_const_value(0x0b)
	.dwattr $C$DW$512, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$512, DW_AT_decl_line(0x85)
	.dwattr $C$DW$512, DW_AT_decl_column(0x05)
$C$DW$513	.dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERR_FILE_FORMAT_FAILURE"), DW_AT_const_value(0x0c)
	.dwattr $C$DW$513, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$513, DW_AT_decl_line(0x86)
	.dwattr $C$DW$513, DW_AT_decl_column(0x05)
$C$DW$514	.dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_WARNING_LOW_MEMORY"), DW_AT_const_value(0x0d)
	.dwattr $C$DW$514, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$514, DW_AT_decl_line(0x87)
	.dwattr $C$DW$514, DW_AT_decl_column(0x05)
$C$DW$515	.dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERR_NOT_IMPLEMENTED"), DW_AT_const_value(0x0e)
	.dwattr $C$DW$515, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$515, DW_AT_decl_line(0x88)
	.dwattr $C$DW$515, DW_AT_decl_column(0x05)
$C$DW$516	.dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERROR_MAX"), DW_AT_const_value(0x0f)
	.dwattr $C$DW$516, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$516, DW_AT_decl_line(0x89)
	.dwattr $C$DW$516, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$77

	.dwattr $C$DW$T$77, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$T$77, DW_AT_decl_line(0x79)
	.dwattr $C$DW$T$77, DW_AT_decl_column(0x0e)
$C$DW$T$78	.dwtag  DW_TAG_typedef, DW_AT_name("VLIB_STATUS")
	.dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$77)
	.dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$78, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$T$78, DW_AT_decl_line(0x8a)
	.dwattr $C$DW$T$78, DW_AT_decl_column(0x03)

$C$DW$T$103	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$103, DW_AT_byte_size(0x04)
$C$DW$517	.dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_OPT"), DW_AT_const_value(0x00)
	.dwattr $C$DW$517, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\../common/VLIB_test.h")
	.dwattr $C$DW$517, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$517, DW_AT_decl_column(0x05)
$C$DW$518	.dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CN"), DW_AT_const_value(0x01)
	.dwattr $C$DW$518, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\../common/VLIB_test.h")
	.dwattr $C$DW$518, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$518, DW_AT_decl_column(0x05)
$C$DW$519	.dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CNT"), DW_AT_const_value(0x02)
	.dwattr $C$DW$519, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\../common/VLIB_test.h")
	.dwattr $C$DW$519, DW_AT_decl_line(0x6c)
	.dwattr $C$DW$519, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$103

	.dwattr $C$DW$T$103, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\../common/VLIB_test.h")
	.dwattr $C$DW$T$103, DW_AT_decl_line(0x69)
	.dwattr $C$DW$T$103, DW_AT_decl_column(0x06)

$C$DW$T$104	.dwtag  DW_TAG_enumeration_type
	.dwattr $C$DW$T$104, DW_AT_byte_size(0x04)
$C$DW$520	.dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
	.dwattr $C$DW$520, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\../common/VLIB_test.h")
	.dwattr $C$DW$520, DW_AT_decl_line(0x72)
	.dwattr $C$DW$520, DW_AT_decl_column(0x05)
$C$DW$521	.dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
	.dwattr $C$DW$521, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\../common/VLIB_test.h")
	.dwattr $C$DW$521, DW_AT_decl_line(0x73)
	.dwattr $C$DW$521, DW_AT_decl_column(0x05)
	.dwendtag $C$DW$T$104

	.dwattr $C$DW$T$104, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\../common/VLIB_test.h")
	.dwattr $C$DW$T$104, DW_AT_decl_line(0x71)
	.dwattr $C$DW$T$104, DW_AT_decl_column(0x06)

$C$DW$T$48	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$48, DW_AT_byte_size(0x3c)
$C$DW$522	.dwtag  DW_TAG_member
	.dwattr $C$DW$522, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$522, DW_AT_name("ccMapColor")
	.dwattr $C$DW$522, DW_AT_TI_symbol_name("ccMapColor")
	.dwattr $C$DW$522, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$522, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$522, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$522, DW_AT_decl_line(0x24)
	.dwattr $C$DW$522, DW_AT_decl_column(0x0e)
$C$DW$523	.dwtag  DW_TAG_member
	.dwattr $C$DW$523, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$523, DW_AT_name("area")
	.dwattr $C$DW$523, DW_AT_TI_symbol_name("area")
	.dwattr $C$DW$523, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$523, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$523, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$523, DW_AT_decl_line(0x25)
	.dwattr $C$DW$523, DW_AT_decl_column(0x0e)
$C$DW$524	.dwtag  DW_TAG_member
	.dwattr $C$DW$524, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$524, DW_AT_name("perimeter")
	.dwattr $C$DW$524, DW_AT_TI_symbol_name("perimeter")
	.dwattr $C$DW$524, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$524, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$524, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$524, DW_AT_decl_line(0x26)
	.dwattr $C$DW$524, DW_AT_decl_column(0x0e)
$C$DW$525	.dwtag  DW_TAG_member
	.dwattr $C$DW$525, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$525, DW_AT_name("xmin")
	.dwattr $C$DW$525, DW_AT_TI_symbol_name("xmin")
	.dwattr $C$DW$525, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$525, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$525, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$525, DW_AT_decl_line(0x27)
	.dwattr $C$DW$525, DW_AT_decl_column(0x0e)
$C$DW$526	.dwtag  DW_TAG_member
	.dwattr $C$DW$526, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$526, DW_AT_name("ymin")
	.dwattr $C$DW$526, DW_AT_TI_symbol_name("ymin")
	.dwattr $C$DW$526, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$526, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$526, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$526, DW_AT_decl_line(0x28)
	.dwattr $C$DW$526, DW_AT_decl_column(0x0e)
$C$DW$527	.dwtag  DW_TAG_member
	.dwattr $C$DW$527, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$527, DW_AT_name("xmax")
	.dwattr $C$DW$527, DW_AT_TI_symbol_name("xmax")
	.dwattr $C$DW$527, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$527, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$527, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$527, DW_AT_decl_line(0x29)
	.dwattr $C$DW$527, DW_AT_decl_column(0x0e)
$C$DW$528	.dwtag  DW_TAG_member
	.dwattr $C$DW$528, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$528, DW_AT_name("ymax")
	.dwattr $C$DW$528, DW_AT_TI_symbol_name("ymax")
	.dwattr $C$DW$528, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$528, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$528, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$528, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$528, DW_AT_decl_column(0x0e)
$C$DW$529	.dwtag  DW_TAG_member
	.dwattr $C$DW$529, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$529, DW_AT_name("rect_center_x")
	.dwattr $C$DW$529, DW_AT_TI_symbol_name("rect_center_x")
	.dwattr $C$DW$529, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$529, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$529, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$529, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$529, DW_AT_decl_column(0x0e)
$C$DW$530	.dwtag  DW_TAG_member
	.dwattr $C$DW$530, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$530, DW_AT_name("rect_center_y")
	.dwattr $C$DW$530, DW_AT_TI_symbol_name("rect_center_y")
	.dwattr $C$DW$530, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$530, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$530, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$530, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$530, DW_AT_decl_column(0x0e)
$C$DW$531	.dwtag  DW_TAG_member
	.dwattr $C$DW$531, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$531, DW_AT_name("rect_sita")
	.dwattr $C$DW$531, DW_AT_TI_symbol_name("rect_sita")
	.dwattr $C$DW$531, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
	.dwattr $C$DW$531, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$531, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$531, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$531, DW_AT_decl_column(0x0e)
$C$DW$532	.dwtag  DW_TAG_member
	.dwattr $C$DW$532, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$532, DW_AT_name("rect_width")
	.dwattr $C$DW$532, DW_AT_TI_symbol_name("rect_width")
	.dwattr $C$DW$532, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
	.dwattr $C$DW$532, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$532, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$532, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$532, DW_AT_decl_column(0x0e)
$C$DW$533	.dwtag  DW_TAG_member
	.dwattr $C$DW$533, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$533, DW_AT_name("rect_height")
	.dwattr $C$DW$533, DW_AT_TI_symbol_name("rect_height")
	.dwattr $C$DW$533, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
	.dwattr $C$DW$533, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$533, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$533, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$533, DW_AT_decl_column(0x0e)
$C$DW$534	.dwtag  DW_TAG_member
	.dwattr $C$DW$534, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$534, DW_AT_name("circle_x")
	.dwattr $C$DW$534, DW_AT_TI_symbol_name("circle_x")
	.dwattr $C$DW$534, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
	.dwattr $C$DW$534, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$534, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$534, DW_AT_decl_line(0x30)
	.dwattr $C$DW$534, DW_AT_decl_column(0x0e)
$C$DW$535	.dwtag  DW_TAG_member
	.dwattr $C$DW$535, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$535, DW_AT_name("circle_y")
	.dwattr $C$DW$535, DW_AT_TI_symbol_name("circle_y")
	.dwattr $C$DW$535, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
	.dwattr $C$DW$535, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$535, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$535, DW_AT_decl_line(0x31)
	.dwattr $C$DW$535, DW_AT_decl_column(0x0e)
$C$DW$536	.dwtag  DW_TAG_member
	.dwattr $C$DW$536, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$536, DW_AT_name("circle_r")
	.dwattr $C$DW$536, DW_AT_TI_symbol_name("circle_r")
	.dwattr $C$DW$536, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
	.dwattr $C$DW$536, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$536, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$536, DW_AT_decl_line(0x32)
	.dwattr $C$DW$536, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$48

	.dwattr $C$DW$T$48, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$T$48, DW_AT_decl_line(0x23)
	.dwattr $C$DW$T$48, DW_AT_decl_column(0x10)
$C$DW$T$105	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$105, DW_AT_address_class(0x20)
$C$DW$T$51	.dwtag  DW_TAG_typedef, DW_AT_name("blobAnalysis_resultParams_t")
	.dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$48)
	.dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$51, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$T$51, DW_AT_decl_line(0x33)
	.dwattr $C$DW$T$51, DW_AT_decl_column(0x03)
$C$DW$T$52	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
	.dwattr $C$DW$T$52, DW_AT_address_class(0x20)

$C$DW$T$53	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$53, DW_AT_byte_size(0x18)
$C$DW$537	.dwtag  DW_TAG_member
	.dwattr $C$DW$537, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$537, DW_AT_name("testPattern")
	.dwattr $C$DW$537, DW_AT_TI_symbol_name("testPattern")
	.dwattr $C$DW$537, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$537, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$537, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$537, DW_AT_decl_line(0x36)
	.dwattr $C$DW$537, DW_AT_decl_column(0x22)
$C$DW$538	.dwtag  DW_TAG_member
	.dwattr $C$DW$538, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$538, DW_AT_name("imageWidth")
	.dwattr $C$DW$538, DW_AT_TI_symbol_name("imageWidth")
	.dwattr $C$DW$538, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$538, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$538, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$538, DW_AT_decl_line(0x37)
	.dwattr $C$DW$538, DW_AT_decl_column(0x22)
$C$DW$539	.dwtag  DW_TAG_member
	.dwattr $C$DW$539, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$539, DW_AT_name("imageHeight")
	.dwattr $C$DW$539, DW_AT_TI_symbol_name("imageHeight")
	.dwattr $C$DW$539, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$539, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$539, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$539, DW_AT_decl_line(0x38)
	.dwattr $C$DW$539, DW_AT_decl_column(0x22)
$C$DW$540	.dwtag  DW_TAG_member
	.dwattr $C$DW$540, DW_AT_type(*$C$DW$T$50)
	.dwattr $C$DW$540, DW_AT_name("staticIn")
	.dwattr $C$DW$540, DW_AT_TI_symbol_name("staticIn")
	.dwattr $C$DW$540, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$540, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$540, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$540, DW_AT_decl_line(0x39)
	.dwattr $C$DW$540, DW_AT_decl_column(0x22)
$C$DW$541	.dwtag  DW_TAG_member
	.dwattr $C$DW$541, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$541, DW_AT_name("numBlobs")
	.dwattr $C$DW$541, DW_AT_TI_symbol_name("numBlobs")
	.dwattr $C$DW$541, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$541, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$541, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$541, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$541, DW_AT_decl_column(0x22)
$C$DW$542	.dwtag  DW_TAG_member
	.dwattr $C$DW$542, DW_AT_type(*$C$DW$T$52)
	.dwattr $C$DW$542, DW_AT_name("staticOut")
	.dwattr $C$DW$542, DW_AT_TI_symbol_name("staticOut")
	.dwattr $C$DW$542, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$542, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$542, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$542, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$542, DW_AT_decl_column(0x22)
	.dwendtag $C$DW$T$53

	.dwattr $C$DW$T$53, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$T$53, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$53, DW_AT_decl_column(0x10)
$C$DW$T$106	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$106, DW_AT_address_class(0x20)
$C$DW$T$108	.dwtag  DW_TAG_typedef, DW_AT_name("blobAnalysis_testParams_t")
	.dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$53)
	.dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$108, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\VLIB_blobAnalysis_idat.h")
	.dwattr $C$DW$T$108, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$108, DW_AT_decl_column(0x03)
$C$DW$T$109	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
	.dwattr $C$DW$T$109, DW_AT_address_class(0x20)
$C$DW$T$110	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$109)
	.dwattr $C$DW$T$110, DW_AT_address_class(0x20)

$C$DW$T$55	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$55, DW_AT_byte_size(0x18)
$C$DW$543	.dwtag  DW_TAG_member
	.dwattr $C$DW$543, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$543, DW_AT_name("fd")
	.dwattr $C$DW$543, DW_AT_TI_symbol_name("fd")
	.dwattr $C$DW$543, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$543, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$543, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdio.h")
	.dwattr $C$DW$543, DW_AT_decl_line(0x49)
	.dwattr $C$DW$543, DW_AT_decl_column(0x0b)
$C$DW$544	.dwtag  DW_TAG_member
	.dwattr $C$DW$544, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$544, DW_AT_name("buf")
	.dwattr $C$DW$544, DW_AT_TI_symbol_name("buf")
	.dwattr $C$DW$544, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$544, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$544, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdio.h")
	.dwattr $C$DW$544, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$544, DW_AT_decl_column(0x16)
$C$DW$545	.dwtag  DW_TAG_member
	.dwattr $C$DW$545, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$545, DW_AT_name("pos")
	.dwattr $C$DW$545, DW_AT_TI_symbol_name("pos")
	.dwattr $C$DW$545, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$545, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$545, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdio.h")
	.dwattr $C$DW$545, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$545, DW_AT_decl_column(0x16)
$C$DW$546	.dwtag  DW_TAG_member
	.dwattr $C$DW$546, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$546, DW_AT_name("bufend")
	.dwattr $C$DW$546, DW_AT_TI_symbol_name("bufend")
	.dwattr $C$DW$546, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$546, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$546, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdio.h")
	.dwattr $C$DW$546, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$546, DW_AT_decl_column(0x16)
$C$DW$547	.dwtag  DW_TAG_member
	.dwattr $C$DW$547, DW_AT_type(*$C$DW$T$54)
	.dwattr $C$DW$547, DW_AT_name("buff_stop")
	.dwattr $C$DW$547, DW_AT_TI_symbol_name("buff_stop")
	.dwattr $C$DW$547, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$547, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$547, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdio.h")
	.dwattr $C$DW$547, DW_AT_decl_line(0x4d)
	.dwattr $C$DW$547, DW_AT_decl_column(0x16)
$C$DW$548	.dwtag  DW_TAG_member
	.dwattr $C$DW$548, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$548, DW_AT_name("flags")
	.dwattr $C$DW$548, DW_AT_TI_symbol_name("flags")
	.dwattr $C$DW$548, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$548, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$548, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdio.h")
	.dwattr $C$DW$548, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$548, DW_AT_decl_column(0x16)
	.dwendtag $C$DW$T$55

	.dwattr $C$DW$T$55, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdio.h")
	.dwattr $C$DW$T$55, DW_AT_decl_line(0x48)
	.dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
$C$DW$T$111	.dwtag  DW_TAG_typedef, DW_AT_name("FILE")
	.dwattr $C$DW$T$111, DW_AT_type(*$C$DW$T$55)
	.dwattr $C$DW$T$111, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$111, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdio.h")
	.dwattr $C$DW$T$111, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$111, DW_AT_decl_column(0x03)

$C$DW$T$56	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$56, DW_AT_byte_size(0x08)
$C$DW$549	.dwtag  DW_TAG_member
	.dwattr $C$DW$549, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$549, DW_AT_name("quot")
	.dwattr $C$DW$549, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$549, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$549, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$549, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$549, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$549, DW_AT_decl_column(0x16)
$C$DW$550	.dwtag  DW_TAG_member
	.dwattr $C$DW$550, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$550, DW_AT_name("rem")
	.dwattr $C$DW$550, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$550, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$550, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$550, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$550, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$550, DW_AT_decl_column(0x1c)
	.dwendtag $C$DW$T$56

	.dwattr $C$DW$T$56, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$T$56, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
$C$DW$T$112	.dwtag  DW_TAG_typedef, DW_AT_name("div_t")
	.dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$56)
	.dwattr $C$DW$T$112, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$112, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$T$112, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$112, DW_AT_decl_column(0x23)

$C$DW$T$57	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$57, DW_AT_byte_size(0x08)
$C$DW$551	.dwtag  DW_TAG_member
	.dwattr $C$DW$551, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$551, DW_AT_name("quot")
	.dwattr $C$DW$551, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$551, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$551, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$551, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$551, DW_AT_decl_line(0x40)
	.dwattr $C$DW$551, DW_AT_decl_column(0x17)
$C$DW$552	.dwtag  DW_TAG_member
	.dwattr $C$DW$552, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$552, DW_AT_name("rem")
	.dwattr $C$DW$552, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$552, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$552, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$552, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$552, DW_AT_decl_line(0x40)
	.dwattr $C$DW$552, DW_AT_decl_column(0x1d)
	.dwendtag $C$DW$T$57

	.dwattr $C$DW$T$57, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$T$57, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
$C$DW$T$113	.dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
	.dwattr $C$DW$T$113, DW_AT_type(*$C$DW$T$57)
	.dwattr $C$DW$T$113, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$113, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$T$113, DW_AT_decl_line(0x40)
	.dwattr $C$DW$T$113, DW_AT_decl_column(0x24)

$C$DW$T$58	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
$C$DW$553	.dwtag  DW_TAG_member
	.dwattr $C$DW$553, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$553, DW_AT_name("quot")
	.dwattr $C$DW$553, DW_AT_TI_symbol_name("quot")
	.dwattr $C$DW$553, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$553, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$553, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$553, DW_AT_decl_line(0x43)
	.dwattr $C$DW$553, DW_AT_decl_column(0x1c)
$C$DW$554	.dwtag  DW_TAG_member
	.dwattr $C$DW$554, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$554, DW_AT_name("rem")
	.dwattr $C$DW$554, DW_AT_TI_symbol_name("rem")
	.dwattr $C$DW$554, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$554, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$554, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$554, DW_AT_decl_line(0x43)
	.dwattr $C$DW$554, DW_AT_decl_column(0x22)
	.dwendtag $C$DW$T$58

	.dwattr $C$DW$T$58, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$T$58, DW_AT_decl_line(0x43)
	.dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
$C$DW$T$114	.dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
	.dwattr $C$DW$T$114, DW_AT_type(*$C$DW$T$58)
	.dwattr $C$DW$T$114, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$114, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$T$114, DW_AT_decl_line(0x43)
	.dwattr $C$DW$T$114, DW_AT_decl_column(0x29)

$C$DW$T$59	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$59, DW_AT_byte_size(0x24)
$C$DW$555	.dwtag  DW_TAG_member
	.dwattr $C$DW$555, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$555, DW_AT_name("area")
	.dwattr $C$DW$555, DW_AT_TI_symbol_name("area")
	.dwattr $C$DW$555, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$555, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$555, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$555, DW_AT_decl_line(0x69)
	.dwattr $C$DW$555, DW_AT_decl_column(0x0d)
$C$DW$556	.dwtag  DW_TAG_member
	.dwattr $C$DW$556, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$556, DW_AT_name("xsum")
	.dwattr $C$DW$556, DW_AT_TI_symbol_name("xsum")
	.dwattr $C$DW$556, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$556, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$556, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$556, DW_AT_decl_line(0x6a)
	.dwattr $C$DW$556, DW_AT_decl_column(0x0d)
$C$DW$557	.dwtag  DW_TAG_member
	.dwattr $C$DW$557, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$557, DW_AT_name("ysum")
	.dwattr $C$DW$557, DW_AT_TI_symbol_name("ysum")
	.dwattr $C$DW$557, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$557, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$557, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$557, DW_AT_decl_line(0x6b)
	.dwattr $C$DW$557, DW_AT_decl_column(0x0d)
$C$DW$558	.dwtag  DW_TAG_member
	.dwattr $C$DW$558, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$558, DW_AT_name("xmin")
	.dwattr $C$DW$558, DW_AT_TI_symbol_name("xmin")
	.dwattr $C$DW$558, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$558, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$558, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$558, DW_AT_decl_line(0x6d)
	.dwattr $C$DW$558, DW_AT_decl_column(0x0d)
$C$DW$559	.dwtag  DW_TAG_member
	.dwattr $C$DW$559, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$559, DW_AT_name("ymin")
	.dwattr $C$DW$559, DW_AT_TI_symbol_name("ymin")
	.dwattr $C$DW$559, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$559, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$559, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$559, DW_AT_decl_line(0x6e)
	.dwattr $C$DW$559, DW_AT_decl_column(0x0d)
$C$DW$560	.dwtag  DW_TAG_member
	.dwattr $C$DW$560, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$560, DW_AT_name("xmax")
	.dwattr $C$DW$560, DW_AT_TI_symbol_name("xmax")
	.dwattr $C$DW$560, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$560, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$560, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$560, DW_AT_decl_line(0x6f)
	.dwattr $C$DW$560, DW_AT_decl_column(0x0d)
$C$DW$561	.dwtag  DW_TAG_member
	.dwattr $C$DW$561, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$561, DW_AT_name("ymax")
	.dwattr $C$DW$561, DW_AT_TI_symbol_name("ymax")
	.dwattr $C$DW$561, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$561, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$561, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$561, DW_AT_decl_line(0x70)
	.dwattr $C$DW$561, DW_AT_decl_column(0x0d)
$C$DW$562	.dwtag  DW_TAG_member
	.dwattr $C$DW$562, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$562, DW_AT_name("seedx")
	.dwattr $C$DW$562, DW_AT_TI_symbol_name("seedx")
	.dwattr $C$DW$562, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$562, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$562, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$562, DW_AT_decl_line(0x72)
	.dwattr $C$DW$562, DW_AT_decl_column(0x0d)
$C$DW$563	.dwtag  DW_TAG_member
	.dwattr $C$DW$563, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$563, DW_AT_name("seedy")
	.dwattr $C$DW$563, DW_AT_TI_symbol_name("seedy")
	.dwattr $C$DW$563, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$563, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$563, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$563, DW_AT_decl_line(0x73)
	.dwattr $C$DW$563, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$59

	.dwattr $C$DW$T$59, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$T$59, DW_AT_decl_line(0x68)
	.dwattr $C$DW$T$59, DW_AT_decl_column(0x10)
$C$DW$T$115	.dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
	.dwattr $C$DW$T$115, DW_AT_type(*$C$DW$T$59)
	.dwattr $C$DW$T$115, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$115, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$T$115, DW_AT_decl_line(0x75)
	.dwattr $C$DW$T$115, DW_AT_decl_column(0x03)

$C$DW$T$62	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$62, DW_AT_byte_size(0x10)
$C$DW$564	.dwtag  DW_TAG_member
	.dwattr $C$DW$564, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$564, DW_AT_name("daylight")
	.dwattr $C$DW$564, DW_AT_TI_symbol_name("daylight")
	.dwattr $C$DW$564, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$564, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$564, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$564, DW_AT_decl_line(0x52)
	.dwattr $C$DW$564, DW_AT_decl_column(0x0b)
$C$DW$565	.dwtag  DW_TAG_member
	.dwattr $C$DW$565, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$565, DW_AT_name("timezone")
	.dwattr $C$DW$565, DW_AT_TI_symbol_name("timezone")
	.dwattr $C$DW$565, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$565, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$565, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$565, DW_AT_decl_line(0x53)
	.dwattr $C$DW$565, DW_AT_decl_column(0x0b)
$C$DW$566	.dwtag  DW_TAG_member
	.dwattr $C$DW$566, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$566, DW_AT_name("tzname")
	.dwattr $C$DW$566, DW_AT_TI_symbol_name("tzname")
	.dwattr $C$DW$566, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$566, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$566, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$566, DW_AT_decl_line(0x54)
	.dwattr $C$DW$566, DW_AT_decl_column(0x0b)
$C$DW$567	.dwtag  DW_TAG_member
	.dwattr $C$DW$567, DW_AT_type(*$C$DW$T$61)
	.dwattr $C$DW$567, DW_AT_name("dstname")
	.dwattr $C$DW$567, DW_AT_TI_symbol_name("dstname")
	.dwattr $C$DW$567, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$567, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$567, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$567, DW_AT_decl_line(0x55)
	.dwattr $C$DW$567, DW_AT_decl_column(0x0b)
	.dwendtag $C$DW$T$62

	.dwattr $C$DW$T$62, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$T$62, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$62, DW_AT_decl_column(0x01)
$C$DW$T$116	.dwtag  DW_TAG_typedef, DW_AT_name("TZ")
	.dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$62)
	.dwattr $C$DW$T$116, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$116, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$T$116, DW_AT_decl_line(0x56)
	.dwattr $C$DW$T$116, DW_AT_decl_column(0x03)

$C$DW$T$64	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$64, DW_AT_name("S3_1")
	.dwattr $C$DW$T$64, DW_AT_declaration
	.dwendtag $C$DW$T$64


$C$DW$T$66	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$66, DW_AT_name("S4_3")
	.dwattr $C$DW$T$66, DW_AT_declaration
	.dwendtag $C$DW$T$66


$C$DW$T$63	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$63, DW_AT_name("U3_0")
	.dwattr $C$DW$T$63, DW_AT_declaration
	.dwendtag $C$DW$T$63


$C$DW$T$65	.dwtag  DW_TAG_union_type
	.dwattr $C$DW$T$65, DW_AT_name("U4_2")
	.dwattr $C$DW$T$65, DW_AT_declaration
	.dwendtag $C$DW$T$65


$C$DW$T$19	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$19, DW_AT_name("_AVMBlob")
	.dwattr $C$DW$T$19, DW_AT_declaration
	.dwendtag $C$DW$T$19

	.dwattr $C$DW$T$19, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$19, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$T$19, DW_AT_decl_column(0x10)
$C$DW$T$118	.dwtag  DW_TAG_typedef, DW_AT_name("AVMBlob")
	.dwattr $C$DW$T$118, DW_AT_type(*$C$DW$T$19)
	.dwattr $C$DW$T$118, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$118, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$118, DW_AT_decl_line(0x1f)
	.dwattr $C$DW$T$118, DW_AT_decl_column(0x19)

$C$DW$T$20	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$20, DW_AT_name("_AVMBranch")
	.dwattr $C$DW$T$20, DW_AT_declaration
	.dwendtag $C$DW$T$20

	.dwattr $C$DW$T$20, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$20, DW_AT_decl_line(0x20)
	.dwattr $C$DW$T$20, DW_AT_decl_column(0x10)
$C$DW$T$119	.dwtag  DW_TAG_typedef, DW_AT_name("AVMBranch")
	.dwattr $C$DW$T$119, DW_AT_type(*$C$DW$T$20)
	.dwattr $C$DW$T$119, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$119, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$119, DW_AT_decl_line(0x20)
	.dwattr $C$DW$T$119, DW_AT_decl_column(0x1b)

$C$DW$T$21	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$21, DW_AT_name("_AVMComplexEventFilter")
	.dwattr $C$DW$T$21, DW_AT_declaration
	.dwendtag $C$DW$T$21

	.dwattr $C$DW$T$21, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$21, DW_AT_decl_line(0x38)
	.dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
$C$DW$T$120	.dwtag  DW_TAG_typedef, DW_AT_name("AVMCEF")
	.dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$21)
	.dwattr $C$DW$T$120, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$120, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$120, DW_AT_decl_line(0x38)
	.dwattr $C$DW$T$120, DW_AT_decl_column(0x27)

$C$DW$T$22	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$22, DW_AT_name("_AVMEnvironment")
	.dwattr $C$DW$T$22, DW_AT_declaration
	.dwendtag $C$DW$T$22

	.dwattr $C$DW$T$22, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$22, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$22, DW_AT_decl_column(0x10)
$C$DW$T$121	.dwtag  DW_TAG_typedef, DW_AT_name("AVMEnvironment")
	.dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$22)
	.dwattr $C$DW$T$121, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$121, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$121, DW_AT_decl_line(0x22)
	.dwattr $C$DW$T$121, DW_AT_decl_column(0x20)

$C$DW$T$23	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$23, DW_AT_name("_AVMEvent")
	.dwattr $C$DW$T$23, DW_AT_declaration
	.dwendtag $C$DW$T$23

	.dwattr $C$DW$T$23, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$23, DW_AT_decl_line(0x23)
	.dwattr $C$DW$T$23, DW_AT_decl_column(0x10)
$C$DW$T$122	.dwtag  DW_TAG_typedef, DW_AT_name("AVMEvent")
	.dwattr $C$DW$T$122, DW_AT_type(*$C$DW$T$23)
	.dwattr $C$DW$T$122, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$122, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$122, DW_AT_decl_line(0x23)
	.dwattr $C$DW$T$122, DW_AT_decl_column(0x1a)

$C$DW$T$24	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$24, DW_AT_name("_AVMEventFilter")
	.dwattr $C$DW$T$24, DW_AT_declaration
	.dwendtag $C$DW$T$24

	.dwattr $C$DW$T$24, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$24, DW_AT_decl_line(0x25)
	.dwattr $C$DW$T$24, DW_AT_decl_column(0x10)
$C$DW$T$123	.dwtag  DW_TAG_typedef, DW_AT_name("AVMEventFilter")
	.dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$24)
	.dwattr $C$DW$T$123, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$123, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$123, DW_AT_decl_line(0x25)
	.dwattr $C$DW$T$123, DW_AT_decl_column(0x20)

$C$DW$T$25	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$25, DW_AT_name("_AVMEventRecord")
	.dwattr $C$DW$T$25, DW_AT_declaration
	.dwendtag $C$DW$T$25

	.dwattr $C$DW$T$25, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$25, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
$C$DW$T$124	.dwtag  DW_TAG_typedef, DW_AT_name("AVMEventRecord")
	.dwattr $C$DW$T$124, DW_AT_type(*$C$DW$T$25)
	.dwattr $C$DW$T$124, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$124, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$124, DW_AT_decl_line(0x24)
	.dwattr $C$DW$T$124, DW_AT_decl_column(0x20)

$C$DW$T$26	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$26, DW_AT_name("_AVMFrame")
	.dwattr $C$DW$T$26, DW_AT_declaration
	.dwendtag $C$DW$T$26

	.dwattr $C$DW$T$26, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$26, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
$C$DW$T$125	.dwtag  DW_TAG_typedef, DW_AT_name("AVMFrame")
	.dwattr $C$DW$T$125, DW_AT_type(*$C$DW$T$26)
	.dwattr $C$DW$T$125, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$125, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$125, DW_AT_decl_line(0x26)
	.dwattr $C$DW$T$125, DW_AT_decl_column(0x1a)

$C$DW$T$27	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$27, DW_AT_name("_AVMInterval")
	.dwattr $C$DW$T$27, DW_AT_declaration
	.dwendtag $C$DW$T$27

	.dwattr $C$DW$T$27, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$27, DW_AT_decl_line(0x27)
	.dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
$C$DW$T$126	.dwtag  DW_TAG_typedef, DW_AT_name("AVMInterval")
	.dwattr $C$DW$T$126, DW_AT_type(*$C$DW$T$27)
	.dwattr $C$DW$T$126, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$126, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$126, DW_AT_decl_line(0x27)
	.dwattr $C$DW$T$126, DW_AT_decl_column(0x1d)

$C$DW$T$28	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$28, DW_AT_name("_AVMIntervalImage")
	.dwattr $C$DW$T$28, DW_AT_declaration
	.dwendtag $C$DW$T$28

	.dwattr $C$DW$T$28, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$28, DW_AT_decl_line(0x28)
	.dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
$C$DW$T$127	.dwtag  DW_TAG_typedef, DW_AT_name("AVMIntervalImage")
	.dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$127, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$127, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$127, DW_AT_decl_line(0x28)
	.dwattr $C$DW$T$127, DW_AT_decl_column(0x22)
$C$DW$T$128	.dwtag  DW_TAG_typedef, DW_AT_name("AVMii")
	.dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$28)
	.dwattr $C$DW$T$128, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$128, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$128, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$T$128, DW_AT_decl_column(0x22)
$C$DW$T$129	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$129, DW_AT_type(*$C$DW$T$128)
$C$DW$T$130	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$130, DW_AT_type(*$C$DW$T$129)
	.dwattr $C$DW$T$130, DW_AT_address_class(0x20)
$C$DW$T$131	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$128)
	.dwattr $C$DW$T$131, DW_AT_address_class(0x20)

$C$DW$T$29	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$29, DW_AT_name("_AVMIntervalRow")
	.dwattr $C$DW$T$29, DW_AT_declaration
	.dwendtag $C$DW$T$29

	.dwattr $C$DW$T$29, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$29, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
$C$DW$T$133	.dwtag  DW_TAG_typedef, DW_AT_name("AVMIntervalRow")
	.dwattr $C$DW$T$133, DW_AT_type(*$C$DW$T$29)
	.dwattr $C$DW$T$133, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$133, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$133, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$133, DW_AT_decl_column(0x20)

$C$DW$T$30	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$30, DW_AT_name("_AVMLogServer")
	.dwattr $C$DW$T$30, DW_AT_declaration
	.dwendtag $C$DW$T$30

	.dwattr $C$DW$T$30, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$30, DW_AT_decl_line(0x33)
	.dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
$C$DW$T$134	.dwtag  DW_TAG_typedef, DW_AT_name("AVMLogServer")
	.dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$30)
	.dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$134, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$134, DW_AT_decl_line(0x33)
	.dwattr $C$DW$T$134, DW_AT_decl_column(0x1e)

$C$DW$T$31	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$31, DW_AT_name("_AVMLoiterer")
	.dwattr $C$DW$T$31, DW_AT_declaration
	.dwendtag $C$DW$T$31

	.dwattr $C$DW$T$31, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$31, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
$C$DW$T$135	.dwtag  DW_TAG_typedef, DW_AT_name("AVMLoiterer")
	.dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$31)
	.dwattr $C$DW$T$135, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$135, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$135, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$135, DW_AT_decl_column(0x1d)

$C$DW$T$32	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$32, DW_AT_name("_AVMMapInterface")
	.dwattr $C$DW$T$32, DW_AT_declaration
	.dwendtag $C$DW$T$32

	.dwattr $C$DW$T$32, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$32, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
$C$DW$T$136	.dwtag  DW_TAG_typedef, DW_AT_name("AVMMapInterface")
	.dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$32)
	.dwattr $C$DW$T$136, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$136, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$136, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$136, DW_AT_decl_column(0x21)

$C$DW$T$33	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$33, DW_AT_name("_AVMModel")
	.dwattr $C$DW$T$33, DW_AT_declaration
	.dwendtag $C$DW$T$33

	.dwattr $C$DW$T$33, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$33, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
$C$DW$T$137	.dwtag  DW_TAG_typedef, DW_AT_name("AVMModel")
	.dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$33)
	.dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$137, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$137, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$137, DW_AT_decl_column(0x1a)

$C$DW$T$34	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$34, DW_AT_name("_AVMMsgDispatcher")
	.dwattr $C$DW$T$34, DW_AT_declaration
	.dwendtag $C$DW$T$34

	.dwattr $C$DW$T$34, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$34, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$34, DW_AT_decl_column(0x10)
$C$DW$T$138	.dwtag  DW_TAG_typedef, DW_AT_name("AVMMsgDispatcher")
	.dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$34)
	.dwattr $C$DW$T$138, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$138, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$138, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$138, DW_AT_decl_column(0x22)

$C$DW$T$35	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$35, DW_AT_name("_AVMObject")
	.dwattr $C$DW$T$35, DW_AT_declaration
	.dwendtag $C$DW$T$35

	.dwattr $C$DW$T$35, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$35, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
$C$DW$T$139	.dwtag  DW_TAG_typedef, DW_AT_name("AVMObject")
	.dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$35)
	.dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$139, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$139, DW_AT_decl_line(0x29)
	.dwattr $C$DW$T$139, DW_AT_decl_column(0x1b)

$C$DW$T$36	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$36, DW_AT_name("_AVMObjectRecord")
	.dwattr $C$DW$T$36, DW_AT_declaration
	.dwendtag $C$DW$T$36

	.dwattr $C$DW$T$36, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$36, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
$C$DW$T$140	.dwtag  DW_TAG_typedef, DW_AT_name("AVMObjectRecord")
	.dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$36)
	.dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$140, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$140, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$140, DW_AT_decl_column(0x21)

$C$DW$T$37	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$37, DW_AT_name("_AVMObsRecord")
	.dwattr $C$DW$T$37, DW_AT_declaration
	.dwendtag $C$DW$T$37

	.dwattr $C$DW$T$37, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$37, DW_AT_decl_line(0x31)
	.dwattr $C$DW$T$37, DW_AT_decl_column(0x10)
$C$DW$T$141	.dwtag  DW_TAG_typedef, DW_AT_name("AVMObsRec")
	.dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$37)
	.dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$141, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$141, DW_AT_decl_line(0x31)
	.dwattr $C$DW$T$141, DW_AT_decl_column(0x1e)

$C$DW$T$38	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$38, DW_AT_name("_AVMObservation")
	.dwattr $C$DW$T$38, DW_AT_declaration
	.dwendtag $C$DW$T$38

	.dwattr $C$DW$T$38, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$38, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$T$38, DW_AT_decl_column(0x10)
$C$DW$T$142	.dwtag  DW_TAG_typedef, DW_AT_name("AVMObs")
	.dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$142, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$142, DW_AT_decl_line(0x30)
	.dwattr $C$DW$T$142, DW_AT_decl_column(0x20)
$C$DW$T$143	.dwtag  DW_TAG_typedef, DW_AT_name("AVMObservation")
	.dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$38)
	.dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$143, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$143, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$T$143, DW_AT_decl_column(0x20)

$C$DW$T$39	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$39, DW_AT_name("_AVMParam")
	.dwattr $C$DW$T$39, DW_AT_declaration
	.dwendtag $C$DW$T$39

	.dwattr $C$DW$T$39, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$39, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$39, DW_AT_decl_column(0x10)
$C$DW$T$144	.dwtag  DW_TAG_typedef, DW_AT_name("AVMParam")
	.dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$39)
	.dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$144, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$144, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$144, DW_AT_decl_column(0x1a)

$C$DW$T$40	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$40, DW_AT_name("_AVMParamSet")
	.dwattr $C$DW$T$40, DW_AT_declaration
	.dwendtag $C$DW$T$40

	.dwattr $C$DW$T$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$40, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
$C$DW$T$145	.dwtag  DW_TAG_typedef, DW_AT_name("AVMParamSet")
	.dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$40)
	.dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$145, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$145, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$145, DW_AT_decl_column(0x1d)

$C$DW$T$41	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$41, DW_AT_name("_AVMQuad")
	.dwattr $C$DW$T$41, DW_AT_declaration
	.dwendtag $C$DW$T$41

	.dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$41, DW_AT_decl_line(0x21)
	.dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
$C$DW$T$146	.dwtag  DW_TAG_typedef, DW_AT_name("AVMQuad")
	.dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$41)
	.dwattr $C$DW$T$146, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$146, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$146, DW_AT_decl_line(0x21)
	.dwattr $C$DW$T$146, DW_AT_decl_column(0x19)

$C$DW$T$42	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$42, DW_AT_name("_AVMRecordDB")
	.dwattr $C$DW$T$42, DW_AT_declaration
	.dwendtag $C$DW$T$42

	.dwattr $C$DW$T$42, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$42, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$42, DW_AT_decl_column(0x10)
$C$DW$T$147	.dwtag  DW_TAG_typedef, DW_AT_name("AVMRecordDB")
	.dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$42)
	.dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$147, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$147, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$147, DW_AT_decl_column(0x1d)

$C$DW$T$43	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$43, DW_AT_name("_AVMRegion")
	.dwattr $C$DW$T$43, DW_AT_declaration
	.dwendtag $C$DW$T$43

	.dwattr $C$DW$T$43, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$43, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
$C$DW$T$148	.dwtag  DW_TAG_typedef, DW_AT_name("AVMRegion")
	.dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$43)
	.dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$148, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$148, DW_AT_decl_line(0x36)
	.dwattr $C$DW$T$148, DW_AT_decl_column(0x1b)

$C$DW$T$44	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$44, DW_AT_name("_AVMSequence")
	.dwattr $C$DW$T$44, DW_AT_declaration
	.dwendtag $C$DW$T$44

	.dwattr $C$DW$T$44, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$44, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
$C$DW$T$149	.dwtag  DW_TAG_typedef, DW_AT_name("AVMSequence")
	.dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$44)
	.dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$149, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$149, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$149, DW_AT_decl_column(0x1d)

$C$DW$T$45	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$45, DW_AT_name("_LOG_Item")
	.dwattr $C$DW$T$45, DW_AT_declaration
	.dwendtag $C$DW$T$45

	.dwattr $C$DW$T$45, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$45, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$T$45, DW_AT_decl_column(0x10)
$C$DW$T$150	.dwtag  DW_TAG_typedef, DW_AT_name("LOG_Item")
	.dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$45)
	.dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$150, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../../VLIB_Connected_Components_Labeling/AVMClasses.h")
	.dwattr $C$DW$T$150, DW_AT_decl_line(0x3b)
	.dwattr $C$DW$T$150, DW_AT_decl_column(0x1a)
$C$DW$T$2	.dwtag  DW_TAG_unspecified_type
	.dwattr $C$DW$T$2, DW_AT_name("void")
$C$DW$T$3	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
	.dwattr $C$DW$T$3, DW_AT_address_class(0x20)
$C$DW$T$151	.dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
	.dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$3)
	.dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$151, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$T$151, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$T$151, DW_AT_decl_column(0x19)
$C$DW$T$4	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
	.dwattr $C$DW$T$4, DW_AT_name("bool")
	.dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
$C$DW$T$5	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$5, DW_AT_name("signed char")
	.dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
$C$DW$T$177	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$177, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$T$177, DW_AT_address_class(0x20)
$C$DW$T$191	.dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
	.dwattr $C$DW$T$191, DW_AT_type(*$C$DW$T$5)
	.dwattr $C$DW$T$191, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$191, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$191, DW_AT_decl_line(0x2a)
	.dwattr $C$DW$T$191, DW_AT_decl_column(0x1d)
$C$DW$T$192	.dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
	.dwattr $C$DW$T$192, DW_AT_type(*$C$DW$T$191)
	.dwattr $C$DW$T$192, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$192, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$192, DW_AT_decl_line(0x39)
	.dwattr $C$DW$T$192, DW_AT_decl_column(0x17)
$C$DW$T$6	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
	.dwattr $C$DW$T$6, DW_AT_name("unsigned char")
	.dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
$C$DW$T$54	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$54, DW_AT_address_class(0x20)

$C$DW$T$194	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$194, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$194, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$194, DW_AT_byte_size(0x08)
$C$DW$568	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$568, DW_AT_upper_bound(0x07)
	.dwendtag $C$DW$T$194


$C$DW$T$196	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$196, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$196, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$196, DW_AT_byte_size(0x04)
$C$DW$569	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$569, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$196

$C$DW$T$49	.dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
	.dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$6)
	.dwattr $C$DW$T$49, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$49, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$49, DW_AT_decl_line(0x2b)
	.dwattr $C$DW$T$49, DW_AT_decl_column(0x1c)
$C$DW$T$50	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$50, DW_AT_address_class(0x20)
$C$DW$T$90	.dwtag  DW_TAG_restrict_type
	.dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$50)
$C$DW$T$198	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$198, DW_AT_type(*$C$DW$T$50)
$C$DW$T$199	.dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
	.dwattr $C$DW$T$199, DW_AT_type(*$C$DW$T$49)
	.dwattr $C$DW$T$199, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$199, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$199, DW_AT_decl_line(0x3a)
	.dwattr $C$DW$T$199, DW_AT_decl_column(0x16)
$C$DW$T$7	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$7, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
$C$DW$T$8	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$8, DW_AT_name("short")
	.dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
$C$DW$T$79	.dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
	.dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$8)
	.dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$79, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$79, DW_AT_decl_line(0x2c)
	.dwattr $C$DW$T$79, DW_AT_decl_column(0x1d)
$C$DW$T$200	.dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
	.dwattr $C$DW$T$200, DW_AT_type(*$C$DW$T$79)
	.dwattr $C$DW$T$200, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$200, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$200, DW_AT_decl_line(0x3c)
	.dwattr $C$DW$T$200, DW_AT_decl_column(0x17)
$C$DW$T$9	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$9, DW_AT_name("unsigned short")
	.dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
$C$DW$T$85	.dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
	.dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$85, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$85, DW_AT_decl_line(0x2d)
	.dwattr $C$DW$T$85, DW_AT_decl_column(0x1c)
$C$DW$T$91	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$85)
$C$DW$T$202	.dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
	.dwattr $C$DW$T$202, DW_AT_type(*$C$DW$T$85)
	.dwattr $C$DW$T$202, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$202, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$202, DW_AT_decl_line(0x3d)
	.dwattr $C$DW$T$202, DW_AT_decl_column(0x16)
$C$DW$T$201	.dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
	.dwattr $C$DW$T$201, DW_AT_type(*$C$DW$T$9)
	.dwattr $C$DW$T$201, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$201, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdlib.h")
	.dwattr $C$DW$T$201, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$201, DW_AT_decl_column(0x1a)
$C$DW$T$10	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$10, DW_AT_name("int")
	.dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
$C$DW$T$267	.dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
	.dwattr $C$DW$T$267, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$267, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$267, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdio.h")
	.dwattr $C$DW$T$267, DW_AT_decl_line(0x53)
	.dwattr $C$DW$T$267, DW_AT_decl_column(0x0d)
$C$DW$T$46	.dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
	.dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$46, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$46, DW_AT_decl_line(0x2e)
	.dwattr $C$DW$T$46, DW_AT_decl_column(0x1d)
$C$DW$T$82	.dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
	.dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$82, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$T$82, DW_AT_decl_line(0x77)
	.dwattr $C$DW$T$82, DW_AT_decl_column(0x11)
$C$DW$T$83	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
	.dwattr $C$DW$T$83, DW_AT_address_class(0x20)

$C$DW$T$67	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$67, DW_AT_byte_size(0x10)
$C$DW$570	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$570, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$67

$C$DW$T$80	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$80, DW_AT_address_class(0x20)
$C$DW$T$261	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$261, DW_AT_type(*$C$DW$T$46)
$C$DW$T$262	.dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
	.dwattr $C$DW$T$262, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$262, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$262, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$262, DW_AT_decl_line(0x4b)
	.dwattr $C$DW$T$262, DW_AT_decl_column(0x17)
$C$DW$T$263	.dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
	.dwattr $C$DW$T$263, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$263, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$263, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$263, DW_AT_decl_line(0x4e)
	.dwattr $C$DW$T$263, DW_AT_decl_column(0x17)
$C$DW$T$264	.dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
	.dwattr $C$DW$T$264, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$264, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$264, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$264, DW_AT_decl_line(0x49)
	.dwattr $C$DW$T$264, DW_AT_decl_column(0x17)
$C$DW$T$265	.dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
	.dwattr $C$DW$T$265, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$T$265, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$265, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$265, DW_AT_decl_line(0x3e)
	.dwattr $C$DW$T$265, DW_AT_decl_column(0x17)
$C$DW$T$266	.dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
	.dwattr $C$DW$T$266, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$T$266, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$266, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$266, DW_AT_decl_line(0x58)
	.dwattr $C$DW$T$266, DW_AT_decl_column(0x1a)
$C$DW$T$11	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$11, DW_AT_name("unsigned int")
	.dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
$C$DW$T$268	.dwtag  DW_TAG_typedef, DW_AT_name("VLIB_VAL")
	.dwattr $C$DW$T$268, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$268, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$268, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$T$268, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$T$268, DW_AT_decl_column(0x17)
$C$DW$T$269	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$269, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$269, DW_AT_address_class(0x20)
$C$DW$T$288	.dwtag  DW_TAG_typedef, DW_AT_name("clock_t")
	.dwattr $C$DW$T$288, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$288, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$288, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$T$288, DW_AT_decl_line(0x37)
	.dwattr $C$DW$T$288, DW_AT_decl_column(0x16)
$C$DW$T$152	.dwtag  DW_TAG_typedef, DW_AT_name("size_t")
	.dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$152, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdio.h")
	.dwattr $C$DW$T$152, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$152, DW_AT_decl_column(0x19)
$C$DW$T$278	.dwtag  DW_TAG_typedef, DW_AT_name("time_t")
	.dwattr $C$DW$T$278, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$278, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$278, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$T$278, DW_AT_decl_line(0x38)
	.dwattr $C$DW$T$278, DW_AT_decl_column(0x16)
$C$DW$T$86	.dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
	.dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$86, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$86, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$T$86, DW_AT_decl_column(0x1c)
$C$DW$T$87	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$87, DW_AT_address_class(0x20)
$C$DW$T$279	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$279, DW_AT_type(*$C$DW$T$87)
$C$DW$T$283	.dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
	.dwattr $C$DW$T$283, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$283, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$283, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$283, DW_AT_decl_line(0x4c)
	.dwattr $C$DW$T$283, DW_AT_decl_column(0x16)
$C$DW$T$284	.dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
	.dwattr $C$DW$T$284, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$284, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$284, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$284, DW_AT_decl_line(0x4f)
	.dwattr $C$DW$T$284, DW_AT_decl_column(0x16)
$C$DW$T$285	.dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
	.dwattr $C$DW$T$285, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$285, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$285, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$285, DW_AT_decl_line(0x4a)
	.dwattr $C$DW$T$285, DW_AT_decl_column(0x16)
$C$DW$T$286	.dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
	.dwattr $C$DW$T$286, DW_AT_type(*$C$DW$T$86)
	.dwattr $C$DW$T$286, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$286, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$286, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$T$286, DW_AT_decl_column(0x16)
$C$DW$T$287	.dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
	.dwattr $C$DW$T$287, DW_AT_type(*$C$DW$T$11)
	.dwattr $C$DW$T$287, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$287, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$287, DW_AT_decl_line(0x59)
	.dwattr $C$DW$T$287, DW_AT_decl_column(0x1a)
$C$DW$T$12	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$12, DW_AT_name("__int40_t")
	.dwattr $C$DW$T$12, DW_AT_byte_size(0x08)
	.dwattr $C$DW$T$12, DW_AT_bit_size(0x28)
	.dwattr $C$DW$T$12, DW_AT_bit_offset(0x18)
$C$DW$T$289	.dwtag  DW_TAG_typedef, DW_AT_name("int40_t")
	.dwattr $C$DW$T$289, DW_AT_type(*$C$DW$T$12)
	.dwattr $C$DW$T$289, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$289, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$289, DW_AT_decl_line(0x31)
	.dwattr $C$DW$T$289, DW_AT_decl_column(0x21)
$C$DW$T$290	.dwtag  DW_TAG_typedef, DW_AT_name("int_fast40_t")
	.dwattr $C$DW$T$290, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$T$290, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$290, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$290, DW_AT_decl_line(0x51)
	.dwattr $C$DW$T$290, DW_AT_decl_column(0x17)
$C$DW$T$291	.dwtag  DW_TAG_typedef, DW_AT_name("int_least40_t")
	.dwattr $C$DW$T$291, DW_AT_type(*$C$DW$T$289)
	.dwattr $C$DW$T$291, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$291, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$291, DW_AT_decl_line(0x41)
	.dwattr $C$DW$T$291, DW_AT_decl_column(0x17)
$C$DW$T$13	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$13, DW_AT_name("unsigned __int40_t")
	.dwattr $C$DW$T$13, DW_AT_byte_size(0x08)
	.dwattr $C$DW$T$13, DW_AT_bit_size(0x28)
	.dwattr $C$DW$T$13, DW_AT_bit_offset(0x18)
$C$DW$T$292	.dwtag  DW_TAG_typedef, DW_AT_name("uint40_t")
	.dwattr $C$DW$T$292, DW_AT_type(*$C$DW$T$13)
	.dwattr $C$DW$T$292, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$292, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$292, DW_AT_decl_line(0x32)
	.dwattr $C$DW$T$292, DW_AT_decl_column(0x20)
$C$DW$T$293	.dwtag  DW_TAG_typedef, DW_AT_name("uint_fast40_t")
	.dwattr $C$DW$T$293, DW_AT_type(*$C$DW$T$292)
	.dwattr $C$DW$T$293, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$293, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$293, DW_AT_decl_line(0x52)
	.dwattr $C$DW$T$293, DW_AT_decl_column(0x16)
$C$DW$T$294	.dwtag  DW_TAG_typedef, DW_AT_name("uint_least40_t")
	.dwattr $C$DW$T$294, DW_AT_type(*$C$DW$T$292)
	.dwattr $C$DW$T$294, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$294, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$294, DW_AT_decl_line(0x42)
	.dwattr $C$DW$T$294, DW_AT_decl_column(0x16)
$C$DW$T$14	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
	.dwattr $C$DW$T$14, DW_AT_name("long long")
	.dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
$C$DW$T$296	.dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
	.dwattr $C$DW$T$296, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$296, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$296, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$296, DW_AT_decl_line(0x34)
	.dwattr $C$DW$T$296, DW_AT_decl_column(0x21)
$C$DW$T$297	.dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
	.dwattr $C$DW$T$297, DW_AT_type(*$C$DW$T$296)
	.dwattr $C$DW$T$297, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$297, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$297, DW_AT_decl_line(0x54)
	.dwattr $C$DW$T$297, DW_AT_decl_column(0x17)
$C$DW$T$298	.dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
	.dwattr $C$DW$T$298, DW_AT_type(*$C$DW$T$296)
	.dwattr $C$DW$T$298, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$298, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$298, DW_AT_decl_line(0x44)
	.dwattr $C$DW$T$298, DW_AT_decl_column(0x17)
$C$DW$T$299	.dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
	.dwattr $C$DW$T$299, DW_AT_type(*$C$DW$T$14)
	.dwattr $C$DW$T$299, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$299, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$299, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$T$299, DW_AT_decl_column(0x20)
$C$DW$T$15	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
	.dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
	.dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
$C$DW$T$301	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$301, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$301, DW_AT_address_class(0x20)
$C$DW$T$302	.dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
	.dwattr $C$DW$T$302, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$302, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$302, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$302, DW_AT_decl_line(0x35)
	.dwattr $C$DW$T$302, DW_AT_decl_column(0x20)

$C$DW$T$303	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$303, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$T$303, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$303, DW_AT_byte_size(0x10)
$C$DW$571	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$571, DW_AT_upper_bound(0x01)
	.dwendtag $C$DW$T$303

$C$DW$T$304	.dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
	.dwattr $C$DW$T$304, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$T$304, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$304, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$304, DW_AT_decl_line(0x55)
	.dwattr $C$DW$T$304, DW_AT_decl_column(0x16)
$C$DW$T$305	.dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
	.dwattr $C$DW$T$305, DW_AT_type(*$C$DW$T$302)
	.dwattr $C$DW$T$305, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$305, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$305, DW_AT_decl_line(0x45)
	.dwattr $C$DW$T$305, DW_AT_decl_column(0x16)
$C$DW$T$306	.dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
	.dwattr $C$DW$T$306, DW_AT_type(*$C$DW$T$15)
	.dwattr $C$DW$T$306, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$306, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdint.h")
	.dwattr $C$DW$T$306, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$T$306, DW_AT_decl_column(0x20)
$C$DW$T$16	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$16, DW_AT_name("float")
	.dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
$C$DW$T$47	.dwtag  DW_TAG_typedef, DW_AT_name("VLIB_F32")
	.dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$47, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$T$47, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$T$47, DW_AT_decl_column(0x0f)
$C$DW$T$307	.dwtag  DW_TAG_typedef, DW_AT_name("float32_t")
	.dwattr $C$DW$T$307, DW_AT_type(*$C$DW$T$16)
	.dwattr $C$DW$T$307, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$307, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\include\vect.h")
	.dwattr $C$DW$T$307, DW_AT_decl_line(0x30)
	.dwattr $C$DW$T$307, DW_AT_decl_column(0x0f)
$C$DW$T$17	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$17, DW_AT_name("double")
	.dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
$C$DW$T$308	.dwtag  DW_TAG_typedef, DW_AT_name("VLIB_D64")
	.dwattr $C$DW$T$308, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$T$308, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$308, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\..\common\c66/VLIB_types.h")
	.dwattr $C$DW$T$308, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$T$308, DW_AT_decl_column(0x10)
$C$DW$T$311	.dwtag  DW_TAG_typedef, DW_AT_name("__float2_t")
	.dwattr $C$DW$T$311, DW_AT_type(*$C$DW$T$17)
	.dwattr $C$DW$T$311, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$311, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/c6x.h")
	.dwattr $C$DW$T$311, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$T$311, DW_AT_decl_column(0x14)
$C$DW$T$18	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
	.dwattr $C$DW$T$18, DW_AT_name("long double")
	.dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
$C$DW$T$60	.dwtag  DW_TAG_base_type
	.dwattr $C$DW$T$60, DW_AT_encoding(DW_ATE_signed_char)
	.dwattr $C$DW$T$60, DW_AT_name("signed char")
	.dwattr $C$DW$T$60, DW_AT_byte_size(0x01)

$C$DW$T$61	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$61, DW_AT_byte_size(0x04)
$C$DW$572	.dwtag  DW_TAG_subrange_type
	.dwattr $C$DW$572, DW_AT_upper_bound(0x03)
	.dwendtag $C$DW$T$61

$C$DW$T$159	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$159, DW_AT_address_class(0x20)
$C$DW$T$312	.dwtag  DW_TAG_typedef, DW_AT_name("va_list")
	.dwattr $C$DW$T$312, DW_AT_type(*$C$DW$T$159)
	.dwattr $C$DW$T$312, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$312, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/stdarg.h")
	.dwattr $C$DW$T$312, DW_AT_decl_line(0x2f)
	.dwattr $C$DW$T$312, DW_AT_decl_column(0x12)
$C$DW$T$203	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$203, DW_AT_type(*$C$DW$T$60)
$C$DW$T$204	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$204, DW_AT_type(*$C$DW$T$203)
	.dwattr $C$DW$T$204, DW_AT_address_class(0x20)

$C$DW$T$313	.dwtag  DW_TAG_array_type
	.dwattr $C$DW$T$313, DW_AT_type(*$C$DW$T$60)
	.dwattr $C$DW$T$313, DW_AT_language(DW_LANG_C)
$C$DW$573	.dwtag  DW_TAG_subrange_type
	.dwendtag $C$DW$T$313


$C$DW$T$68	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$68, DW_AT_name("__simd128_int32_t")
	.dwattr $C$DW$T$68, DW_AT_byte_size(0x10)
$C$DW$574	.dwtag  DW_TAG_member
	.dwattr $C$DW$574, DW_AT_type(*$C$DW$T$67)
	.dwattr $C$DW$574, DW_AT_name("_v")
	.dwattr $C$DW$574, DW_AT_TI_symbol_name("_v")
	.dwattr $C$DW$574, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$574, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$574, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\include\vect.h")
	.dwattr $C$DW$574, DW_AT_decl_line(0x44)
	.dwattr $C$DW$574, DW_AT_decl_column(0x01)
	.dwendtag $C$DW$T$68

	.dwattr $C$DW$T$68, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\include\vect.h")
	.dwattr $C$DW$T$68, DW_AT_decl_line(0x44)
	.dwattr $C$DW$T$68, DW_AT_decl_column(0x01)
$C$DW$T$314	.dwtag  DW_TAG_typedef, DW_AT_name("int32x4_t")
	.dwattr $C$DW$T$314, DW_AT_type(*$C$DW$T$68)
	.dwattr $C$DW$T$314, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$314, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\include\vect.h")
	.dwattr $C$DW$T$314, DW_AT_decl_line(0x44)
	.dwattr $C$DW$T$314, DW_AT_decl_column(0x01)
$C$DW$T$315	.dwtag  DW_TAG_typedef, DW_AT_name("__x128_t")
	.dwattr $C$DW$T$315, DW_AT_type(*$C$DW$T$314)
	.dwattr $C$DW$T$315, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$315, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\include\vect.h")
	.dwattr $C$DW$T$315, DW_AT_decl_line(0x46)
	.dwattr $C$DW$T$315, DW_AT_decl_column(0x13)

$C$DW$T$76	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$76, DW_AT_name("tm")
	.dwattr $C$DW$T$76, DW_AT_byte_size(0x24)
$C$DW$575	.dwtag  DW_TAG_member
	.dwattr $C$DW$575, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$575, DW_AT_name("tm_sec")
	.dwattr $C$DW$575, DW_AT_TI_symbol_name("tm_sec")
	.dwattr $C$DW$575, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$575, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$575, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$575, DW_AT_decl_line(0x41)
	.dwattr $C$DW$575, DW_AT_decl_column(0x09)
$C$DW$576	.dwtag  DW_TAG_member
	.dwattr $C$DW$576, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$576, DW_AT_name("tm_min")
	.dwattr $C$DW$576, DW_AT_TI_symbol_name("tm_min")
	.dwattr $C$DW$576, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$576, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$576, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$576, DW_AT_decl_line(0x42)
	.dwattr $C$DW$576, DW_AT_decl_column(0x09)
$C$DW$577	.dwtag  DW_TAG_member
	.dwattr $C$DW$577, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$577, DW_AT_name("tm_hour")
	.dwattr $C$DW$577, DW_AT_TI_symbol_name("tm_hour")
	.dwattr $C$DW$577, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$577, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$577, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$577, DW_AT_decl_line(0x43)
	.dwattr $C$DW$577, DW_AT_decl_column(0x09)
$C$DW$578	.dwtag  DW_TAG_member
	.dwattr $C$DW$578, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$578, DW_AT_name("tm_mday")
	.dwattr $C$DW$578, DW_AT_TI_symbol_name("tm_mday")
	.dwattr $C$DW$578, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$578, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$578, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$578, DW_AT_decl_line(0x44)
	.dwattr $C$DW$578, DW_AT_decl_column(0x09)
$C$DW$579	.dwtag  DW_TAG_member
	.dwattr $C$DW$579, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$579, DW_AT_name("tm_mon")
	.dwattr $C$DW$579, DW_AT_TI_symbol_name("tm_mon")
	.dwattr $C$DW$579, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$579, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$579, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$579, DW_AT_decl_line(0x45)
	.dwattr $C$DW$579, DW_AT_decl_column(0x09)
$C$DW$580	.dwtag  DW_TAG_member
	.dwattr $C$DW$580, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$580, DW_AT_name("tm_year")
	.dwattr $C$DW$580, DW_AT_TI_symbol_name("tm_year")
	.dwattr $C$DW$580, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$580, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$580, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$580, DW_AT_decl_line(0x46)
	.dwattr $C$DW$580, DW_AT_decl_column(0x09)
$C$DW$581	.dwtag  DW_TAG_member
	.dwattr $C$DW$581, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$581, DW_AT_name("tm_wday")
	.dwattr $C$DW$581, DW_AT_TI_symbol_name("tm_wday")
	.dwattr $C$DW$581, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$581, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$581, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$581, DW_AT_decl_line(0x47)
	.dwattr $C$DW$581, DW_AT_decl_column(0x09)
$C$DW$582	.dwtag  DW_TAG_member
	.dwattr $C$DW$582, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$582, DW_AT_name("tm_yday")
	.dwattr $C$DW$582, DW_AT_TI_symbol_name("tm_yday")
	.dwattr $C$DW$582, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$582, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$582, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$582, DW_AT_decl_line(0x48)
	.dwattr $C$DW$582, DW_AT_decl_column(0x09)
$C$DW$583	.dwtag  DW_TAG_member
	.dwattr $C$DW$583, DW_AT_type(*$C$DW$T$10)
	.dwattr $C$DW$583, DW_AT_name("tm_isdst")
	.dwattr $C$DW$583, DW_AT_TI_symbol_name("tm_isdst")
	.dwattr $C$DW$583, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
	.dwattr $C$DW$583, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$583, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$583, DW_AT_decl_line(0x49)
	.dwattr $C$DW$583, DW_AT_decl_column(0x09)
	.dwendtag $C$DW$T$76

	.dwattr $C$DW$T$76, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/time.h")
	.dwattr $C$DW$T$76, DW_AT_decl_line(0x3f)
	.dwattr $C$DW$T$76, DW_AT_decl_column(0x08)

$C$DW$T$69	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$69, DW_AT_name("vlib_blob")
	.dwattr $C$DW$T$69, DW_AT_byte_size(0x20)
$C$DW$584	.dwtag  DW_TAG_member
	.dwattr $C$DW$584, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$584, DW_AT_name("xmin")
	.dwattr $C$DW$584, DW_AT_TI_symbol_name("xmin")
	.dwattr $C$DW$584, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$584, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$584, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$584, DW_AT_decl_line(0x5a)
	.dwattr $C$DW$584, DW_AT_decl_column(0x0d)
$C$DW$585	.dwtag  DW_TAG_member
	.dwattr $C$DW$585, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$585, DW_AT_name("xmax")
	.dwattr $C$DW$585, DW_AT_TI_symbol_name("xmax")
	.dwattr $C$DW$585, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$585, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$585, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$585, DW_AT_decl_line(0x5b)
	.dwattr $C$DW$585, DW_AT_decl_column(0x0d)
$C$DW$586	.dwtag  DW_TAG_member
	.dwattr $C$DW$586, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$586, DW_AT_name("ymin")
	.dwattr $C$DW$586, DW_AT_TI_symbol_name("ymin")
	.dwattr $C$DW$586, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$586, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$586, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$586, DW_AT_decl_line(0x5c)
	.dwattr $C$DW$586, DW_AT_decl_column(0x0d)
$C$DW$587	.dwtag  DW_TAG_member
	.dwattr $C$DW$587, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$587, DW_AT_name("ymax")
	.dwattr $C$DW$587, DW_AT_TI_symbol_name("ymax")
	.dwattr $C$DW$587, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$587, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$587, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$587, DW_AT_decl_line(0x5d)
	.dwattr $C$DW$587, DW_AT_decl_column(0x0d)
$C$DW$588	.dwtag  DW_TAG_member
	.dwattr $C$DW$588, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$588, DW_AT_name("area")
	.dwattr $C$DW$588, DW_AT_TI_symbol_name("area")
	.dwattr $C$DW$588, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$588, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$588, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$588, DW_AT_decl_line(0x5e)
	.dwattr $C$DW$588, DW_AT_decl_column(0x0d)
$C$DW$589	.dwtag  DW_TAG_member
	.dwattr $C$DW$589, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$589, DW_AT_name("numIntervals")
	.dwattr $C$DW$589, DW_AT_TI_symbol_name("numIntervals")
	.dwattr $C$DW$589, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
	.dwattr $C$DW$589, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$589, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$589, DW_AT_decl_line(0x5f)
	.dwattr $C$DW$589, DW_AT_decl_column(0x0d)
$C$DW$590	.dwtag  DW_TAG_member
	.dwattr $C$DW$590, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$590, DW_AT_name("iiValue")
	.dwattr $C$DW$590, DW_AT_TI_symbol_name("iiValue")
	.dwattr $C$DW$590, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
	.dwattr $C$DW$590, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$590, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$590, DW_AT_decl_line(0x60)
	.dwattr $C$DW$590, DW_AT_decl_column(0x0d)
$C$DW$591	.dwtag  DW_TAG_member
	.dwattr $C$DW$591, DW_AT_type(*$C$DW$T$46)
	.dwattr $C$DW$591, DW_AT_name("ccmapColor")
	.dwattr $C$DW$591, DW_AT_TI_symbol_name("ccmapColor")
	.dwattr $C$DW$591, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
	.dwattr $C$DW$591, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$591, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$591, DW_AT_decl_line(0x61)
	.dwattr $C$DW$591, DW_AT_decl_column(0x0d)
	.dwendtag $C$DW$T$69

	.dwattr $C$DW$T$69, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$T$69, DW_AT_decl_line(0x59)
	.dwattr $C$DW$T$69, DW_AT_decl_column(0x10)
$C$DW$T$73	.dwtag  DW_TAG_typedef, DW_AT_name("VLIB_blob")
	.dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$73, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$T$73, DW_AT_decl_line(0x62)
	.dwattr $C$DW$T$73, DW_AT_decl_column(0x02)
$C$DW$T$219	.dwtag  DW_TAG_const_type
	.dwattr $C$DW$T$219, DW_AT_type(*$C$DW$T$73)
$C$DW$T$220	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$220, DW_AT_type(*$C$DW$T$219)
	.dwattr $C$DW$T$220, DW_AT_address_class(0x20)
$C$DW$T$74	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
	.dwattr $C$DW$T$74, DW_AT_address_class(0x20)
$C$DW$T$316	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$316, DW_AT_type(*$C$DW$T$69)
	.dwattr $C$DW$T$316, DW_AT_address_class(0x20)

$C$DW$T$70	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$70, DW_AT_name("vlib_blobAnalysis_box")
	.dwattr $C$DW$T$70, DW_AT_byte_size(0x14)
$C$DW$592	.dwtag  DW_TAG_member
	.dwattr $C$DW$592, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$592, DW_AT_name("x")
	.dwattr $C$DW$592, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$592, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$592, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$592, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$592, DW_AT_decl_line(0x7b)
	.dwattr $C$DW$592, DW_AT_decl_column(0x0e)
$C$DW$593	.dwtag  DW_TAG_member
	.dwattr $C$DW$593, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$593, DW_AT_name("y")
	.dwattr $C$DW$593, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$593, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$593, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$593, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$593, DW_AT_decl_line(0x7c)
	.dwattr $C$DW$593, DW_AT_decl_column(0x0e)
$C$DW$594	.dwtag  DW_TAG_member
	.dwattr $C$DW$594, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$594, DW_AT_name("w")
	.dwattr $C$DW$594, DW_AT_TI_symbol_name("w")
	.dwattr $C$DW$594, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$594, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$594, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$594, DW_AT_decl_line(0x7d)
	.dwattr $C$DW$594, DW_AT_decl_column(0x0e)
$C$DW$595	.dwtag  DW_TAG_member
	.dwattr $C$DW$595, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$595, DW_AT_name("h")
	.dwattr $C$DW$595, DW_AT_TI_symbol_name("h")
	.dwattr $C$DW$595, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
	.dwattr $C$DW$595, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$595, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$595, DW_AT_decl_line(0x7e)
	.dwattr $C$DW$595, DW_AT_decl_column(0x0e)
$C$DW$596	.dwtag  DW_TAG_member
	.dwattr $C$DW$596, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$596, DW_AT_name("angle")
	.dwattr $C$DW$596, DW_AT_TI_symbol_name("angle")
	.dwattr $C$DW$596, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
	.dwattr $C$DW$596, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$596, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$596, DW_AT_decl_line(0x7f)
	.dwattr $C$DW$596, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$70

	.dwattr $C$DW$T$70, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$T$70, DW_AT_decl_line(0x7a)
	.dwattr $C$DW$T$70, DW_AT_decl_column(0x10)
$C$DW$T$227	.dwtag  DW_TAG_typedef, DW_AT_name("VLIB_blobAnalysis_box")
	.dwattr $C$DW$T$227, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$227, DW_AT_language(DW_LANG_C)
	.dwattr $C$DW$T$227, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$T$227, DW_AT_decl_line(0x80)
	.dwattr $C$DW$T$227, DW_AT_decl_column(0x02)
$C$DW$T$228	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$228, DW_AT_type(*$C$DW$T$227)
	.dwattr $C$DW$T$228, DW_AT_address_class(0x20)
$C$DW$T$317	.dwtag  DW_TAG_pointer_type
	.dwattr $C$DW$T$317, DW_AT_type(*$C$DW$T$70)
	.dwattr $C$DW$T$317, DW_AT_address_class(0x20)

$C$DW$T$71	.dwtag  DW_TAG_structure_type
	.dwattr $C$DW$T$71, DW_AT_name("vlib_blobAnalysis_circle")
	.dwattr $C$DW$T$71, DW_AT_byte_size(0x0c)
$C$DW$597	.dwtag  DW_TAG_member
	.dwattr $C$DW$597, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$597, DW_AT_name("x")
	.dwattr $C$DW$597, DW_AT_TI_symbol_name("x")
	.dwattr $C$DW$597, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
	.dwattr $C$DW$597, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$597, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$597, DW_AT_decl_line(0x87)
	.dwattr $C$DW$597, DW_AT_decl_column(0x0e)
$C$DW$598	.dwtag  DW_TAG_member
	.dwattr $C$DW$598, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$598, DW_AT_name("y")
	.dwattr $C$DW$598, DW_AT_TI_symbol_name("y")
	.dwattr $C$DW$598, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
	.dwattr $C$DW$598, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$598, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$598, DW_AT_decl_line(0x88)
	.dwattr $C$DW$598, DW_AT_decl_column(0x0e)
$C$DW$599	.dwtag  DW_TAG_member
	.dwattr $C$DW$599, DW_AT_type(*$C$DW$T$47)
	.dwattr $C$DW$599, DW_AT_name("radius")
	.dwattr $C$DW$599, DW_AT_TI_symbol_name("radius")
	.dwattr $C$DW$599, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
	.dwattr $C$DW$599, DW_AT_accessibility(DW_ACCESS_public)
	.dwattr $C$DW$599, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$599, DW_AT_decl_line(0x89)
	.dwattr $C$DW$599, DW_AT_decl_column(0x0e)
	.dwendtag $C$DW$T$71

	.dwattr $C$DW$T$71, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_blobAnalysis\c66\../VLIB_blobAnalysis_types.h")
	.dwattr $C$DW$T$71, DW_AT_decl_line(0x86)
	.dwattr $C$DW$T$71, DW_AT_decl_column(0x10)
