TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Thu Mar 19 12:44:01 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    2844                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    2845                    
    2846                    $C$DW$T$85      .dwtag  DW_TAG_enumeration_type
    2847                            .dwattr $C$DW$T$85, DW_AT_byte_size(0x04)
    2848                    $C$DW$230       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_OPT"), DW_AT_const_value(0x00)
    2849                            .dwattr $C$DW$230, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\../commo
    2850                            .dwattr $C$DW$230, DW_AT_decl_line(0x6a)
    2851                            .dwattr $C$DW$230, DW_AT_decl_column(0x05)
    2852                    $C$DW$231       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CN"), DW_AT_const_value(0x01)
    2853                            .dwattr $C$DW$231, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\../commo
    2854                            .dwattr $C$DW$231, DW_AT_decl_line(0x6b)
    2855                            .dwattr $C$DW$231, DW_AT_decl_column(0x05)
    2856                    $C$DW$232       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CNT"), DW_AT_const_value(0x02)
    2857                            .dwattr $C$DW$232, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\../commo
    2858                            .dwattr $C$DW$232, DW_AT_decl_line(0x6c)
    2859                            .dwattr $C$DW$232, DW_AT_decl_column(0x05)
    2860                            .dwendtag $C$DW$T$85
    2861                    
    2862                            .dwattr $C$DW$T$85, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\../comm
    2863                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x69)
    2864                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x06)
    2865                    
    2866                    $C$DW$T$86      .dwtag  DW_TAG_enumeration_type
    2867                            .dwattr $C$DW$T$86, DW_AT_byte_size(0x04)
    2868                    $C$DW$233       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    2869                            .dwattr $C$DW$233, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\../commo
    2870                            .dwattr $C$DW$233, DW_AT_decl_line(0x72)
    2871                            .dwattr $C$DW$233, DW_AT_decl_column(0x05)
    2872                    $C$DW$234       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    2873                            .dwattr $C$DW$234, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\../commo
    2874                            .dwattr $C$DW$234, DW_AT_decl_line(0x73)
    2875                            .dwattr $C$DW$234, DW_AT_decl_column(0x05)
    2876                            .dwendtag $C$DW$T$86
    2877                    
    2878                            .dwattr $C$DW$T$86, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\../comm
    2879                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x71)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   60

    2880                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x06)
    2881                    
    2882                    $C$DW$T$87      .dwtag  DW_TAG_enumeration_type
    2883                            .dwattr $C$DW$T$87, DW_AT_byte_size(0x04)
    2884                    $C$DW$235       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_FALSE"), DW_AT_const_value(0x00)
    2885                            .dwattr $C$DW$235, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    2886                            .dwattr $C$DW$235, DW_AT_decl_line(0x8f)
    2887                            .dwattr $C$DW$235, DW_AT_decl_column(0x05)
    2888                    $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_TRUE"), DW_AT_const_value(0x01)
    2889                            .dwattr $C$DW$236, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    2890                            .dwattr $C$DW$236, DW_AT_decl_line(0x90)
    2891                            .dwattr $C$DW$236, DW_AT_decl_column(0x05)
    2892                            .dwendtag $C$DW$T$87
    2893                    
    2894                            .dwattr $C$DW$T$87, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    2895                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x8e)
    2896                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x0e)
    2897                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("CORB_Bool")
    2898                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    2899                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    2900                            .dwattr $C$DW$T$88, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    2901                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x91)
    2902                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x02)
    2903                    
    2904                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2905                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x14)
    2906                    $C$DW$237       .dwtag  DW_TAG_member
    2907                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$19)
    2908                            .dwattr $C$DW$237, DW_AT_name("width")
    2909                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("width")
    2910                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2911                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2912                            .dwattr $C$DW$237, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    2913                            .dwattr $C$DW$237, DW_AT_decl_line(0xaa)
    2914                            .dwattr $C$DW$237, DW_AT_decl_column(0x0d)
    2915                    $C$DW$238       .dwtag  DW_TAG_member
    2916                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$19)
    2917                            .dwattr $C$DW$238, DW_AT_name("height")
    2918                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("height")
    2919                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2920                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2921                            .dwattr $C$DW$238, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    2922                            .dwattr $C$DW$238, DW_AT_decl_line(0xab)
    2923                            .dwattr $C$DW$238, DW_AT_decl_column(0x0d)
    2924                    $C$DW$239       .dwtag  DW_TAG_member
    2925                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$19)
    2926                            .dwattr $C$DW$239, DW_AT_name("marginPixels")
    2927                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("marginPixels")
    2928                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2929                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2930                            .dwattr $C$DW$239, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    2931                            .dwattr $C$DW$239, DW_AT_decl_line(0xac)
    2932                            .dwattr $C$DW$239, DW_AT_decl_column(0x0d)
    2933                    $C$DW$240       .dwtag  DW_TAG_member
    2934                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$20)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   61

    2935                            .dwattr $C$DW$240, DW_AT_name("fastDifferenceThreshold")
    2936                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    2937                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2938                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2939                            .dwattr $C$DW$240, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    2940                            .dwattr $C$DW$240, DW_AT_decl_line(0xae)
    2941                            .dwattr $C$DW$240, DW_AT_decl_column(0x0d)
    2942                    $C$DW$241       .dwtag  DW_TAG_member
    2943                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$19)
    2944                            .dwattr $C$DW$241, DW_AT_name("n_features_desired")
    2945                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("n_features_desired")
    2946                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2947                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2948                            .dwattr $C$DW$241, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    2949                            .dwattr $C$DW$241, DW_AT_decl_line(0xb2)
    2950                            .dwattr $C$DW$241, DW_AT_decl_column(0x0d)
    2951                            .dwendtag $C$DW$T$21
    2952                    
    2953                            .dwattr $C$DW$T$21, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    2954                            .dwattr $C$DW$T$21, DW_AT_decl_line(0xa9)
    2955                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    2956                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CORBParameters")
    2957                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$21)
    2958                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2959                            .dwattr $C$DW$T$67, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    2960                            .dwattr $C$DW$T$67, DW_AT_decl_line(0xb3)
    2961                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x02)
    2962                    $C$DW$T$68      .dwtag  DW_TAG_const_type
    2963                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    2964                    $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    2965                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2966                            .dwattr $C$DW$T$69, DW_AT_address_class(0x20)
    2967                    
    2968                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2969                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x5a008)
    2970                    $C$DW$242       .dwtag  DW_TAG_member
    2971                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$19)
    2972                            .dwattr $C$DW$242, DW_AT_name("octave")
    2973                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("octave")
    2974                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2975                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2976                            .dwattr $C$DW$242, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    2977                            .dwattr $C$DW$242, DW_AT_decl_line(0xb9)
    2978                            .dwattr $C$DW$242, DW_AT_decl_column(0x0d)
    2979                    $C$DW$243       .dwtag  DW_TAG_member
    2980                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$23)
    2981                            .dwattr $C$DW$243, DW_AT_name("relative_patterns")
    2982                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("relative_patterns")
    2983                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2984                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2985                            .dwattr $C$DW$243, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    2986                            .dwattr $C$DW$243, DW_AT_decl_line(0xbb)
    2987                            .dwattr $C$DW$243, DW_AT_decl_column(0x0d)
    2988                    $C$DW$244       .dwtag  DW_TAG_member
    2989                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$25)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   62

    2990                            .dwattr $C$DW$244, DW_AT_name("rotated_patterns")
    2991                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("rotated_patterns")
    2992                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c004]
    2993                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2994                            .dwattr $C$DW$244, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    2995                            .dwattr $C$DW$244, DW_AT_decl_line(0xbc)
    2996                            .dwattr $C$DW$244, DW_AT_decl_column(0x0d)
    2997                    $C$DW$245       .dwtag  DW_TAG_member
    2998                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2999                            .dwattr $C$DW$245, DW_AT_name("integralImageWidth")
    3000                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("integralImageWidth")
    3001                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a004]
    3002                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3003                            .dwattr $C$DW$245, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3004                            .dwattr $C$DW$245, DW_AT_decl_line(0xbd)
    3005                            .dwattr $C$DW$245, DW_AT_decl_column(0x0d)
    3006                            .dwendtag $C$DW$T$26
    3007                    
    3008                            .dwattr $C$DW$T$26, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    3009                            .dwattr $C$DW$T$26, DW_AT_decl_line(0xb8)
    3010                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    3011                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CORBPatterns")
    3012                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$26)
    3013                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3014                            .dwattr $C$DW$T$30, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    3015                            .dwattr $C$DW$T$30, DW_AT_decl_line(0xbe)
    3016                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x02)
    3017                    
    3018                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3019                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x400)
    3020                    $C$DW$246       .dwtag  DW_TAG_member
    3021                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$27)
    3022                            .dwattr $C$DW$246, DW_AT_name("orientation_horizontal_offsets")
    3023                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("orientation_horizontal_offsets")
    3024                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3025                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3026                            .dwattr $C$DW$246, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3027                            .dwattr $C$DW$246, DW_AT_decl_line(0xc4)
    3028                            .dwattr $C$DW$246, DW_AT_decl_column(0x0d)
    3029                    $C$DW$247       .dwtag  DW_TAG_member
    3030                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$27)
    3031                            .dwattr $C$DW$247, DW_AT_name("orientation_vertical_offsets")
    3032                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("orientation_vertical_offsets")
    3033                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
    3034                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3035                            .dwattr $C$DW$247, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3036                            .dwattr $C$DW$247, DW_AT_decl_line(0xc5)
    3037                            .dwattr $C$DW$247, DW_AT_decl_column(0x0d)
    3038                    $C$DW$248       .dwtag  DW_TAG_member
    3039                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$28)
    3040                            .dwattr $C$DW$248, DW_AT_name("u_max")
    3041                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("u_max")
    3042                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c0]
    3043                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3044                            .dwattr $C$DW$248, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   63

    3045                            .dwattr $C$DW$248, DW_AT_decl_line(0xc6)
    3046                            .dwattr $C$DW$248, DW_AT_decl_column(0x0d)
    3047                            .dwendtag $C$DW$T$29
    3048                    
    3049                            .dwattr $C$DW$T$29, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    3050                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xc3)
    3051                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3052                    $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOrientationOffsets")
    3053                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$29)
    3054                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3055                            .dwattr $C$DW$T$31, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    3056                            .dwattr $C$DW$T$31, DW_AT_decl_line(0xc7)
    3057                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x02)
    3058                    
    3059                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3060                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x5a420)
    3061                    $C$DW$249       .dwtag  DW_TAG_member
    3062                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$30)
    3063                            .dwattr $C$DW$249, DW_AT_name("patterns")
    3064                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("patterns")
    3065                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3066                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3067                            .dwattr $C$DW$249, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3068                            .dwattr $C$DW$249, DW_AT_decl_line(0xcd)
    3069                            .dwattr $C$DW$249, DW_AT_decl_column(0x1c)
    3070                    $C$DW$250       .dwtag  DW_TAG_member
    3071                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$31)
    3072                            .dwattr $C$DW$250, DW_AT_name("offsets")
    3073                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("offsets")
    3074                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a008]
    3075                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3076                            .dwattr $C$DW$250, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3077                            .dwattr $C$DW$250, DW_AT_decl_line(0xce)
    3078                            .dwattr $C$DW$250, DW_AT_decl_column(0x1c)
    3079                    $C$DW$251       .dwtag  DW_TAG_member
    3080                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$32)
    3081                            .dwattr $C$DW$251, DW_AT_name("image")
    3082                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("image")
    3083                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a408]
    3084                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3085                            .dwattr $C$DW$251, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3086                            .dwattr $C$DW$251, DW_AT_decl_line(0xcf)
    3087                            .dwattr $C$DW$251, DW_AT_decl_column(0x1c)
    3088                    $C$DW$252       .dwtag  DW_TAG_member
    3089                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$32)
    3090                            .dwattr $C$DW$252, DW_AT_name("prefimage")
    3091                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("prefimage")
    3092                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a40c]
    3093                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3094                            .dwattr $C$DW$252, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3095                            .dwattr $C$DW$252, DW_AT_decl_line(0xd0)
    3096                            .dwattr $C$DW$252, DW_AT_decl_column(0x1c)
    3097                    $C$DW$253       .dwtag  DW_TAG_member
    3098                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$34)
    3099                            .dwattr $C$DW$253, DW_AT_name("harrisImage")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   64

    3100                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("harrisImage")
    3101                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a410]
    3102                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3103                            .dwattr $C$DW$253, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3104                            .dwattr $C$DW$253, DW_AT_decl_line(0xd1)
    3105                            .dwattr $C$DW$253, DW_AT_decl_column(0x1c)
    3106                    $C$DW$254       .dwtag  DW_TAG_member
    3107                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$36)
    3108                            .dwattr $C$DW$254, DW_AT_name("integralImage")
    3109                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("integralImage")
    3110                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a414]
    3111                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3112                            .dwattr $C$DW$254, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3113                            .dwattr $C$DW$254, DW_AT_decl_line(0xd2)
    3114                            .dwattr $C$DW$254, DW_AT_decl_column(0x1c)
    3115                    $C$DW$255       .dwtag  DW_TAG_member
    3116                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$38)
    3117                            .dwattr $C$DW$255, DW_AT_name("scratchBuffer")
    3118                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("scratchBuffer")
    3119                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a418]
    3120                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3121                            .dwattr $C$DW$255, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3122                            .dwattr $C$DW$255, DW_AT_decl_line(0xd3)
    3123                            .dwattr $C$DW$255, DW_AT_decl_column(0x1c)
    3124                    $C$DW$256       .dwtag  DW_TAG_member
    3125                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$40)
    3126                            .dwattr $C$DW$256, DW_AT_name("orbPattern31")
    3127                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("orbPattern31")
    3128                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a41c]
    3129                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3130                            .dwattr $C$DW$256, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3131                            .dwattr $C$DW$256, DW_AT_decl_line(0xd4)
    3132                            .dwattr $C$DW$256, DW_AT_decl_column(0x1c)
    3133                            .dwendtag $C$DW$T$41
    3134                    
    3135                            .dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    3136                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xcc)
    3137                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3138                    $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CORBInput")
    3139                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$41)
    3140                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3141                            .dwattr $C$DW$T$70, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    3142                            .dwattr $C$DW$T$70, DW_AT_decl_line(0xd5)
    3143                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x02)
    3144                    $C$DW$T$71      .dwtag  DW_TAG_const_type
    3145                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    3146                    $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    3147                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    3148                            .dwattr $C$DW$T$72, DW_AT_address_class(0x20)
    3149                    $C$DW$T$94      .dwtag  DW_TAG_pointer_type
    3150                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$70)
    3151                            .dwattr $C$DW$T$94, DW_AT_address_class(0x20)
    3152                    
    3153                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3154                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x38)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   65

    3155                    $C$DW$257       .dwtag  DW_TAG_member
    3156                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$19)
    3157                            .dwattr $C$DW$257, DW_AT_name("x")
    3158                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("x")
    3159                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3160                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3161                            .dwattr $C$DW$257, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3162                            .dwattr $C$DW$257, DW_AT_decl_line(0xdc)
    3163                            .dwattr $C$DW$257, DW_AT_decl_column(0x0d)
    3164                    $C$DW$258       .dwtag  DW_TAG_member
    3165                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$19)
    3166                            .dwattr $C$DW$258, DW_AT_name("y")
    3167                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("y")
    3168                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3169                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3170                            .dwattr $C$DW$258, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3171                            .dwattr $C$DW$258, DW_AT_decl_line(0xde)
    3172                            .dwattr $C$DW$258, DW_AT_decl_column(0x0d)
    3173                    $C$DW$259       .dwtag  DW_TAG_member
    3174                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$19)
    3175                            .dwattr $C$DW$259, DW_AT_name("octave")
    3176                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("octave")
    3177                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3178                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    3179                            .dwattr $C$DW$259, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3180                            .dwattr $C$DW$259, DW_AT_decl_line(0xe0)
    3181                            .dwattr $C$DW$259, DW_AT_decl_column(0x0d)
    3182                    $C$DW$260       .dwtag  DW_TAG_member
    3183                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$42)
    3184                            .dwattr $C$DW$260, DW_AT_name("angle")
    3185                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("angle")
    3186                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3187                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3188                            .dwattr $C$DW$260, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3189                            .dwattr $C$DW$260, DW_AT_decl_line(0xe3)
    3190                            .dwattr $C$DW$260, DW_AT_decl_column(0x0e)
    3191                    $C$DW$261       .dwtag  DW_TAG_member
    3192                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$19)
    3193                            .dwattr $C$DW$261, DW_AT_name("fastResponse")
    3194                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("fastResponse")
    3195                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3196                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3197                            .dwattr $C$DW$261, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3198                            .dwattr $C$DW$261, DW_AT_decl_line(0xe4)
    3199                            .dwattr $C$DW$261, DW_AT_decl_column(0x0e)
    3200                    $C$DW$262       .dwtag  DW_TAG_member
    3201                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$33)
    3202                            .dwattr $C$DW$262, DW_AT_name("harrisResponse")
    3203                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("harrisResponse")
    3204                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3205                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3206                            .dwattr $C$DW$262, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3207                            .dwattr $C$DW$262, DW_AT_decl_line(0xe5)
    3208                            .dwattr $C$DW$262, DW_AT_decl_column(0x0e)
    3209                    $C$DW$263       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   66

    3210                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$43)
    3211                            .dwattr $C$DW$263, DW_AT_name("descriptor")
    3212                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("descriptor")
    3213                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3214                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3215                            .dwattr $C$DW$263, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3216                            .dwattr $C$DW$263, DW_AT_decl_line(0xe6)
    3217                            .dwattr $C$DW$263, DW_AT_decl_column(0x0e)
    3218                            .dwendtag $C$DW$T$44
    3219                    
    3220                            .dwattr $C$DW$T$44, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    3221                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xdb)
    3222                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    3223                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CORBFeature")
    3224                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    3225                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3226                            .dwattr $C$DW$T$45, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    3227                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xe7)
    3228                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x02)
    3229                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3230                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3231                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3232                    $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    3233                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$44)
    3234                            .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
    3235                    
    3236                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3237                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x08)
    3238                    $C$DW$264       .dwtag  DW_TAG_member
    3239                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$46)
    3240                            .dwattr $C$DW$264, DW_AT_name("features")
    3241                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("features")
    3242                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3243                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3244                            .dwattr $C$DW$264, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3245                            .dwattr $C$DW$264, DW_AT_decl_line(0xed)
    3246                            .dwattr $C$DW$264, DW_AT_decl_column(0x12)
    3247                    $C$DW$265       .dwtag  DW_TAG_member
    3248                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3249                            .dwattr $C$DW$265, DW_AT_name("n_features")
    3250                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("n_features")
    3251                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3252                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3253                            .dwattr $C$DW$265, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3254                            .dwattr $C$DW$265, DW_AT_decl_line(0xee)
    3255                            .dwattr $C$DW$265, DW_AT_decl_column(0x12)
    3256                            .dwendtag $C$DW$T$47
    3257                    
    3258                            .dwattr $C$DW$T$47, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    3259                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xec)
    3260                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    3261                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOutput")
    3262                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$47)
    3263                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3264                            .dwattr $C$DW$T$73, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   67

    3265                            .dwattr $C$DW$T$73, DW_AT_decl_line(0xef)
    3266                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x02)
    3267                    $C$DW$T$74      .dwtag  DW_TAG_const_type
    3268                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    3269                    $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    3270                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    3271                            .dwattr $C$DW$T$75, DW_AT_address_class(0x20)
    3272                    $C$DW$T$77      .dwtag  DW_TAG_pointer_type
    3273                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$73)
    3274                            .dwattr $C$DW$T$77, DW_AT_address_class(0x20)
    3275                    
    3276                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3277                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x18)
    3278                    $C$DW$266       .dwtag  DW_TAG_member
    3279                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$20)
    3280                            .dwattr $C$DW$266, DW_AT_name("testPattern")
    3281                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("testPattern")
    3282                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3283                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3284                            .dwattr $C$DW$266, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\VLIB_ORB
    3285                            .dwattr $C$DW$266, DW_AT_decl_line(0x24)
    3286                            .dwattr $C$DW$266, DW_AT_decl_column(0x0f)
    3287                    $C$DW$267       .dwtag  DW_TAG_member
    3288                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$49)
    3289                            .dwattr $C$DW$267, DW_AT_name("staticInFeatures")
    3290                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("staticInFeatures")
    3291                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3292                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3293                            .dwattr $C$DW$267, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\VLIB_ORB
    3294                            .dwattr $C$DW$267, DW_AT_decl_line(0x25)
    3295                            .dwattr $C$DW$267, DW_AT_decl_column(0x0f)
    3296                    $C$DW$268       .dwtag  DW_TAG_member
    3297                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$34)
    3298                            .dwattr $C$DW$268, DW_AT_name("staticInHarris")
    3299                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("staticInHarris")
    3300                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3301                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3302                            .dwattr $C$DW$268, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\VLIB_ORB
    3303                            .dwattr $C$DW$268, DW_AT_decl_line(0x26)
    3304                            .dwattr $C$DW$268, DW_AT_decl_column(0x0f)
    3305                    $C$DW$269       .dwtag  DW_TAG_member
    3306                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$34)
    3307                            .dwattr $C$DW$269, DW_AT_name("staticOut")
    3308                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("staticOut")
    3309                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3310                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3311                            .dwattr $C$DW$269, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\VLIB_ORB
    3312                            .dwattr $C$DW$269, DW_AT_decl_line(0x27)
    3313                            .dwattr $C$DW$269, DW_AT_decl_column(0x0f)
    3314                    $C$DW$270       .dwtag  DW_TAG_member
    3315                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$48)
    3316                            .dwattr $C$DW$270, DW_AT_name("imageWidth")
    3317                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("imageWidth")
    3318                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3319                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   68

    3320                            .dwattr $C$DW$270, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\VLIB_ORB
    3321                            .dwattr $C$DW$270, DW_AT_decl_line(0x28)
    3322                            .dwattr $C$DW$270, DW_AT_decl_column(0x0f)
    3323                    $C$DW$271       .dwtag  DW_TAG_member
    3324                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$48)
    3325                            .dwattr $C$DW$271, DW_AT_name("imageHeight")
    3326                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("imageHeight")
    3327                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3328                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3329                            .dwattr $C$DW$271, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\VLIB_ORB
    3330                            .dwattr $C$DW$271, DW_AT_decl_line(0x29)
    3331                            .dwattr $C$DW$271, DW_AT_decl_column(0x0f)
    3332                    $C$DW$272       .dwtag  DW_TAG_member
    3333                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$35)
    3334                            .dwattr $C$DW$272, DW_AT_name("true_num_features")
    3335                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("true_num_features")
    3336                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3337                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3338                            .dwattr $C$DW$272, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\VLIB_ORB
    3339                            .dwattr $C$DW$272, DW_AT_decl_line(0x2a)
    3340                            .dwattr $C$DW$272, DW_AT_decl_column(0x0f)
    3341                            .dwendtag $C$DW$T$50
    3342                    
    3343                            .dwattr $C$DW$T$50, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\VLIB_OR
    3344                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x23)
    3345                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    3346                    $C$DW$T$98      .dwtag  DW_TAG_pointer_type
    3347                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$50)
    3348                            .dwattr $C$DW$T$98, DW_AT_address_class(0x20)
    3349                    $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("orb_getHarrisScore_testParams_t")
    3350                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$50)
    3351                            .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    3352                            .dwattr $C$DW$T$100, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\VLIB_O
    3353                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x2b)
    3354                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x03)
    3355                    $C$DW$T$101     .dwtag  DW_TAG_pointer_type
    3356                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$100)
    3357                            .dwattr $C$DW$T$101, DW_AT_address_class(0x20)
    3358                    $C$DW$T$102     .dwtag  DW_TAG_pointer_type
    3359                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$101)
    3360                            .dwattr $C$DW$T$102, DW_AT_address_class(0x20)
    3361                    
    3362                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3363                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x18)
    3364                    $C$DW$273       .dwtag  DW_TAG_member
    3365                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$10)
    3366                            .dwattr $C$DW$273, DW_AT_name("fd")
    3367                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("fd")
    3368                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3369                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3370                            .dwattr $C$DW$273, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3371                            .dwattr $C$DW$273, DW_AT_decl_line(0x49)
    3372                            .dwattr $C$DW$273, DW_AT_decl_column(0x0b)
    3373                    $C$DW$274       .dwtag  DW_TAG_member
    3374                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$51)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   69

    3375                            .dwattr $C$DW$274, DW_AT_name("buf")
    3376                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("buf")
    3377                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3378                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3379                            .dwattr $C$DW$274, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3380                            .dwattr $C$DW$274, DW_AT_decl_line(0x4a)
    3381                            .dwattr $C$DW$274, DW_AT_decl_column(0x16)
    3382                    $C$DW$275       .dwtag  DW_TAG_member
    3383                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$51)
    3384                            .dwattr $C$DW$275, DW_AT_name("pos")
    3385                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("pos")
    3386                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3387                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3388                            .dwattr $C$DW$275, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3389                            .dwattr $C$DW$275, DW_AT_decl_line(0x4b)
    3390                            .dwattr $C$DW$275, DW_AT_decl_column(0x16)
    3391                    $C$DW$276       .dwtag  DW_TAG_member
    3392                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$51)
    3393                            .dwattr $C$DW$276, DW_AT_name("bufend")
    3394                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("bufend")
    3395                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3396                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3397                            .dwattr $C$DW$276, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3398                            .dwattr $C$DW$276, DW_AT_decl_line(0x4c)
    3399                            .dwattr $C$DW$276, DW_AT_decl_column(0x16)
    3400                    $C$DW$277       .dwtag  DW_TAG_member
    3401                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$51)
    3402                            .dwattr $C$DW$277, DW_AT_name("buff_stop")
    3403                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("buff_stop")
    3404                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3405                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3406                            .dwattr $C$DW$277, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3407                            .dwattr $C$DW$277, DW_AT_decl_line(0x4d)
    3408                            .dwattr $C$DW$277, DW_AT_decl_column(0x16)
    3409                    $C$DW$278       .dwtag  DW_TAG_member
    3410                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$11)
    3411                            .dwattr $C$DW$278, DW_AT_name("flags")
    3412                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("flags")
    3413                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3414                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3415                            .dwattr $C$DW$278, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3416                            .dwattr $C$DW$278, DW_AT_decl_line(0x4e)
    3417                            .dwattr $C$DW$278, DW_AT_decl_column(0x16)
    3418                            .dwendtag $C$DW$T$52
    3419                    
    3420                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3421                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x48)
    3422                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    3423                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3424                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$52)
    3425                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    3426                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3427                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x4f)
    3428                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x03)
    3429                    
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   70

    3430                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3431                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x08)
    3432                    $C$DW$279       .dwtag  DW_TAG_member
    3433                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$10)
    3434                            .dwattr $C$DW$279, DW_AT_name("quot")
    3435                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("quot")
    3436                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3437                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3438                            .dwattr $C$DW$279, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3439                            .dwattr $C$DW$279, DW_AT_decl_line(0x3e)
    3440                            .dwattr $C$DW$279, DW_AT_decl_column(0x16)
    3441                    $C$DW$280       .dwtag  DW_TAG_member
    3442                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$10)
    3443                            .dwattr $C$DW$280, DW_AT_name("rem")
    3444                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("rem")
    3445                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3446                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3447                            .dwattr $C$DW$280, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3448                            .dwattr $C$DW$280, DW_AT_decl_line(0x3e)
    3449                            .dwattr $C$DW$280, DW_AT_decl_column(0x1c)
    3450                            .dwendtag $C$DW$T$53
    3451                    
    3452                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3453                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x3e)
    3454                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x10)
    3455                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3456                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$53)
    3457                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3458                            .dwattr $C$DW$T$104, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3459                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x3e)
    3460                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x23)
    3461                    
    3462                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3463                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x08)
    3464                    $C$DW$281       .dwtag  DW_TAG_member
    3465                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$10)
    3466                            .dwattr $C$DW$281, DW_AT_name("quot")
    3467                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("quot")
    3468                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3469                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3470                            .dwattr $C$DW$281, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3471                            .dwattr $C$DW$281, DW_AT_decl_line(0x40)
    3472                            .dwattr $C$DW$281, DW_AT_decl_column(0x17)
    3473                    $C$DW$282       .dwtag  DW_TAG_member
    3474                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$10)
    3475                            .dwattr $C$DW$282, DW_AT_name("rem")
    3476                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("rem")
    3477                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3478                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3479                            .dwattr $C$DW$282, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3480                            .dwattr $C$DW$282, DW_AT_decl_line(0x40)
    3481                            .dwattr $C$DW$282, DW_AT_decl_column(0x1d)
    3482                            .dwendtag $C$DW$T$54
    3483                    
    3484                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   71

    3485                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x40)
    3486                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x10)
    3487                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3488                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$54)
    3489                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    3490                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3491                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x40)
    3492                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x24)
    3493                    
    3494                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3495                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
    3496                    $C$DW$283       .dwtag  DW_TAG_member
    3497                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$14)
    3498                            .dwattr $C$DW$283, DW_AT_name("quot")
    3499                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("quot")
    3500                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3501                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3502                            .dwattr $C$DW$283, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3503                            .dwattr $C$DW$283, DW_AT_decl_line(0x43)
    3504                            .dwattr $C$DW$283, DW_AT_decl_column(0x1c)
    3505                    $C$DW$284       .dwtag  DW_TAG_member
    3506                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$14)
    3507                            .dwattr $C$DW$284, DW_AT_name("rem")
    3508                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("rem")
    3509                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3510                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3511                            .dwattr $C$DW$284, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3512                            .dwattr $C$DW$284, DW_AT_decl_line(0x43)
    3513                            .dwattr $C$DW$284, DW_AT_decl_column(0x22)
    3514                            .dwendtag $C$DW$T$55
    3515                    
    3516                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3517                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x43)
    3518                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    3519                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3520                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$55)
    3521                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    3522                            .dwattr $C$DW$T$106, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3523                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x43)
    3524                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x29)
    3525                    
    3526                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    3527                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x24)
    3528                    $C$DW$285       .dwtag  DW_TAG_member
    3529                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$19)
    3530                            .dwattr $C$DW$285, DW_AT_name("area")
    3531                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("area")
    3532                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3533                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3534                            .dwattr $C$DW$285, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3535                            .dwattr $C$DW$285, DW_AT_decl_line(0x69)
    3536                            .dwattr $C$DW$285, DW_AT_decl_column(0x0d)
    3537                    $C$DW$286       .dwtag  DW_TAG_member
    3538                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$19)
    3539                            .dwattr $C$DW$286, DW_AT_name("xsum")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   72

    3540                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("xsum")
    3541                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3542                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3543                            .dwattr $C$DW$286, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3544                            .dwattr $C$DW$286, DW_AT_decl_line(0x6a)
    3545                            .dwattr $C$DW$286, DW_AT_decl_column(0x0d)
    3546                    $C$DW$287       .dwtag  DW_TAG_member
    3547                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$19)
    3548                            .dwattr $C$DW$287, DW_AT_name("ysum")
    3549                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("ysum")
    3550                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3551                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3552                            .dwattr $C$DW$287, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3553                            .dwattr $C$DW$287, DW_AT_decl_line(0x6b)
    3554                            .dwattr $C$DW$287, DW_AT_decl_column(0x0d)
    3555                    $C$DW$288       .dwtag  DW_TAG_member
    3556                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    3557                            .dwattr $C$DW$288, DW_AT_name("xmin")
    3558                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("xmin")
    3559                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3560                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3561                            .dwattr $C$DW$288, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3562                            .dwattr $C$DW$288, DW_AT_decl_line(0x6d)
    3563                            .dwattr $C$DW$288, DW_AT_decl_column(0x0d)
    3564                    $C$DW$289       .dwtag  DW_TAG_member
    3565                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$19)
    3566                            .dwattr $C$DW$289, DW_AT_name("ymin")
    3567                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("ymin")
    3568                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3569                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3570                            .dwattr $C$DW$289, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3571                            .dwattr $C$DW$289, DW_AT_decl_line(0x6e)
    3572                            .dwattr $C$DW$289, DW_AT_decl_column(0x0d)
    3573                    $C$DW$290       .dwtag  DW_TAG_member
    3574                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$19)
    3575                            .dwattr $C$DW$290, DW_AT_name("xmax")
    3576                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("xmax")
    3577                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3578                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3579                            .dwattr $C$DW$290, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3580                            .dwattr $C$DW$290, DW_AT_decl_line(0x6f)
    3581                            .dwattr $C$DW$290, DW_AT_decl_column(0x0d)
    3582                    $C$DW$291       .dwtag  DW_TAG_member
    3583                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$19)
    3584                            .dwattr $C$DW$291, DW_AT_name("ymax")
    3585                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("ymax")
    3586                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3587                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3588                            .dwattr $C$DW$291, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3589                            .dwattr $C$DW$291, DW_AT_decl_line(0x70)
    3590                            .dwattr $C$DW$291, DW_AT_decl_column(0x0d)
    3591                    $C$DW$292       .dwtag  DW_TAG_member
    3592                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$19)
    3593                            .dwattr $C$DW$292, DW_AT_name("seedx")
    3594                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("seedx")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   73

    3595                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3596                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3597                            .dwattr $C$DW$292, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3598                            .dwattr $C$DW$292, DW_AT_decl_line(0x72)
    3599                            .dwattr $C$DW$292, DW_AT_decl_column(0x0d)
    3600                    $C$DW$293       .dwtag  DW_TAG_member
    3601                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
    3602                            .dwattr $C$DW$293, DW_AT_name("seedy")
    3603                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("seedy")
    3604                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3605                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3606                            .dwattr $C$DW$293, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\commo
    3607                            .dwattr $C$DW$293, DW_AT_decl_line(0x73)
    3608                            .dwattr $C$DW$293, DW_AT_decl_column(0x0d)
    3609                            .dwendtag $C$DW$T$56
    3610                    
    3611                            .dwattr $C$DW$T$56, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\comm
    3612                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x68)
    3613                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    3614                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    3615                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$56)
    3616                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    3617                            .dwattr $C$DW$T$107, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\com
    3618                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x75)
    3619                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x03)
    3620                    
    3621                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3622                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    3623                    $C$DW$294       .dwtag  DW_TAG_member
    3624                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$8)
    3625                            .dwattr $C$DW$294, DW_AT_name("daylight")
    3626                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("daylight")
    3627                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3628                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3629                            .dwattr $C$DW$294, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3630                            .dwattr $C$DW$294, DW_AT_decl_line(0x52)
    3631                            .dwattr $C$DW$294, DW_AT_decl_column(0x0b)
    3632                    $C$DW$295       .dwtag  DW_TAG_member
    3633                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$10)
    3634                            .dwattr $C$DW$295, DW_AT_name("timezone")
    3635                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("timezone")
    3636                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3637                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3638                            .dwattr $C$DW$295, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3639                            .dwattr $C$DW$295, DW_AT_decl_line(0x53)
    3640                            .dwattr $C$DW$295, DW_AT_decl_column(0x0b)
    3641                    $C$DW$296       .dwtag  DW_TAG_member
    3642                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$57)
    3643                            .dwattr $C$DW$296, DW_AT_name("tzname")
    3644                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("tzname")
    3645                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3646                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3647                            .dwattr $C$DW$296, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3648                            .dwattr $C$DW$296, DW_AT_decl_line(0x54)
    3649                            .dwattr $C$DW$296, DW_AT_decl_column(0x0b)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   74

    3650                    $C$DW$297       .dwtag  DW_TAG_member
    3651                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$57)
    3652                            .dwattr $C$DW$297, DW_AT_name("dstname")
    3653                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("dstname")
    3654                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3655                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3656                            .dwattr $C$DW$297, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3657                            .dwattr $C$DW$297, DW_AT_decl_line(0x55)
    3658                            .dwattr $C$DW$297, DW_AT_decl_column(0x0b)
    3659                            .dwendtag $C$DW$T$58
    3660                    
    3661                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3662                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x51)
    3663                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    3664                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    3665                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$58)
    3666                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    3667                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3668                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x56)
    3669                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x03)
    3670                    
    3671                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3672                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x20)
    3673                    $C$DW$298       .dwtag  DW_TAG_member
    3674                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$60)
    3675                            .dwattr $C$DW$298, DW_AT_name("val")
    3676                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("val")
    3677                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3678                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3679                            .dwattr $C$DW$298, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\../commo
    3680                            .dwattr $C$DW$298, DW_AT_decl_line(0x25)
    3681                            .dwattr $C$DW$298, DW_AT_decl_column(0x0c)
    3682                            .dwendtag $C$DW$T$61
    3683                    
    3684                            .dwattr $C$DW$T$61, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\../comm
    3685                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x24)
    3686                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x10)
    3687                    $C$DW$T$109     .dwtag  DW_TAG_typedef, DW_AT_name("RotationMatrix")
    3688                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$61)
    3689                            .dwattr $C$DW$T$109, DW_AT_language(DW_LANG_C)
    3690                            .dwattr $C$DW$T$109, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\../com
    3691                            .dwattr $C$DW$T$109, DW_AT_decl_line(0x26)
    3692                            .dwattr $C$DW$T$109, DW_AT_decl_column(0x02)
    3693                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3694                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3695                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3696                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3697                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3698                    $C$DW$T$110     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    3699                            .dwattr $C$DW$T$110, DW_AT_type(*$C$DW$T$3)
    3700                            .dwattr $C$DW$T$110, DW_AT_language(DW_LANG_C)
    3701                            .dwattr $C$DW$T$110, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\com
    3702                            .dwattr $C$DW$T$110, DW_AT_decl_line(0x5c)
    3703                            .dwattr $C$DW$T$110, DW_AT_decl_column(0x19)
    3704                    $C$DW$T$4       .dwtag  DW_TAG_base_type
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   75

    3705                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3706                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3707                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3708                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3709                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3710                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3711                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3712                    $C$DW$T$135     .dwtag  DW_TAG_pointer_type
    3713                            .dwattr $C$DW$T$135, DW_AT_type(*$C$DW$T$5)
    3714                            .dwattr $C$DW$T$135, DW_AT_address_class(0x20)
    3715                    $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    3716                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$5)
    3717                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3718                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3719                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x2a)
    3720                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x1d)
    3721                    $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3722                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    3723                            .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3724                    $C$DW$T$147     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    3725                            .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$39)
    3726                            .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
    3727                            .dwattr $C$DW$T$147, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3728                            .dwattr $C$DW$T$147, DW_AT_decl_line(0x39)
    3729                            .dwattr $C$DW$T$147, DW_AT_decl_column(0x17)
    3730                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3731                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3732                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3733                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3734                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3735                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$6)
    3736                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    3737                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    3738                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    3739                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    3740                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3741                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x2b)
    3742                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x1c)
    3743                    $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3744                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$20)
    3745                            .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    3746                    
    3747                    $C$DW$T$43      .dwtag  DW_TAG_array_type
    3748                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$20)
    3749                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3750                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x20)
    3751                    $C$DW$299       .dwtag  DW_TAG_subrange_type
    3752                            .dwattr $C$DW$299, DW_AT_upper_bound(0x1f)
    3753                            .dwendtag $C$DW$T$43
    3754                    
    3755                    $C$DW$T$149     .dwtag  DW_TAG_const_type
    3756                            .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$20)
    3757                    $C$DW$T$150     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    3758                            .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$20)
    3759                            .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   76

    3760                            .dwattr $C$DW$T$150, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3761                            .dwattr $C$DW$T$150, DW_AT_decl_line(0x3a)
    3762                            .dwattr $C$DW$T$150, DW_AT_decl_column(0x16)
    3763                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3764                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3765                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3766                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3767                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3768                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3769                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3770                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3771                    $C$DW$T$151     .dwtag  DW_TAG_pointer_type
    3772                            .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$8)
    3773                            .dwattr $C$DW$T$151, DW_AT_address_class(0x20)
    3774                    $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3775                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$8)
    3776                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3777                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3778                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x2c)
    3779                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x1d)
    3780                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3781                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    3782                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    3783                    $C$DW$T$152     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    3784                            .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$33)
    3785                            .dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
    3786                            .dwattr $C$DW$T$152, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3787                            .dwattr $C$DW$T$152, DW_AT_decl_line(0x3c)
    3788                            .dwattr $C$DW$T$152, DW_AT_decl_column(0x17)
    3789                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3790                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3791                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3792                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3793                    $C$DW$T$153     .dwtag  DW_TAG_pointer_type
    3794                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$9)
    3795                            .dwattr $C$DW$T$153, DW_AT_address_class(0x20)
    3796                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3797                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$9)
    3798                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3799                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3800                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2d)
    3801                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x1c)
    3802                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    3803                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3804                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    3805                    $C$DW$T$155     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    3806                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$48)
    3807                            .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    3808                            .dwattr $C$DW$T$155, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3809                            .dwattr $C$DW$T$155, DW_AT_decl_line(0x3d)
    3810                            .dwattr $C$DW$T$155, DW_AT_decl_column(0x16)
    3811                    $C$DW$T$154     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3812                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$9)
    3813                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    3814                            .dwattr $C$DW$T$154, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   77

    3815                            .dwattr $C$DW$T$154, DW_AT_decl_line(0x53)
    3816                            .dwattr $C$DW$T$154, DW_AT_decl_column(0x1a)
    3817                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3818                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3819                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3820                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3821                    $C$DW$T$171     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    3822                            .dwattr $C$DW$T$171, DW_AT_type(*$C$DW$T$10)
    3823                            .dwattr $C$DW$T$171, DW_AT_language(DW_LANG_C)
    3824                            .dwattr $C$DW$T$171, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3825                            .dwattr $C$DW$T$171, DW_AT_decl_line(0x53)
    3826                            .dwattr $C$DW$T$171, DW_AT_decl_column(0x0d)
    3827                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3828                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$10)
    3829                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    3830                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3831                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2e)
    3832                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1d)
    3833                    $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    3834                            .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$19)
    3835                            .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    3836                            .dwattr $C$DW$T$165, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_getHarrisScore\..\com
    3837                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x77)
    3838                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x11)
    3839                    
    3840                    $C$DW$T$22      .dwtag  DW_TAG_array_type
    3841                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$19)
    3842                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    3843                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x2000)
    3844                    $C$DW$300       .dwtag  DW_TAG_subrange_type
    3845                            .dwattr $C$DW$300, DW_AT_upper_bound(0x7ff)
    3846                            .dwendtag $C$DW$T$22
    3847                    
    3848                    
    3849                    $C$DW$T$23      .dwtag  DW_TAG_array_type
    3850                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$19)
    3851                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3852                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x3c000)
    3853                    $C$DW$301       .dwtag  DW_TAG_subrange_type
    3854                            .dwattr $C$DW$301, DW_AT_upper_bound(0x1d)
    3855                    $C$DW$302       .dwtag  DW_TAG_subrange_type
    3856                            .dwattr $C$DW$302, DW_AT_upper_bound(0x7ff)
    3857                            .dwendtag $C$DW$T$23
    3858                    
    3859                    
    3860                    $C$DW$T$24      .dwtag  DW_TAG_array_type
    3861                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$19)
    3862                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    3863                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x1000)
    3864                    $C$DW$303       .dwtag  DW_TAG_subrange_type
    3865                            .dwattr $C$DW$303, DW_AT_upper_bound(0x3ff)
    3866                            .dwendtag $C$DW$T$24
    3867                    
    3868                    
    3869                    $C$DW$T$25      .dwtag  DW_TAG_array_type
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   78

    3870                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$19)
    3871                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    3872                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x1e000)
    3873                    $C$DW$304       .dwtag  DW_TAG_subrange_type
    3874                            .dwattr $C$DW$304, DW_AT_upper_bound(0x1d)
    3875                    $C$DW$305       .dwtag  DW_TAG_subrange_type
    3876                            .dwattr $C$DW$305, DW_AT_upper_bound(0x3ff)
    3877                            .dwendtag $C$DW$T$25
    3878                    
    3879                    
    3880                    $C$DW$T$27      .dwtag  DW_TAG_array_type
    3881                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$19)
    3882                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3883                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x1e0)
    3884                    $C$DW$306       .dwtag  DW_TAG_subrange_type
    3885                            .dwattr $C$DW$306, DW_AT_upper_bound(0x77)
    3886                            .dwendtag $C$DW$T$27
    3887                    
    3888                    
    3889                    $C$DW$T$28      .dwtag  DW_TAG_array_type
    3890                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$19)
    3891                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3892                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x40)
    3893                    $C$DW$307       .dwtag  DW_TAG_subrange_type
    3894                            .dwattr $C$DW$307, DW_AT_upper_bound(0x0f)
    3895                            .dwendtag $C$DW$T$28
    3896                    
    3897                    
    3898                    $C$DW$T$62      .dwtag  DW_TAG_array_type
    3899                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$19)
    3900                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3901                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x10)
    3902                    $C$DW$308       .dwtag  DW_TAG_subrange_type
    3903                            .dwattr $C$DW$308, DW_AT_upper_bound(0x03)
    3904                            .dwendtag $C$DW$T$62
    3905                    
    3906                    $C$DW$T$131     .dwtag  DW_TAG_pointer_type
    3907                            .dwattr $C$DW$T$131, DW_AT_type(*$C$DW$T$19)
    3908                            .dwattr $C$DW$T$131, DW_AT_address_class(0x20)
    3909                    $C$DW$T$166     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    3910                            .dwattr $C$DW$T$166, DW_AT_type(*$C$DW$T$19)
    3911                            .dwattr $C$DW$T$166, DW_AT_language(DW_LANG_C)
    3912                            .dwattr $C$DW$T$166, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3913                            .dwattr $C$DW$T$166, DW_AT_decl_line(0x4b)
    3914                            .dwattr $C$DW$T$166, DW_AT_decl_column(0x17)
    3915                    $C$DW$T$167     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    3916                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$19)
    3917                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    3918                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3919                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x4e)
    3920                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x17)
    3921                    $C$DW$T$168     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    3922                            .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$19)
    3923                            .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    3924                            .dwattr $C$DW$T$168, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:02 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_getHarrisScore/VLIB_ORB_getHarrisScore_d.se66 PAGE   79

    3925                            .dwattr $C$DW$T$168, DW_AT_decl_line(0x49)
    3926                            .dwattr $C$DW$T$168, DW_AT_decl_column(0x17)
    3927                    $C$DW$T$169     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    3928                            .dwattr $C$DW$T$169, DW_AT_type(*$C$DW$T$19)
    3929                            .dwattr $C$DW$T$169, DW_AT_language(DW_LANG_C)
    3930                            .dwattr $C$DW$T$169, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3931                            .dwattr $C$DW$T$169, DW_AT_decl_line(0x3e)
    3932                            .dwattr $C$DW$T$169, DW_AT_decl_column(0x17)
    3933                    $C$DW$T$170     .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    3934                            .dwattr $C$DW$T$170, DW_AT_type(*$C$DW$T$10)
    3935                            .dwattr $C$DW$T$170, DW_AT_language(DW_LANG_C)
    3936                            .dwattr $C$DW$T$170, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3937                            .dwattr $C$DW$T$170, DW_AT_decl_line(0x58)
    3938                            .dwattr $C$DW$T$170, DW_AT_decl_column(0x1a)
