TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Thu Mar 19 12:44:25 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    2338                    $C$DW$T$65      .dwtag  DW_TAG_enumeration_type
    2339                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x04)
    2340                    $C$DW$210       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    2341                            .dwattr $C$DW$210, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\../comm
    2342                            .dwattr $C$DW$210, DW_AT_decl_line(0x72)
    2343                            .dwattr $C$DW$210, DW_AT_decl_column(0x05)
    2344                    $C$DW$211       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    2345                            .dwattr $C$DW$211, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\../comm
    2346                            .dwattr $C$DW$211, DW_AT_decl_line(0x73)
    2347                            .dwattr $C$DW$211, DW_AT_decl_column(0x05)
    2348                            .dwendtag $C$DW$T$65
    2349                    
    2350                            .dwattr $C$DW$T$65, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\../com
    2351                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x71)
    2352                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x06)
    2353                    
    2354                    $C$DW$T$66      .dwtag  DW_TAG_enumeration_type
    2355                            .dwattr $C$DW$T$66, DW_AT_byte_size(0x04)
    2356                    $C$DW$212       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_FALSE"), DW_AT_const_value(0x00)
    2357                            .dwattr $C$DW$212, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2358                            .dwattr $C$DW$212, DW_AT_decl_line(0x8f)
    2359                            .dwattr $C$DW$212, DW_AT_decl_column(0x05)
    2360                    $C$DW$213       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_TRUE"), DW_AT_const_value(0x01)
    2361                            .dwattr $C$DW$213, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2362                            .dwattr $C$DW$213, DW_AT_decl_line(0x90)
    2363                            .dwattr $C$DW$213, DW_AT_decl_column(0x05)
    2364                            .dwendtag $C$DW$T$66
    2365                    
    2366                            .dwattr $C$DW$T$66, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2367                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x8e)
    2368                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x0e)
    2369                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CORB_Bool")
    2370                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$66)
    2371                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    2372                            .dwattr $C$DW$T$67, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2373                            .dwattr $C$DW$T$67, DW_AT_decl_line(0x91)
    2374                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x02)
    2375                    
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   52

    2376                    $C$DW$T$68      .dwtag  DW_TAG_enumeration_type
    2377                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x04)
    2378                    $C$DW$214       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_OK"), DW_AT_const_value(0x00)
    2379                            .dwattr $C$DW$214, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2380                            .dwattr $C$DW$214, DW_AT_decl_line(0xa2)
    2381                            .dwattr $C$DW$214, DW_AT_decl_column(0x05)
    2382                    $C$DW$215       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_FAIL"), DW_AT_const_value(-1)
    2383                            .dwattr $C$DW$215, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2384                            .dwattr $C$DW$215, DW_AT_decl_line(0xa3)
    2385                            .dwattr $C$DW$215, DW_AT_decl_column(0x05)
    2386                            .dwendtag $C$DW$T$68
    2387                    
    2388                            .dwattr $C$DW$T$68, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2389                            .dwattr $C$DW$T$68, DW_AT_decl_line(0xa1)
    2390                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x0e)
    2391                    $C$DW$T$69      .dwtag  DW_TAG_typedef, DW_AT_name("CORBResult")
    2392                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    2393                            .dwattr $C$DW$T$69, DW_AT_language(DW_LANG_C)
    2394                            .dwattr $C$DW$T$69, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2395                            .dwattr $C$DW$T$69, DW_AT_decl_line(0xa4)
    2396                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x02)
    2397                    
    2398                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    2399                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x20)
    2400                    $C$DW$216       .dwtag  DW_TAG_member
    2401                            .dwattr $C$DW$216, DW_AT_type(*$C$DW$T$19)
    2402                            .dwattr $C$DW$216, DW_AT_name("testPattern")
    2403                            .dwattr $C$DW$216, DW_AT_TI_symbol_name("testPattern")
    2404                            .dwattr $C$DW$216, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2405                            .dwattr $C$DW$216, DW_AT_accessibility(DW_ACCESS_public)
    2406                            .dwattr $C$DW$216, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2407                            .dwattr $C$DW$216, DW_AT_decl_line(0x24)
    2408                            .dwattr $C$DW$216, DW_AT_decl_column(0x0f)
    2409                    $C$DW$217       .dwtag  DW_TAG_member
    2410                            .dwattr $C$DW$217, DW_AT_type(*$C$DW$T$20)
    2411                            .dwattr $C$DW$217, DW_AT_name("staticIn")
    2412                            .dwattr $C$DW$217, DW_AT_TI_symbol_name("staticIn")
    2413                            .dwattr $C$DW$217, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2414                            .dwattr $C$DW$217, DW_AT_accessibility(DW_ACCESS_public)
    2415                            .dwattr $C$DW$217, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2416                            .dwattr $C$DW$217, DW_AT_decl_line(0x25)
    2417                            .dwattr $C$DW$217, DW_AT_decl_column(0x0f)
    2418                    $C$DW$218       .dwtag  DW_TAG_member
    2419                            .dwattr $C$DW$218, DW_AT_type(*$C$DW$T$22)
    2420                            .dwattr $C$DW$218, DW_AT_name("staticInFeatures")
    2421                            .dwattr $C$DW$218, DW_AT_TI_symbol_name("staticInFeatures")
    2422                            .dwattr $C$DW$218, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2423                            .dwattr $C$DW$218, DW_AT_accessibility(DW_ACCESS_public)
    2424                            .dwattr $C$DW$218, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2425                            .dwattr $C$DW$218, DW_AT_decl_line(0x26)
    2426                            .dwattr $C$DW$218, DW_AT_decl_column(0x0f)
    2427                    $C$DW$219       .dwtag  DW_TAG_member
    2428                            .dwattr $C$DW$219, DW_AT_type(*$C$DW$T$22)
    2429                            .dwattr $C$DW$219, DW_AT_name("staticOut")
    2430                            .dwattr $C$DW$219, DW_AT_TI_symbol_name("staticOut")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   53

    2431                            .dwattr $C$DW$219, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2432                            .dwattr $C$DW$219, DW_AT_accessibility(DW_ACCESS_public)
    2433                            .dwattr $C$DW$219, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2434                            .dwattr $C$DW$219, DW_AT_decl_line(0x27)
    2435                            .dwattr $C$DW$219, DW_AT_decl_column(0x0f)
    2436                    $C$DW$220       .dwtag  DW_TAG_member
    2437                            .dwattr $C$DW$220, DW_AT_type(*$C$DW$T$21)
    2438                            .dwattr $C$DW$220, DW_AT_name("imageWidth")
    2439                            .dwattr $C$DW$220, DW_AT_TI_symbol_name("imageWidth")
    2440                            .dwattr $C$DW$220, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2441                            .dwattr $C$DW$220, DW_AT_accessibility(DW_ACCESS_public)
    2442                            .dwattr $C$DW$220, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2443                            .dwattr $C$DW$220, DW_AT_decl_line(0x28)
    2444                            .dwattr $C$DW$220, DW_AT_decl_column(0x0f)
    2445                    $C$DW$221       .dwtag  DW_TAG_member
    2446                            .dwattr $C$DW$221, DW_AT_type(*$C$DW$T$21)
    2447                            .dwattr $C$DW$221, DW_AT_name("imageHeight")
    2448                            .dwattr $C$DW$221, DW_AT_TI_symbol_name("imageHeight")
    2449                            .dwattr $C$DW$221, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    2450                            .dwattr $C$DW$221, DW_AT_accessibility(DW_ACCESS_public)
    2451                            .dwattr $C$DW$221, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2452                            .dwattr $C$DW$221, DW_AT_decl_line(0x29)
    2453                            .dwattr $C$DW$221, DW_AT_decl_column(0x0f)
    2454                    $C$DW$222       .dwtag  DW_TAG_member
    2455                            .dwattr $C$DW$222, DW_AT_type(*$C$DW$T$23)
    2456                            .dwattr $C$DW$222, DW_AT_name("true_num_features")
    2457                            .dwattr $C$DW$222, DW_AT_TI_symbol_name("true_num_features")
    2458                            .dwattr $C$DW$222, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2459                            .dwattr $C$DW$222, DW_AT_accessibility(DW_ACCESS_public)
    2460                            .dwattr $C$DW$222, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2461                            .dwattr $C$DW$222, DW_AT_decl_line(0x2a)
    2462                            .dwattr $C$DW$222, DW_AT_decl_column(0x0f)
    2463                    $C$DW$223       .dwtag  DW_TAG_member
    2464                            .dwattr $C$DW$223, DW_AT_type(*$C$DW$T$19)
    2465                            .dwattr $C$DW$223, DW_AT_name("fastDifferenceThreshold")
    2466                            .dwattr $C$DW$223, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    2467                            .dwattr $C$DW$223, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2468                            .dwattr $C$DW$223, DW_AT_accessibility(DW_ACCESS_public)
    2469                            .dwattr $C$DW$223, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2470                            .dwattr $C$DW$223, DW_AT_decl_line(0x2b)
    2471                            .dwattr $C$DW$223, DW_AT_decl_column(0x0f)
    2472                    $C$DW$224       .dwtag  DW_TAG_member
    2473                            .dwattr $C$DW$224, DW_AT_type(*$C$DW$T$25)
    2474                            .dwattr $C$DW$224, DW_AT_name("desc")
    2475                            .dwattr $C$DW$224, DW_AT_TI_symbol_name("desc")
    2476                            .dwattr $C$DW$224, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2477                            .dwattr $C$DW$224, DW_AT_accessibility(DW_ACCESS_public)
    2478                            .dwattr $C$DW$224, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_or
    2479                            .dwattr $C$DW$224, DW_AT_decl_line(0x2c)
    2480                            .dwattr $C$DW$224, DW_AT_decl_column(0x0f)
    2481                            .dwendtag $C$DW$T$26
    2482                    
    2483                            .dwattr $C$DW$T$26, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_o
    2484                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x23)
    2485                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   54

    2486                    $C$DW$T$70      .dwtag  DW_TAG_pointer_type
    2487                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$26)
    2488                            .dwattr $C$DW$T$70, DW_AT_address_class(0x20)
    2489                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("originalfast9_score_testParams_t")
    2490                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$26)
    2491                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2492                            .dwattr $C$DW$T$72, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\VLIB_o
    2493                            .dwattr $C$DW$T$72, DW_AT_decl_line(0x2d)
    2494                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x03)
    2495                    $C$DW$T$73      .dwtag  DW_TAG_pointer_type
    2496                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    2497                            .dwattr $C$DW$T$73, DW_AT_address_class(0x20)
    2498                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    2499                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2500                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    2501                    
    2502                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
    2503                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x18)
    2504                    $C$DW$225       .dwtag  DW_TAG_member
    2505                            .dwattr $C$DW$225, DW_AT_type(*$C$DW$T$10)
    2506                            .dwattr $C$DW$225, DW_AT_name("fd")
    2507                            .dwattr $C$DW$225, DW_AT_TI_symbol_name("fd")
    2508                            .dwattr $C$DW$225, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2509                            .dwattr $C$DW$225, DW_AT_accessibility(DW_ACCESS_public)
    2510                            .dwattr $C$DW$225, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2511                            .dwattr $C$DW$225, DW_AT_decl_line(0x49)
    2512                            .dwattr $C$DW$225, DW_AT_decl_column(0x0b)
    2513                    $C$DW$226       .dwtag  DW_TAG_member
    2514                            .dwattr $C$DW$226, DW_AT_type(*$C$DW$T$27)
    2515                            .dwattr $C$DW$226, DW_AT_name("buf")
    2516                            .dwattr $C$DW$226, DW_AT_TI_symbol_name("buf")
    2517                            .dwattr $C$DW$226, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2518                            .dwattr $C$DW$226, DW_AT_accessibility(DW_ACCESS_public)
    2519                            .dwattr $C$DW$226, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2520                            .dwattr $C$DW$226, DW_AT_decl_line(0x4a)
    2521                            .dwattr $C$DW$226, DW_AT_decl_column(0x16)
    2522                    $C$DW$227       .dwtag  DW_TAG_member
    2523                            .dwattr $C$DW$227, DW_AT_type(*$C$DW$T$27)
    2524                            .dwattr $C$DW$227, DW_AT_name("pos")
    2525                            .dwattr $C$DW$227, DW_AT_TI_symbol_name("pos")
    2526                            .dwattr $C$DW$227, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2527                            .dwattr $C$DW$227, DW_AT_accessibility(DW_ACCESS_public)
    2528                            .dwattr $C$DW$227, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2529                            .dwattr $C$DW$227, DW_AT_decl_line(0x4b)
    2530                            .dwattr $C$DW$227, DW_AT_decl_column(0x16)
    2531                    $C$DW$228       .dwtag  DW_TAG_member
    2532                            .dwattr $C$DW$228, DW_AT_type(*$C$DW$T$27)
    2533                            .dwattr $C$DW$228, DW_AT_name("bufend")
    2534                            .dwattr $C$DW$228, DW_AT_TI_symbol_name("bufend")
    2535                            .dwattr $C$DW$228, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2536                            .dwattr $C$DW$228, DW_AT_accessibility(DW_ACCESS_public)
    2537                            .dwattr $C$DW$228, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2538                            .dwattr $C$DW$228, DW_AT_decl_line(0x4c)
    2539                            .dwattr $C$DW$228, DW_AT_decl_column(0x16)
    2540                    $C$DW$229       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   55

    2541                            .dwattr $C$DW$229, DW_AT_type(*$C$DW$T$27)
    2542                            .dwattr $C$DW$229, DW_AT_name("buff_stop")
    2543                            .dwattr $C$DW$229, DW_AT_TI_symbol_name("buff_stop")
    2544                            .dwattr $C$DW$229, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2545                            .dwattr $C$DW$229, DW_AT_accessibility(DW_ACCESS_public)
    2546                            .dwattr $C$DW$229, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2547                            .dwattr $C$DW$229, DW_AT_decl_line(0x4d)
    2548                            .dwattr $C$DW$229, DW_AT_decl_column(0x16)
    2549                    $C$DW$230       .dwtag  DW_TAG_member
    2550                            .dwattr $C$DW$230, DW_AT_type(*$C$DW$T$11)
    2551                            .dwattr $C$DW$230, DW_AT_name("flags")
    2552                            .dwattr $C$DW$230, DW_AT_TI_symbol_name("flags")
    2553                            .dwattr $C$DW$230, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2554                            .dwattr $C$DW$230, DW_AT_accessibility(DW_ACCESS_public)
    2555                            .dwattr $C$DW$230, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2556                            .dwattr $C$DW$230, DW_AT_decl_line(0x4e)
    2557                            .dwattr $C$DW$230, DW_AT_decl_column(0x16)
    2558                            .dwendtag $C$DW$T$28
    2559                    
    2560                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2561                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x48)
    2562                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
    2563                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    2564                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$28)
    2565                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    2566                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2567                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x4f)
    2568                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x03)
    2569                    
    2570                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2571                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
    2572                    $C$DW$231       .dwtag  DW_TAG_member
    2573                            .dwattr $C$DW$231, DW_AT_type(*$C$DW$T$10)
    2574                            .dwattr $C$DW$231, DW_AT_name("quot")
    2575                            .dwattr $C$DW$231, DW_AT_TI_symbol_name("quot")
    2576                            .dwattr $C$DW$231, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2577                            .dwattr $C$DW$231, DW_AT_accessibility(DW_ACCESS_public)
    2578                            .dwattr $C$DW$231, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2579                            .dwattr $C$DW$231, DW_AT_decl_line(0x3e)
    2580                            .dwattr $C$DW$231, DW_AT_decl_column(0x16)
    2581                    $C$DW$232       .dwtag  DW_TAG_member
    2582                            .dwattr $C$DW$232, DW_AT_type(*$C$DW$T$10)
    2583                            .dwattr $C$DW$232, DW_AT_name("rem")
    2584                            .dwattr $C$DW$232, DW_AT_TI_symbol_name("rem")
    2585                            .dwattr $C$DW$232, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2586                            .dwattr $C$DW$232, DW_AT_accessibility(DW_ACCESS_public)
    2587                            .dwattr $C$DW$232, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2588                            .dwattr $C$DW$232, DW_AT_decl_line(0x3e)
    2589                            .dwattr $C$DW$232, DW_AT_decl_column(0x1c)
    2590                            .dwendtag $C$DW$T$29
    2591                    
    2592                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2593                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3e)
    2594                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    2595                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   56

    2596                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$29)
    2597                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    2598                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2599                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3e)
    2600                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x23)
    2601                    
    2602                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    2603                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    2604                    $C$DW$233       .dwtag  DW_TAG_member
    2605                            .dwattr $C$DW$233, DW_AT_type(*$C$DW$T$10)
    2606                            .dwattr $C$DW$233, DW_AT_name("quot")
    2607                            .dwattr $C$DW$233, DW_AT_TI_symbol_name("quot")
    2608                            .dwattr $C$DW$233, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2609                            .dwattr $C$DW$233, DW_AT_accessibility(DW_ACCESS_public)
    2610                            .dwattr $C$DW$233, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2611                            .dwattr $C$DW$233, DW_AT_decl_line(0x40)
    2612                            .dwattr $C$DW$233, DW_AT_decl_column(0x17)
    2613                    $C$DW$234       .dwtag  DW_TAG_member
    2614                            .dwattr $C$DW$234, DW_AT_type(*$C$DW$T$10)
    2615                            .dwattr $C$DW$234, DW_AT_name("rem")
    2616                            .dwattr $C$DW$234, DW_AT_TI_symbol_name("rem")
    2617                            .dwattr $C$DW$234, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2618                            .dwattr $C$DW$234, DW_AT_accessibility(DW_ACCESS_public)
    2619                            .dwattr $C$DW$234, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2620                            .dwattr $C$DW$234, DW_AT_decl_line(0x40)
    2621                            .dwattr $C$DW$234, DW_AT_decl_column(0x1d)
    2622                            .dwendtag $C$DW$T$30
    2623                    
    2624                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2625                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x40)
    2626                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    2627                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    2628                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$30)
    2629                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    2630                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2631                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x40)
    2632                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x24)
    2633                    
    2634                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    2635                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x10)
    2636                    $C$DW$235       .dwtag  DW_TAG_member
    2637                            .dwattr $C$DW$235, DW_AT_type(*$C$DW$T$14)
    2638                            .dwattr $C$DW$235, DW_AT_name("quot")
    2639                            .dwattr $C$DW$235, DW_AT_TI_symbol_name("quot")
    2640                            .dwattr $C$DW$235, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2641                            .dwattr $C$DW$235, DW_AT_accessibility(DW_ACCESS_public)
    2642                            .dwattr $C$DW$235, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2643                            .dwattr $C$DW$235, DW_AT_decl_line(0x43)
    2644                            .dwattr $C$DW$235, DW_AT_decl_column(0x1c)
    2645                    $C$DW$236       .dwtag  DW_TAG_member
    2646                            .dwattr $C$DW$236, DW_AT_type(*$C$DW$T$14)
    2647                            .dwattr $C$DW$236, DW_AT_name("rem")
    2648                            .dwattr $C$DW$236, DW_AT_TI_symbol_name("rem")
    2649                            .dwattr $C$DW$236, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2650                            .dwattr $C$DW$236, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   57

    2651                            .dwattr $C$DW$236, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2652                            .dwattr $C$DW$236, DW_AT_decl_line(0x43)
    2653                            .dwattr $C$DW$236, DW_AT_decl_column(0x22)
    2654                            .dwendtag $C$DW$T$31
    2655                    
    2656                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2657                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x43)
    2658                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    2659                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    2660                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$31)
    2661                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    2662                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2663                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x43)
    2664                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x29)
    2665                    
    2666                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    2667                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x24)
    2668                    $C$DW$237       .dwtag  DW_TAG_member
    2669                            .dwattr $C$DW$237, DW_AT_type(*$C$DW$T$32)
    2670                            .dwattr $C$DW$237, DW_AT_name("area")
    2671                            .dwattr $C$DW$237, DW_AT_TI_symbol_name("area")
    2672                            .dwattr $C$DW$237, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2673                            .dwattr $C$DW$237, DW_AT_accessibility(DW_ACCESS_public)
    2674                            .dwattr $C$DW$237, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2675                            .dwattr $C$DW$237, DW_AT_decl_line(0x69)
    2676                            .dwattr $C$DW$237, DW_AT_decl_column(0x0d)
    2677                    $C$DW$238       .dwtag  DW_TAG_member
    2678                            .dwattr $C$DW$238, DW_AT_type(*$C$DW$T$32)
    2679                            .dwattr $C$DW$238, DW_AT_name("xsum")
    2680                            .dwattr $C$DW$238, DW_AT_TI_symbol_name("xsum")
    2681                            .dwattr $C$DW$238, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2682                            .dwattr $C$DW$238, DW_AT_accessibility(DW_ACCESS_public)
    2683                            .dwattr $C$DW$238, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2684                            .dwattr $C$DW$238, DW_AT_decl_line(0x6a)
    2685                            .dwattr $C$DW$238, DW_AT_decl_column(0x0d)
    2686                    $C$DW$239       .dwtag  DW_TAG_member
    2687                            .dwattr $C$DW$239, DW_AT_type(*$C$DW$T$32)
    2688                            .dwattr $C$DW$239, DW_AT_name("ysum")
    2689                            .dwattr $C$DW$239, DW_AT_TI_symbol_name("ysum")
    2690                            .dwattr $C$DW$239, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2691                            .dwattr $C$DW$239, DW_AT_accessibility(DW_ACCESS_public)
    2692                            .dwattr $C$DW$239, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2693                            .dwattr $C$DW$239, DW_AT_decl_line(0x6b)
    2694                            .dwattr $C$DW$239, DW_AT_decl_column(0x0d)
    2695                    $C$DW$240       .dwtag  DW_TAG_member
    2696                            .dwattr $C$DW$240, DW_AT_type(*$C$DW$T$32)
    2697                            .dwattr $C$DW$240, DW_AT_name("xmin")
    2698                            .dwattr $C$DW$240, DW_AT_TI_symbol_name("xmin")
    2699                            .dwattr $C$DW$240, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2700                            .dwattr $C$DW$240, DW_AT_accessibility(DW_ACCESS_public)
    2701                            .dwattr $C$DW$240, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2702                            .dwattr $C$DW$240, DW_AT_decl_line(0x6d)
    2703                            .dwattr $C$DW$240, DW_AT_decl_column(0x0d)
    2704                    $C$DW$241       .dwtag  DW_TAG_member
    2705                            .dwattr $C$DW$241, DW_AT_type(*$C$DW$T$32)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   58

    2706                            .dwattr $C$DW$241, DW_AT_name("ymin")
    2707                            .dwattr $C$DW$241, DW_AT_TI_symbol_name("ymin")
    2708                            .dwattr $C$DW$241, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2709                            .dwattr $C$DW$241, DW_AT_accessibility(DW_ACCESS_public)
    2710                            .dwattr $C$DW$241, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2711                            .dwattr $C$DW$241, DW_AT_decl_line(0x6e)
    2712                            .dwattr $C$DW$241, DW_AT_decl_column(0x0d)
    2713                    $C$DW$242       .dwtag  DW_TAG_member
    2714                            .dwattr $C$DW$242, DW_AT_type(*$C$DW$T$32)
    2715                            .dwattr $C$DW$242, DW_AT_name("xmax")
    2716                            .dwattr $C$DW$242, DW_AT_TI_symbol_name("xmax")
    2717                            .dwattr $C$DW$242, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2718                            .dwattr $C$DW$242, DW_AT_accessibility(DW_ACCESS_public)
    2719                            .dwattr $C$DW$242, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2720                            .dwattr $C$DW$242, DW_AT_decl_line(0x6f)
    2721                            .dwattr $C$DW$242, DW_AT_decl_column(0x0d)
    2722                    $C$DW$243       .dwtag  DW_TAG_member
    2723                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$32)
    2724                            .dwattr $C$DW$243, DW_AT_name("ymax")
    2725                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("ymax")
    2726                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2727                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2728                            .dwattr $C$DW$243, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2729                            .dwattr $C$DW$243, DW_AT_decl_line(0x70)
    2730                            .dwattr $C$DW$243, DW_AT_decl_column(0x0d)
    2731                    $C$DW$244       .dwtag  DW_TAG_member
    2732                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$32)
    2733                            .dwattr $C$DW$244, DW_AT_name("seedx")
    2734                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("seedx")
    2735                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2736                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2737                            .dwattr $C$DW$244, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2738                            .dwattr $C$DW$244, DW_AT_decl_line(0x72)
    2739                            .dwattr $C$DW$244, DW_AT_decl_column(0x0d)
    2740                    $C$DW$245       .dwtag  DW_TAG_member
    2741                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$32)
    2742                            .dwattr $C$DW$245, DW_AT_name("seedy")
    2743                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("seedy")
    2744                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2745                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    2746                            .dwattr $C$DW$245, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\comm
    2747                            .dwattr $C$DW$245, DW_AT_decl_line(0x73)
    2748                            .dwattr $C$DW$245, DW_AT_decl_column(0x0d)
    2749                            .dwendtag $C$DW$T$33
    2750                    
    2751                            .dwattr $C$DW$T$33, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\com
    2752                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x68)
    2753                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    2754                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    2755                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$33)
    2756                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    2757                            .dwattr $C$DW$T$79, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\com
    2758                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x75)
    2759                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    2760                    
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   59

    2761                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    2762                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    2763                    $C$DW$246       .dwtag  DW_TAG_member
    2764                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$8)
    2765                            .dwattr $C$DW$246, DW_AT_name("daylight")
    2766                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("daylight")
    2767                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2768                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    2769                            .dwattr $C$DW$246, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2770                            .dwattr $C$DW$246, DW_AT_decl_line(0x52)
    2771                            .dwattr $C$DW$246, DW_AT_decl_column(0x0b)
    2772                    $C$DW$247       .dwtag  DW_TAG_member
    2773                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$10)
    2774                            .dwattr $C$DW$247, DW_AT_name("timezone")
    2775                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("timezone")
    2776                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2777                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    2778                            .dwattr $C$DW$247, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2779                            .dwattr $C$DW$247, DW_AT_decl_line(0x53)
    2780                            .dwattr $C$DW$247, DW_AT_decl_column(0x0b)
    2781                    $C$DW$248       .dwtag  DW_TAG_member
    2782                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$34)
    2783                            .dwattr $C$DW$248, DW_AT_name("tzname")
    2784                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("tzname")
    2785                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2786                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    2787                            .dwattr $C$DW$248, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2788                            .dwattr $C$DW$248, DW_AT_decl_line(0x54)
    2789                            .dwattr $C$DW$248, DW_AT_decl_column(0x0b)
    2790                    $C$DW$249       .dwtag  DW_TAG_member
    2791                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$34)
    2792                            .dwattr $C$DW$249, DW_AT_name("dstname")
    2793                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("dstname")
    2794                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2795                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    2796                            .dwattr $C$DW$249, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2797                            .dwattr $C$DW$249, DW_AT_decl_line(0x55)
    2798                            .dwattr $C$DW$249, DW_AT_decl_column(0x0b)
    2799                            .dwendtag $C$DW$T$35
    2800                    
    2801                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2802                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x51)
    2803                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    2804                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    2805                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$35)
    2806                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    2807                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    2808                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x56)
    2809                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x03)
    2810                    
    2811                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    2812                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x14)
    2813                    $C$DW$250       .dwtag  DW_TAG_member
    2814                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$32)
    2815                            .dwattr $C$DW$250, DW_AT_name("width")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   60

    2816                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("width")
    2817                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2818                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2819                            .dwattr $C$DW$250, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2820                            .dwattr $C$DW$250, DW_AT_decl_line(0xaa)
    2821                            .dwattr $C$DW$250, DW_AT_decl_column(0x0d)
    2822                    $C$DW$251       .dwtag  DW_TAG_member
    2823                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$32)
    2824                            .dwattr $C$DW$251, DW_AT_name("height")
    2825                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("height")
    2826                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2827                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2828                            .dwattr $C$DW$251, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2829                            .dwattr $C$DW$251, DW_AT_decl_line(0xab)
    2830                            .dwattr $C$DW$251, DW_AT_decl_column(0x0d)
    2831                    $C$DW$252       .dwtag  DW_TAG_member
    2832                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$32)
    2833                            .dwattr $C$DW$252, DW_AT_name("marginPixels")
    2834                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("marginPixels")
    2835                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2836                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2837                            .dwattr $C$DW$252, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2838                            .dwattr $C$DW$252, DW_AT_decl_line(0xac)
    2839                            .dwattr $C$DW$252, DW_AT_decl_column(0x0d)
    2840                    $C$DW$253       .dwtag  DW_TAG_member
    2841                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$19)
    2842                            .dwattr $C$DW$253, DW_AT_name("fastDifferenceThreshold")
    2843                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    2844                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2845                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2846                            .dwattr $C$DW$253, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2847                            .dwattr $C$DW$253, DW_AT_decl_line(0xae)
    2848                            .dwattr $C$DW$253, DW_AT_decl_column(0x0d)
    2849                    $C$DW$254       .dwtag  DW_TAG_member
    2850                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$32)
    2851                            .dwattr $C$DW$254, DW_AT_name("n_features_desired")
    2852                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("n_features_desired")
    2853                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2854                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2855                            .dwattr $C$DW$254, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2856                            .dwattr $C$DW$254, DW_AT_decl_line(0xb2)
    2857                            .dwattr $C$DW$254, DW_AT_decl_column(0x0d)
    2858                            .dwendtag $C$DW$T$36
    2859                    
    2860                            .dwattr $C$DW$T$36, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2861                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xa9)
    2862                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    2863                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("CORBParameters")
    2864                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$36)
    2865                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    2866                            .dwattr $C$DW$T$81, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2867                            .dwattr $C$DW$T$81, DW_AT_decl_line(0xb3)
    2868                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x02)
    2869                    
    2870                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   61

    2871                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x5a008)
    2872                    $C$DW$255       .dwtag  DW_TAG_member
    2873                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$32)
    2874                            .dwattr $C$DW$255, DW_AT_name("octave")
    2875                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("octave")
    2876                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2877                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2878                            .dwattr $C$DW$255, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2879                            .dwattr $C$DW$255, DW_AT_decl_line(0xb9)
    2880                            .dwattr $C$DW$255, DW_AT_decl_column(0x0d)
    2881                    $C$DW$256       .dwtag  DW_TAG_member
    2882                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$38)
    2883                            .dwattr $C$DW$256, DW_AT_name("relative_patterns")
    2884                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("relative_patterns")
    2885                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2886                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2887                            .dwattr $C$DW$256, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2888                            .dwattr $C$DW$256, DW_AT_decl_line(0xbb)
    2889                            .dwattr $C$DW$256, DW_AT_decl_column(0x0d)
    2890                    $C$DW$257       .dwtag  DW_TAG_member
    2891                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$40)
    2892                            .dwattr $C$DW$257, DW_AT_name("rotated_patterns")
    2893                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("rotated_patterns")
    2894                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c004]
    2895                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2896                            .dwattr $C$DW$257, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2897                            .dwattr $C$DW$257, DW_AT_decl_line(0xbc)
    2898                            .dwattr $C$DW$257, DW_AT_decl_column(0x0d)
    2899                    $C$DW$258       .dwtag  DW_TAG_member
    2900                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$32)
    2901                            .dwattr $C$DW$258, DW_AT_name("integralImageWidth")
    2902                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("integralImageWidth")
    2903                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a004]
    2904                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2905                            .dwattr $C$DW$258, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2906                            .dwattr $C$DW$258, DW_AT_decl_line(0xbd)
    2907                            .dwattr $C$DW$258, DW_AT_decl_column(0x0d)
    2908                            .dwendtag $C$DW$T$41
    2909                    
    2910                            .dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2911                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xb8)
    2912                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    2913                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CORBPatterns")
    2914                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$41)
    2915                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    2916                            .dwattr $C$DW$T$45, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2917                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xbe)
    2918                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x02)
    2919                    
    2920                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    2921                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x400)
    2922                    $C$DW$259       .dwtag  DW_TAG_member
    2923                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$42)
    2924                            .dwattr $C$DW$259, DW_AT_name("orientation_horizontal_offsets")
    2925                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("orientation_horizontal_offsets")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   62

    2926                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2927                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2928                            .dwattr $C$DW$259, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2929                            .dwattr $C$DW$259, DW_AT_decl_line(0xc4)
    2930                            .dwattr $C$DW$259, DW_AT_decl_column(0x0d)
    2931                    $C$DW$260       .dwtag  DW_TAG_member
    2932                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$42)
    2933                            .dwattr $C$DW$260, DW_AT_name("orientation_vertical_offsets")
    2934                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("orientation_vertical_offsets")
    2935                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
    2936                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2937                            .dwattr $C$DW$260, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2938                            .dwattr $C$DW$260, DW_AT_decl_line(0xc5)
    2939                            .dwattr $C$DW$260, DW_AT_decl_column(0x0d)
    2940                    $C$DW$261       .dwtag  DW_TAG_member
    2941                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$43)
    2942                            .dwattr $C$DW$261, DW_AT_name("u_max")
    2943                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("u_max")
    2944                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c0]
    2945                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2946                            .dwattr $C$DW$261, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2947                            .dwattr $C$DW$261, DW_AT_decl_line(0xc6)
    2948                            .dwattr $C$DW$261, DW_AT_decl_column(0x0d)
    2949                            .dwendtag $C$DW$T$44
    2950                    
    2951                            .dwattr $C$DW$T$44, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2952                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xc3)
    2953                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    2954                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOrientationOffsets")
    2955                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
    2956                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    2957                            .dwattr $C$DW$T$46, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    2958                            .dwattr $C$DW$T$46, DW_AT_decl_line(0xc7)
    2959                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x02)
    2960                    
    2961                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    2962                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x5a420)
    2963                    $C$DW$262       .dwtag  DW_TAG_member
    2964                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$45)
    2965                            .dwattr $C$DW$262, DW_AT_name("patterns")
    2966                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("patterns")
    2967                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2968                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2969                            .dwattr $C$DW$262, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2970                            .dwattr $C$DW$262, DW_AT_decl_line(0xcd)
    2971                            .dwattr $C$DW$262, DW_AT_decl_column(0x1c)
    2972                    $C$DW$263       .dwtag  DW_TAG_member
    2973                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$46)
    2974                            .dwattr $C$DW$263, DW_AT_name("offsets")
    2975                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("offsets")
    2976                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a008]
    2977                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    2978                            .dwattr $C$DW$263, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2979                            .dwattr $C$DW$263, DW_AT_decl_line(0xce)
    2980                            .dwattr $C$DW$263, DW_AT_decl_column(0x1c)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   63

    2981                    $C$DW$264       .dwtag  DW_TAG_member
    2982                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$20)
    2983                            .dwattr $C$DW$264, DW_AT_name("image")
    2984                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("image")
    2985                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a408]
    2986                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    2987                            .dwattr $C$DW$264, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2988                            .dwattr $C$DW$264, DW_AT_decl_line(0xcf)
    2989                            .dwattr $C$DW$264, DW_AT_decl_column(0x1c)
    2990                    $C$DW$265       .dwtag  DW_TAG_member
    2991                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$20)
    2992                            .dwattr $C$DW$265, DW_AT_name("prefimage")
    2993                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("prefimage")
    2994                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a40c]
    2995                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    2996                            .dwattr $C$DW$265, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    2997                            .dwattr $C$DW$265, DW_AT_decl_line(0xd0)
    2998                            .dwattr $C$DW$265, DW_AT_decl_column(0x1c)
    2999                    $C$DW$266       .dwtag  DW_TAG_member
    3000                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$48)
    3001                            .dwattr $C$DW$266, DW_AT_name("harrisImage")
    3002                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("harrisImage")
    3003                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a410]
    3004                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3005                            .dwattr $C$DW$266, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3006                            .dwattr $C$DW$266, DW_AT_decl_line(0xd1)
    3007                            .dwattr $C$DW$266, DW_AT_decl_column(0x1c)
    3008                    $C$DW$267       .dwtag  DW_TAG_member
    3009                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$49)
    3010                            .dwattr $C$DW$267, DW_AT_name("integralImage")
    3011                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("integralImage")
    3012                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a414]
    3013                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3014                            .dwattr $C$DW$267, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3015                            .dwattr $C$DW$267, DW_AT_decl_line(0xd2)
    3016                            .dwattr $C$DW$267, DW_AT_decl_column(0x1c)
    3017                    $C$DW$268       .dwtag  DW_TAG_member
    3018                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$25)
    3019                            .dwattr $C$DW$268, DW_AT_name("scratchBuffer")
    3020                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("scratchBuffer")
    3021                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a418]
    3022                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3023                            .dwattr $C$DW$268, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3024                            .dwattr $C$DW$268, DW_AT_decl_line(0xd3)
    3025                            .dwattr $C$DW$268, DW_AT_decl_column(0x1c)
    3026                    $C$DW$269       .dwtag  DW_TAG_member
    3027                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$51)
    3028                            .dwattr $C$DW$269, DW_AT_name("orbPattern31")
    3029                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("orbPattern31")
    3030                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a41c]
    3031                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3032                            .dwattr $C$DW$269, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3033                            .dwattr $C$DW$269, DW_AT_decl_line(0xd4)
    3034                            .dwattr $C$DW$269, DW_AT_decl_column(0x1c)
    3035                            .dwendtag $C$DW$T$52
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   64

    3036                    
    3037                            .dwattr $C$DW$T$52, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    3038                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xcc)
    3039                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    3040                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("CORBInput")
    3041                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$52)
    3042                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    3043                            .dwattr $C$DW$T$82, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    3044                            .dwattr $C$DW$T$82, DW_AT_decl_line(0xd5)
    3045                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x02)
    3046                    
    3047                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3048                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x38)
    3049                    $C$DW$270       .dwtag  DW_TAG_member
    3050                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$32)
    3051                            .dwattr $C$DW$270, DW_AT_name("x")
    3052                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("x")
    3053                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3054                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3055                            .dwattr $C$DW$270, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3056                            .dwattr $C$DW$270, DW_AT_decl_line(0xdc)
    3057                            .dwattr $C$DW$270, DW_AT_decl_column(0x0d)
    3058                    $C$DW$271       .dwtag  DW_TAG_member
    3059                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$32)
    3060                            .dwattr $C$DW$271, DW_AT_name("y")
    3061                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("y")
    3062                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3063                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3064                            .dwattr $C$DW$271, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3065                            .dwattr $C$DW$271, DW_AT_decl_line(0xde)
    3066                            .dwattr $C$DW$271, DW_AT_decl_column(0x0d)
    3067                    $C$DW$272       .dwtag  DW_TAG_member
    3068                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$32)
    3069                            .dwattr $C$DW$272, DW_AT_name("octave")
    3070                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("octave")
    3071                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3072                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3073                            .dwattr $C$DW$272, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3074                            .dwattr $C$DW$272, DW_AT_decl_line(0xe0)
    3075                            .dwattr $C$DW$272, DW_AT_decl_column(0x0d)
    3076                    $C$DW$273       .dwtag  DW_TAG_member
    3077                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$53)
    3078                            .dwattr $C$DW$273, DW_AT_name("angle")
    3079                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("angle")
    3080                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3081                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3082                            .dwattr $C$DW$273, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3083                            .dwattr $C$DW$273, DW_AT_decl_line(0xe3)
    3084                            .dwattr $C$DW$273, DW_AT_decl_column(0x0e)
    3085                    $C$DW$274       .dwtag  DW_TAG_member
    3086                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$32)
    3087                            .dwattr $C$DW$274, DW_AT_name("fastResponse")
    3088                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("fastResponse")
    3089                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3090                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   65

    3091                            .dwattr $C$DW$274, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3092                            .dwattr $C$DW$274, DW_AT_decl_line(0xe4)
    3093                            .dwattr $C$DW$274, DW_AT_decl_column(0x0e)
    3094                    $C$DW$275       .dwtag  DW_TAG_member
    3095                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$47)
    3096                            .dwattr $C$DW$275, DW_AT_name("harrisResponse")
    3097                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("harrisResponse")
    3098                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3099                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3100                            .dwattr $C$DW$275, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3101                            .dwattr $C$DW$275, DW_AT_decl_line(0xe5)
    3102                            .dwattr $C$DW$275, DW_AT_decl_column(0x0e)
    3103                    $C$DW$276       .dwtag  DW_TAG_member
    3104                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$54)
    3105                            .dwattr $C$DW$276, DW_AT_name("descriptor")
    3106                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("descriptor")
    3107                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3108                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3109                            .dwattr $C$DW$276, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3110                            .dwattr $C$DW$276, DW_AT_decl_line(0xe6)
    3111                            .dwattr $C$DW$276, DW_AT_decl_column(0x0e)
    3112                            .dwendtag $C$DW$T$55
    3113                    
    3114                            .dwattr $C$DW$T$55, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    3115                            .dwattr $C$DW$T$55, DW_AT_decl_line(0xdb)
    3116                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    3117                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CORBFeature")
    3118                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3119                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3120                            .dwattr $C$DW$T$56, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    3121                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xe7)
    3122                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x02)
    3123                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    3124                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    3125                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    3126                    
    3127                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3128                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x08)
    3129                    $C$DW$277       .dwtag  DW_TAG_member
    3130                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$57)
    3131                            .dwattr $C$DW$277, DW_AT_name("features")
    3132                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("features")
    3133                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3134                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3135                            .dwattr $C$DW$277, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3136                            .dwattr $C$DW$277, DW_AT_decl_line(0xed)
    3137                            .dwattr $C$DW$277, DW_AT_decl_column(0x12)
    3138                    $C$DW$278       .dwtag  DW_TAG_member
    3139                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$32)
    3140                            .dwattr $C$DW$278, DW_AT_name("n_features")
    3141                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("n_features")
    3142                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3143                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3144                            .dwattr $C$DW$278, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\../
    3145                            .dwattr $C$DW$278, DW_AT_decl_line(0xee)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   66

    3146                            .dwattr $C$DW$278, DW_AT_decl_column(0x12)
    3147                            .dwendtag $C$DW$T$58
    3148                    
    3149                            .dwattr $C$DW$T$58, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    3150                            .dwattr $C$DW$T$58, DW_AT_decl_line(0xec)
    3151                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    3152                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOutput")
    3153                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$58)
    3154                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3155                            .dwattr $C$DW$T$83, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\c66\..
    3156                            .dwattr $C$DW$T$83, DW_AT_decl_line(0xef)
    3157                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x02)
    3158                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3159                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3160                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3161                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3162                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3163                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    3164                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$3)
    3165                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3166                            .dwattr $C$DW$T$84, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\com
    3167                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x5c)
    3168                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x19)
    3169                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3170                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3171                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3172                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3173                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3174                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3175                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3176                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3177                    $C$DW$T$121     .dwtag  DW_TAG_pointer_type
    3178                            .dwattr $C$DW$T$121, DW_AT_type(*$C$DW$T$5)
    3179                            .dwattr $C$DW$T$121, DW_AT_address_class(0x20)
    3180                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    3181                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$5)
    3182                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3183                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3184                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2a)
    3185                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1d)
    3186                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3187                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3188                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    3189                    $C$DW$T$137     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    3190                            .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$50)
    3191                            .dwattr $C$DW$T$137, DW_AT_language(DW_LANG_C)
    3192                            .dwattr $C$DW$T$137, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3193                            .dwattr $C$DW$T$137, DW_AT_decl_line(0x39)
    3194                            .dwattr $C$DW$T$137, DW_AT_decl_column(0x17)
    3195                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3196                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3197                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3198                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3199                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    3200                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   67

    3201                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
    3202                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    3203                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    3204                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    3205                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3206                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
    3207                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    3208                    $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    3209                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    3210                            .dwattr $C$DW$T$20, DW_AT_address_class(0x20)
    3211                    $C$DW$T$112     .dwtag  DW_TAG_restrict_type
    3212                            .dwattr $C$DW$T$112, DW_AT_type(*$C$DW$T$20)
    3213                    
    3214                    $C$DW$T$54      .dwtag  DW_TAG_array_type
    3215                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$19)
    3216                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3217                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x20)
    3218                    $C$DW$279       .dwtag  DW_TAG_subrange_type
    3219                            .dwattr $C$DW$279, DW_AT_upper_bound(0x1f)
    3220                            .dwendtag $C$DW$T$54
    3221                    
    3222                    $C$DW$T$107     .dwtag  DW_TAG_const_type
    3223                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$19)
    3224                    $C$DW$T$108     .dwtag  DW_TAG_pointer_type
    3225                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    3226                            .dwattr $C$DW$T$108, DW_AT_address_class(0x20)
    3227                    $C$DW$T$109     .dwtag  DW_TAG_restrict_type
    3228                            .dwattr $C$DW$T$109, DW_AT_type(*$C$DW$T$108)
    3229                    $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    3230                            .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$19)
    3231                            .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    3232                            .dwattr $C$DW$T$139, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3233                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x3a)
    3234                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x16)
    3235                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3236                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3237                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3238                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3239                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3240                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3241                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3242                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3243                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3244                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$8)
    3245                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3246                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3247                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x2c)
    3248                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x1d)
    3249                    $C$DW$T$48      .dwtag  DW_TAG_pointer_type
    3250                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    3251                            .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    3252                    $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    3253                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$47)
    3254                            .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    3255                            .dwattr $C$DW$T$140, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   68

    3256                            .dwattr $C$DW$T$140, DW_AT_decl_line(0x3c)
    3257                            .dwattr $C$DW$T$140, DW_AT_decl_column(0x17)
    3258                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3259                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3260                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3261                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3262                    $C$DW$T$141     .dwtag  DW_TAG_pointer_type
    3263                            .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$9)
    3264                            .dwattr $C$DW$T$141, DW_AT_address_class(0x20)
    3265                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3266                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    3267                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    3268                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3269                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x2d)
    3270                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x1c)
    3271                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    3272                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$21)
    3273                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
    3274                    $C$DW$T$143     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    3275                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$21)
    3276                            .dwattr $C$DW$T$143, DW_AT_language(DW_LANG_C)
    3277                            .dwattr $C$DW$T$143, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3278                            .dwattr $C$DW$T$143, DW_AT_decl_line(0x3d)
    3279                            .dwattr $C$DW$T$143, DW_AT_decl_column(0x16)
    3280                    $C$DW$T$142     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3281                            .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$9)
    3282                            .dwattr $C$DW$T$142, DW_AT_language(DW_LANG_C)
    3283                            .dwattr $C$DW$T$142, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3284                            .dwattr $C$DW$T$142, DW_AT_decl_line(0x53)
    3285                            .dwattr $C$DW$T$142, DW_AT_decl_column(0x1a)
    3286                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3287                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3288                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3289                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3290                    $C$DW$T$159     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    3291                            .dwattr $C$DW$T$159, DW_AT_type(*$C$DW$T$10)
    3292                            .dwattr $C$DW$T$159, DW_AT_language(DW_LANG_C)
    3293                            .dwattr $C$DW$T$159, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3294                            .dwattr $C$DW$T$159, DW_AT_decl_line(0x53)
    3295                            .dwattr $C$DW$T$159, DW_AT_decl_column(0x0d)
    3296                    $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3297                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$10)
    3298                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    3299                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3300                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x2e)
    3301                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x1d)
    3302                    $C$DW$T$153     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    3303                            .dwattr $C$DW$T$153, DW_AT_type(*$C$DW$T$32)
    3304                            .dwattr $C$DW$T$153, DW_AT_language(DW_LANG_C)
    3305                            .dwattr $C$DW$T$153, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\co
    3306                            .dwattr $C$DW$T$153, DW_AT_decl_line(0x77)
    3307                            .dwattr $C$DW$T$153, DW_AT_decl_column(0x11)
    3308                    
    3309                    $C$DW$T$37      .dwtag  DW_TAG_array_type
    3310                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$32)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   69

    3311                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    3312                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x2000)
    3313                    $C$DW$280       .dwtag  DW_TAG_subrange_type
    3314                            .dwattr $C$DW$280, DW_AT_upper_bound(0x7ff)
    3315                            .dwendtag $C$DW$T$37
    3316                    
    3317                    
    3318                    $C$DW$T$38      .dwtag  DW_TAG_array_type
    3319                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$32)
    3320                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3321                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x3c000)
    3322                    $C$DW$281       .dwtag  DW_TAG_subrange_type
    3323                            .dwattr $C$DW$281, DW_AT_upper_bound(0x1d)
    3324                    $C$DW$282       .dwtag  DW_TAG_subrange_type
    3325                            .dwattr $C$DW$282, DW_AT_upper_bound(0x7ff)
    3326                            .dwendtag $C$DW$T$38
    3327                    
    3328                    
    3329                    $C$DW$T$39      .dwtag  DW_TAG_array_type
    3330                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$32)
    3331                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3332                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x1000)
    3333                    $C$DW$283       .dwtag  DW_TAG_subrange_type
    3334                            .dwattr $C$DW$283, DW_AT_upper_bound(0x3ff)
    3335                            .dwendtag $C$DW$T$39
    3336                    
    3337                    
    3338                    $C$DW$T$40      .dwtag  DW_TAG_array_type
    3339                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$32)
    3340                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    3341                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x1e000)
    3342                    $C$DW$284       .dwtag  DW_TAG_subrange_type
    3343                            .dwattr $C$DW$284, DW_AT_upper_bound(0x1d)
    3344                    $C$DW$285       .dwtag  DW_TAG_subrange_type
    3345                            .dwattr $C$DW$285, DW_AT_upper_bound(0x3ff)
    3346                            .dwendtag $C$DW$T$40
    3347                    
    3348                    
    3349                    $C$DW$T$42      .dwtag  DW_TAG_array_type
    3350                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$32)
    3351                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3352                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x1e0)
    3353                    $C$DW$286       .dwtag  DW_TAG_subrange_type
    3354                            .dwattr $C$DW$286, DW_AT_upper_bound(0x77)
    3355                            .dwendtag $C$DW$T$42
    3356                    
    3357                    
    3358                    $C$DW$T$43      .dwtag  DW_TAG_array_type
    3359                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$32)
    3360                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3361                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x40)
    3362                    $C$DW$287       .dwtag  DW_TAG_subrange_type
    3363                            .dwattr $C$DW$287, DW_AT_upper_bound(0x0f)
    3364                            .dwendtag $C$DW$T$43
    3365                    
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   70

    3366                    
    3367                    $C$DW$T$59      .dwtag  DW_TAG_array_type
    3368                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$32)
    3369                            .dwattr $C$DW$T$59, DW_AT_language(DW_LANG_C)
    3370                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x10)
    3371                    $C$DW$288       .dwtag  DW_TAG_subrange_type
    3372                            .dwattr $C$DW$288, DW_AT_upper_bound(0x03)
    3373                            .dwendtag $C$DW$T$59
    3374                    
    3375                    $C$DW$T$117     .dwtag  DW_TAG_pointer_type
    3376                            .dwattr $C$DW$T$117, DW_AT_type(*$C$DW$T$32)
    3377                            .dwattr $C$DW$T$117, DW_AT_address_class(0x20)
    3378                    $C$DW$T$154     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    3379                            .dwattr $C$DW$T$154, DW_AT_type(*$C$DW$T$32)
    3380                            .dwattr $C$DW$T$154, DW_AT_language(DW_LANG_C)
    3381                            .dwattr $C$DW$T$154, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3382                            .dwattr $C$DW$T$154, DW_AT_decl_line(0x4b)
    3383                            .dwattr $C$DW$T$154, DW_AT_decl_column(0x17)
    3384                    $C$DW$T$155     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    3385                            .dwattr $C$DW$T$155, DW_AT_type(*$C$DW$T$32)
    3386                            .dwattr $C$DW$T$155, DW_AT_language(DW_LANG_C)
    3387                            .dwattr $C$DW$T$155, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3388                            .dwattr $C$DW$T$155, DW_AT_decl_line(0x4e)
    3389                            .dwattr $C$DW$T$155, DW_AT_decl_column(0x17)
    3390                    $C$DW$T$156     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    3391                            .dwattr $C$DW$T$156, DW_AT_type(*$C$DW$T$32)
    3392                            .dwattr $C$DW$T$156, DW_AT_language(DW_LANG_C)
    3393                            .dwattr $C$DW$T$156, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3394                            .dwattr $C$DW$T$156, DW_AT_decl_line(0x49)
    3395                            .dwattr $C$DW$T$156, DW_AT_decl_column(0x17)
    3396                    $C$DW$T$157     .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    3397                            .dwattr $C$DW$T$157, DW_AT_type(*$C$DW$T$32)
    3398                            .dwattr $C$DW$T$157, DW_AT_language(DW_LANG_C)
    3399                            .dwattr $C$DW$T$157, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3400                            .dwattr $C$DW$T$157, DW_AT_decl_line(0x3e)
    3401                            .dwattr $C$DW$T$157, DW_AT_decl_column(0x17)
    3402                    $C$DW$T$158     .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    3403                            .dwattr $C$DW$T$158, DW_AT_type(*$C$DW$T$10)
    3404                            .dwattr $C$DW$T$158, DW_AT_language(DW_LANG_C)
    3405                            .dwattr $C$DW$T$158, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3406                            .dwattr $C$DW$T$158, DW_AT_decl_line(0x58)
    3407                            .dwattr $C$DW$T$158, DW_AT_decl_column(0x1a)
    3408                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    3409                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    3410                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    3411                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    3412                    $C$DW$T$160     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_VAL")
    3413                            .dwattr $C$DW$T$160, DW_AT_type(*$C$DW$T$11)
    3414                            .dwattr $C$DW$T$160, DW_AT_language(DW_LANG_C)
    3415                            .dwattr $C$DW$T$160, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_originalfast9_score\..\co
    3416                            .dwattr $C$DW$T$160, DW_AT_decl_line(0x5d)
    3417                            .dwattr $C$DW$T$160, DW_AT_decl_column(0x17)
    3418                    $C$DW$T$172     .dwtag  DW_TAG_typedef, DW_AT_name("clock_t")
    3419                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$11)
    3420                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:26 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_originalfast9_score/VLIB_originalfast9_score_d.se66 PAGE   71

    3421                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3422                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x37)
    3423                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x16)
    3424                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    3425                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$11)
    3426                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3427                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
