TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Thu Mar 19 12:43:42 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    2915                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x03)
    2916                    
    2917                    $C$DW$T$80      .dwtag  DW_TAG_enumeration_type
    2918                            .dwattr $C$DW$T$80, DW_AT_byte_size(0x04)
    2919                    $C$DW$236       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_OPT"), DW_AT_const_value(0x00)
    2920                            .dwattr $C$DW$236, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\../
    2921                            .dwattr $C$DW$236, DW_AT_decl_line(0x6a)
    2922                            .dwattr $C$DW$236, DW_AT_decl_column(0x05)
    2923                    $C$DW$237       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CN"), DW_AT_const_value(0x01)
    2924                            .dwattr $C$DW$237, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\../
    2925                            .dwattr $C$DW$237, DW_AT_decl_line(0x6b)
    2926                            .dwattr $C$DW$237, DW_AT_decl_column(0x05)
    2927                    $C$DW$238       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CNT"), DW_AT_const_value(0x02)
    2928                            .dwattr $C$DW$238, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\../
    2929                            .dwattr $C$DW$238, DW_AT_decl_line(0x6c)
    2930                            .dwattr $C$DW$238, DW_AT_decl_column(0x05)
    2931                            .dwendtag $C$DW$T$80
    2932                    
    2933                            .dwattr $C$DW$T$80, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    2934                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x69)
    2935                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x06)
    2936                    
    2937                    $C$DW$T$81      .dwtag  DW_TAG_enumeration_type
    2938                            .dwattr $C$DW$T$81, DW_AT_byte_size(0x04)
    2939                    $C$DW$239       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    2940                            .dwattr $C$DW$239, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\../
    2941                            .dwattr $C$DW$239, DW_AT_decl_line(0x72)
    2942                            .dwattr $C$DW$239, DW_AT_decl_column(0x05)
    2943                    $C$DW$240       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    2944                            .dwattr $C$DW$240, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\../
    2945                            .dwattr $C$DW$240, DW_AT_decl_line(0x73)
    2946                            .dwattr $C$DW$240, DW_AT_decl_column(0x05)
    2947                            .dwendtag $C$DW$T$81
    2948                    
    2949                            .dwattr $C$DW$T$81, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    2950                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x71)
    2951                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x06)
    2952                    
    2953                    $C$DW$T$82      .dwtag  DW_TAG_enumeration_type
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   64

    2954                            .dwattr $C$DW$T$82, DW_AT_byte_size(0x04)
    2955                    $C$DW$241       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_FALSE"), DW_AT_const_value(0x00)
    2956                            .dwattr $C$DW$241, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    2957                            .dwattr $C$DW$241, DW_AT_decl_line(0x8f)
    2958                            .dwattr $C$DW$241, DW_AT_decl_column(0x05)
    2959                    $C$DW$242       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_TRUE"), DW_AT_const_value(0x01)
    2960                            .dwattr $C$DW$242, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    2961                            .dwattr $C$DW$242, DW_AT_decl_line(0x90)
    2962                            .dwattr $C$DW$242, DW_AT_decl_column(0x05)
    2963                            .dwendtag $C$DW$T$82
    2964                    
    2965                            .dwattr $C$DW$T$82, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    2966                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x8e)
    2967                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x0e)
    2968                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("CORB_Bool")
    2969                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$82)
    2970                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    2971                            .dwattr $C$DW$T$83, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    2972                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x91)
    2973                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x02)
    2974                    
    2975                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    2976                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x14)
    2977                    $C$DW$243       .dwtag  DW_TAG_member
    2978                            .dwattr $C$DW$243, DW_AT_type(*$C$DW$T$19)
    2979                            .dwattr $C$DW$243, DW_AT_name("width")
    2980                            .dwattr $C$DW$243, DW_AT_TI_symbol_name("width")
    2981                            .dwattr $C$DW$243, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2982                            .dwattr $C$DW$243, DW_AT_accessibility(DW_ACCESS_public)
    2983                            .dwattr $C$DW$243, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    2984                            .dwattr $C$DW$243, DW_AT_decl_line(0xaa)
    2985                            .dwattr $C$DW$243, DW_AT_decl_column(0x0d)
    2986                    $C$DW$244       .dwtag  DW_TAG_member
    2987                            .dwattr $C$DW$244, DW_AT_type(*$C$DW$T$19)
    2988                            .dwattr $C$DW$244, DW_AT_name("height")
    2989                            .dwattr $C$DW$244, DW_AT_TI_symbol_name("height")
    2990                            .dwattr $C$DW$244, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2991                            .dwattr $C$DW$244, DW_AT_accessibility(DW_ACCESS_public)
    2992                            .dwattr $C$DW$244, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    2993                            .dwattr $C$DW$244, DW_AT_decl_line(0xab)
    2994                            .dwattr $C$DW$244, DW_AT_decl_column(0x0d)
    2995                    $C$DW$245       .dwtag  DW_TAG_member
    2996                            .dwattr $C$DW$245, DW_AT_type(*$C$DW$T$19)
    2997                            .dwattr $C$DW$245, DW_AT_name("marginPixels")
    2998                            .dwattr $C$DW$245, DW_AT_TI_symbol_name("marginPixels")
    2999                            .dwattr $C$DW$245, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3000                            .dwattr $C$DW$245, DW_AT_accessibility(DW_ACCESS_public)
    3001                            .dwattr $C$DW$245, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3002                            .dwattr $C$DW$245, DW_AT_decl_line(0xac)
    3003                            .dwattr $C$DW$245, DW_AT_decl_column(0x0d)
    3004                    $C$DW$246       .dwtag  DW_TAG_member
    3005                            .dwattr $C$DW$246, DW_AT_type(*$C$DW$T$20)
    3006                            .dwattr $C$DW$246, DW_AT_name("fastDifferenceThreshold")
    3007                            .dwattr $C$DW$246, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    3008                            .dwattr $C$DW$246, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   65

    3009                            .dwattr $C$DW$246, DW_AT_accessibility(DW_ACCESS_public)
    3010                            .dwattr $C$DW$246, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3011                            .dwattr $C$DW$246, DW_AT_decl_line(0xae)
    3012                            .dwattr $C$DW$246, DW_AT_decl_column(0x0d)
    3013                    $C$DW$247       .dwtag  DW_TAG_member
    3014                            .dwattr $C$DW$247, DW_AT_type(*$C$DW$T$19)
    3015                            .dwattr $C$DW$247, DW_AT_name("n_features_desired")
    3016                            .dwattr $C$DW$247, DW_AT_TI_symbol_name("n_features_desired")
    3017                            .dwattr $C$DW$247, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3018                            .dwattr $C$DW$247, DW_AT_accessibility(DW_ACCESS_public)
    3019                            .dwattr $C$DW$247, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3020                            .dwattr $C$DW$247, DW_AT_decl_line(0xb2)
    3021                            .dwattr $C$DW$247, DW_AT_decl_column(0x0d)
    3022                            .dwendtag $C$DW$T$21
    3023                    
    3024                            .dwattr $C$DW$T$21, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3025                            .dwattr $C$DW$T$21, DW_AT_decl_line(0xa9)
    3026                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    3027                    $C$DW$T$67      .dwtag  DW_TAG_typedef, DW_AT_name("CORBParameters")
    3028                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$21)
    3029                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    3030                            .dwattr $C$DW$T$67, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3031                            .dwattr $C$DW$T$67, DW_AT_decl_line(0xb3)
    3032                            .dwattr $C$DW$T$67, DW_AT_decl_column(0x02)
    3033                    $C$DW$T$68      .dwtag  DW_TAG_const_type
    3034                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$67)
    3035                    $C$DW$T$69      .dwtag  DW_TAG_pointer_type
    3036                            .dwattr $C$DW$T$69, DW_AT_type(*$C$DW$T$68)
    3037                            .dwattr $C$DW$T$69, DW_AT_address_class(0x20)
    3038                    
    3039                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
    3040                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x5a008)
    3041                    $C$DW$248       .dwtag  DW_TAG_member
    3042                            .dwattr $C$DW$248, DW_AT_type(*$C$DW$T$19)
    3043                            .dwattr $C$DW$248, DW_AT_name("octave")
    3044                            .dwattr $C$DW$248, DW_AT_TI_symbol_name("octave")
    3045                            .dwattr $C$DW$248, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3046                            .dwattr $C$DW$248, DW_AT_accessibility(DW_ACCESS_public)
    3047                            .dwattr $C$DW$248, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3048                            .dwattr $C$DW$248, DW_AT_decl_line(0xb9)
    3049                            .dwattr $C$DW$248, DW_AT_decl_column(0x0d)
    3050                    $C$DW$249       .dwtag  DW_TAG_member
    3051                            .dwattr $C$DW$249, DW_AT_type(*$C$DW$T$23)
    3052                            .dwattr $C$DW$249, DW_AT_name("relative_patterns")
    3053                            .dwattr $C$DW$249, DW_AT_TI_symbol_name("relative_patterns")
    3054                            .dwattr $C$DW$249, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3055                            .dwattr $C$DW$249, DW_AT_accessibility(DW_ACCESS_public)
    3056                            .dwattr $C$DW$249, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3057                            .dwattr $C$DW$249, DW_AT_decl_line(0xbb)
    3058                            .dwattr $C$DW$249, DW_AT_decl_column(0x0d)
    3059                    $C$DW$250       .dwtag  DW_TAG_member
    3060                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$25)
    3061                            .dwattr $C$DW$250, DW_AT_name("rotated_patterns")
    3062                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("rotated_patterns")
    3063                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c004]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   66

    3064                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    3065                            .dwattr $C$DW$250, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3066                            .dwattr $C$DW$250, DW_AT_decl_line(0xbc)
    3067                            .dwattr $C$DW$250, DW_AT_decl_column(0x0d)
    3068                    $C$DW$251       .dwtag  DW_TAG_member
    3069                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$19)
    3070                            .dwattr $C$DW$251, DW_AT_name("integralImageWidth")
    3071                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("integralImageWidth")
    3072                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a004]
    3073                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    3074                            .dwattr $C$DW$251, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3075                            .dwattr $C$DW$251, DW_AT_decl_line(0xbd)
    3076                            .dwattr $C$DW$251, DW_AT_decl_column(0x0d)
    3077                            .dwendtag $C$DW$T$26
    3078                    
    3079                            .dwattr $C$DW$T$26, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3080                            .dwattr $C$DW$T$26, DW_AT_decl_line(0xb8)
    3081                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
    3082                    $C$DW$T$30      .dwtag  DW_TAG_typedef, DW_AT_name("CORBPatterns")
    3083                            .dwattr $C$DW$T$30, DW_AT_type(*$C$DW$T$26)
    3084                            .dwattr $C$DW$T$30, DW_AT_language(DW_LANG_C)
    3085                            .dwattr $C$DW$T$30, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3086                            .dwattr $C$DW$T$30, DW_AT_decl_line(0xbe)
    3087                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x02)
    3088                    
    3089                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    3090                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x400)
    3091                    $C$DW$252       .dwtag  DW_TAG_member
    3092                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$27)
    3093                            .dwattr $C$DW$252, DW_AT_name("orientation_horizontal_offsets")
    3094                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("orientation_horizontal_offsets")
    3095                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3096                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    3097                            .dwattr $C$DW$252, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3098                            .dwattr $C$DW$252, DW_AT_decl_line(0xc4)
    3099                            .dwattr $C$DW$252, DW_AT_decl_column(0x0d)
    3100                    $C$DW$253       .dwtag  DW_TAG_member
    3101                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$27)
    3102                            .dwattr $C$DW$253, DW_AT_name("orientation_vertical_offsets")
    3103                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("orientation_vertical_offsets")
    3104                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
    3105                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    3106                            .dwattr $C$DW$253, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3107                            .dwattr $C$DW$253, DW_AT_decl_line(0xc5)
    3108                            .dwattr $C$DW$253, DW_AT_decl_column(0x0d)
    3109                    $C$DW$254       .dwtag  DW_TAG_member
    3110                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$28)
    3111                            .dwattr $C$DW$254, DW_AT_name("u_max")
    3112                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("u_max")
    3113                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c0]
    3114                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    3115                            .dwattr $C$DW$254, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3116                            .dwattr $C$DW$254, DW_AT_decl_line(0xc6)
    3117                            .dwattr $C$DW$254, DW_AT_decl_column(0x0d)
    3118                            .dwendtag $C$DW$T$29
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   67

    3119                    
    3120                            .dwattr $C$DW$T$29, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3121                            .dwattr $C$DW$T$29, DW_AT_decl_line(0xc3)
    3122                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
    3123                    $C$DW$T$31      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOrientationOffsets")
    3124                            .dwattr $C$DW$T$31, DW_AT_type(*$C$DW$T$29)
    3125                            .dwattr $C$DW$T$31, DW_AT_language(DW_LANG_C)
    3126                            .dwattr $C$DW$T$31, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3127                            .dwattr $C$DW$T$31, DW_AT_decl_line(0xc7)
    3128                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x02)
    3129                    
    3130                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3131                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x5a420)
    3132                    $C$DW$255       .dwtag  DW_TAG_member
    3133                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$30)
    3134                            .dwattr $C$DW$255, DW_AT_name("patterns")
    3135                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("patterns")
    3136                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3137                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    3138                            .dwattr $C$DW$255, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3139                            .dwattr $C$DW$255, DW_AT_decl_line(0xcd)
    3140                            .dwattr $C$DW$255, DW_AT_decl_column(0x1c)
    3141                    $C$DW$256       .dwtag  DW_TAG_member
    3142                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$31)
    3143                            .dwattr $C$DW$256, DW_AT_name("offsets")
    3144                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("offsets")
    3145                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a008]
    3146                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    3147                            .dwattr $C$DW$256, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3148                            .dwattr $C$DW$256, DW_AT_decl_line(0xce)
    3149                            .dwattr $C$DW$256, DW_AT_decl_column(0x1c)
    3150                    $C$DW$257       .dwtag  DW_TAG_member
    3151                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$32)
    3152                            .dwattr $C$DW$257, DW_AT_name("image")
    3153                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("image")
    3154                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a408]
    3155                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    3156                            .dwattr $C$DW$257, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3157                            .dwattr $C$DW$257, DW_AT_decl_line(0xcf)
    3158                            .dwattr $C$DW$257, DW_AT_decl_column(0x1c)
    3159                    $C$DW$258       .dwtag  DW_TAG_member
    3160                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$32)
    3161                            .dwattr $C$DW$258, DW_AT_name("prefimage")
    3162                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("prefimage")
    3163                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a40c]
    3164                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    3165                            .dwattr $C$DW$258, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3166                            .dwattr $C$DW$258, DW_AT_decl_line(0xd0)
    3167                            .dwattr $C$DW$258, DW_AT_decl_column(0x1c)
    3168                    $C$DW$259       .dwtag  DW_TAG_member
    3169                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$34)
    3170                            .dwattr $C$DW$259, DW_AT_name("harrisImage")
    3171                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("harrisImage")
    3172                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a410]
    3173                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   68

    3174                            .dwattr $C$DW$259, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3175                            .dwattr $C$DW$259, DW_AT_decl_line(0xd1)
    3176                            .dwattr $C$DW$259, DW_AT_decl_column(0x1c)
    3177                    $C$DW$260       .dwtag  DW_TAG_member
    3178                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$36)
    3179                            .dwattr $C$DW$260, DW_AT_name("integralImage")
    3180                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("integralImage")
    3181                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a414]
    3182                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    3183                            .dwattr $C$DW$260, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3184                            .dwattr $C$DW$260, DW_AT_decl_line(0xd2)
    3185                            .dwattr $C$DW$260, DW_AT_decl_column(0x1c)
    3186                    $C$DW$261       .dwtag  DW_TAG_member
    3187                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$38)
    3188                            .dwattr $C$DW$261, DW_AT_name("scratchBuffer")
    3189                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("scratchBuffer")
    3190                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a418]
    3191                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    3192                            .dwattr $C$DW$261, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3193                            .dwattr $C$DW$261, DW_AT_decl_line(0xd3)
    3194                            .dwattr $C$DW$261, DW_AT_decl_column(0x1c)
    3195                    $C$DW$262       .dwtag  DW_TAG_member
    3196                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$40)
    3197                            .dwattr $C$DW$262, DW_AT_name("orbPattern31")
    3198                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("orbPattern31")
    3199                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a41c]
    3200                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    3201                            .dwattr $C$DW$262, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3202                            .dwattr $C$DW$262, DW_AT_decl_line(0xd4)
    3203                            .dwattr $C$DW$262, DW_AT_decl_column(0x1c)
    3204                            .dwendtag $C$DW$T$41
    3205                    
    3206                            .dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3207                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xcc)
    3208                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3209                    $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CORBInput")
    3210                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$41)
    3211                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    3212                            .dwattr $C$DW$T$70, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3213                            .dwattr $C$DW$T$70, DW_AT_decl_line(0xd5)
    3214                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x02)
    3215                    $C$DW$T$71      .dwtag  DW_TAG_const_type
    3216                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$70)
    3217                    $C$DW$T$72      .dwtag  DW_TAG_pointer_type
    3218                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    3219                            .dwattr $C$DW$T$72, DW_AT_address_class(0x20)
    3220                    $C$DW$T$89      .dwtag  DW_TAG_pointer_type
    3221                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$70)
    3222                            .dwattr $C$DW$T$89, DW_AT_address_class(0x20)
    3223                    
    3224                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3225                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x38)
    3226                    $C$DW$263       .dwtag  DW_TAG_member
    3227                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$19)
    3228                            .dwattr $C$DW$263, DW_AT_name("x")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   69

    3229                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("x")
    3230                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3231                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3232                            .dwattr $C$DW$263, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3233                            .dwattr $C$DW$263, DW_AT_decl_line(0xdc)
    3234                            .dwattr $C$DW$263, DW_AT_decl_column(0x0d)
    3235                    $C$DW$264       .dwtag  DW_TAG_member
    3236                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$19)
    3237                            .dwattr $C$DW$264, DW_AT_name("y")
    3238                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("y")
    3239                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3240                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3241                            .dwattr $C$DW$264, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3242                            .dwattr $C$DW$264, DW_AT_decl_line(0xde)
    3243                            .dwattr $C$DW$264, DW_AT_decl_column(0x0d)
    3244                    $C$DW$265       .dwtag  DW_TAG_member
    3245                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$19)
    3246                            .dwattr $C$DW$265, DW_AT_name("octave")
    3247                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("octave")
    3248                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3249                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3250                            .dwattr $C$DW$265, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3251                            .dwattr $C$DW$265, DW_AT_decl_line(0xe0)
    3252                            .dwattr $C$DW$265, DW_AT_decl_column(0x0d)
    3253                    $C$DW$266       .dwtag  DW_TAG_member
    3254                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$42)
    3255                            .dwattr $C$DW$266, DW_AT_name("angle")
    3256                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("angle")
    3257                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3258                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3259                            .dwattr $C$DW$266, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3260                            .dwattr $C$DW$266, DW_AT_decl_line(0xe3)
    3261                            .dwattr $C$DW$266, DW_AT_decl_column(0x0e)
    3262                    $C$DW$267       .dwtag  DW_TAG_member
    3263                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$19)
    3264                            .dwattr $C$DW$267, DW_AT_name("fastResponse")
    3265                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("fastResponse")
    3266                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3267                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3268                            .dwattr $C$DW$267, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3269                            .dwattr $C$DW$267, DW_AT_decl_line(0xe4)
    3270                            .dwattr $C$DW$267, DW_AT_decl_column(0x0e)
    3271                    $C$DW$268       .dwtag  DW_TAG_member
    3272                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$33)
    3273                            .dwattr $C$DW$268, DW_AT_name("harrisResponse")
    3274                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("harrisResponse")
    3275                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3276                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3277                            .dwattr $C$DW$268, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3278                            .dwattr $C$DW$268, DW_AT_decl_line(0xe5)
    3279                            .dwattr $C$DW$268, DW_AT_decl_column(0x0e)
    3280                    $C$DW$269       .dwtag  DW_TAG_member
    3281                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$43)
    3282                            .dwattr $C$DW$269, DW_AT_name("descriptor")
    3283                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("descriptor")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   70

    3284                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3285                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3286                            .dwattr $C$DW$269, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3287                            .dwattr $C$DW$269, DW_AT_decl_line(0xe6)
    3288                            .dwattr $C$DW$269, DW_AT_decl_column(0x0e)
    3289                            .dwendtag $C$DW$T$44
    3290                    
    3291                            .dwattr $C$DW$T$44, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3292                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xdb)
    3293                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    3294                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CORBFeature")
    3295                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$44)
    3296                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3297                            .dwattr $C$DW$T$45, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3298                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xe7)
    3299                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x02)
    3300                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    3301                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$45)
    3302                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    3303                    $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    3304                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$44)
    3305                            .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    3306                    
    3307                    $C$DW$T$47      .dwtag  DW_TAG_structure_type
    3308                            .dwattr $C$DW$T$47, DW_AT_byte_size(0x08)
    3309                    $C$DW$270       .dwtag  DW_TAG_member
    3310                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$46)
    3311                            .dwattr $C$DW$270, DW_AT_name("features")
    3312                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("features")
    3313                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3314                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3315                            .dwattr $C$DW$270, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3316                            .dwattr $C$DW$270, DW_AT_decl_line(0xed)
    3317                            .dwattr $C$DW$270, DW_AT_decl_column(0x12)
    3318                    $C$DW$271       .dwtag  DW_TAG_member
    3319                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$19)
    3320                            .dwattr $C$DW$271, DW_AT_name("n_features")
    3321                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("n_features")
    3322                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3323                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3324                            .dwattr $C$DW$271, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3325                            .dwattr $C$DW$271, DW_AT_decl_line(0xee)
    3326                            .dwattr $C$DW$271, DW_AT_decl_column(0x12)
    3327                            .dwendtag $C$DW$T$47
    3328                    
    3329                            .dwattr $C$DW$T$47, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3330                            .dwattr $C$DW$T$47, DW_AT_decl_line(0xec)
    3331                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x10)
    3332                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOutput")
    3333                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$47)
    3334                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3335                            .dwattr $C$DW$T$73, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3336                            .dwattr $C$DW$T$73, DW_AT_decl_line(0xef)
    3337                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x02)
    3338                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   71

    3339                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    3340                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    3341                    
    3342                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3343                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x20)
    3344                    $C$DW$272       .dwtag  DW_TAG_member
    3345                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$20)
    3346                            .dwattr $C$DW$272, DW_AT_name("testPattern")
    3347                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("testPattern")
    3348                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3349                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3350                            .dwattr $C$DW$272, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\VLI
    3351                            .dwattr $C$DW$272, DW_AT_decl_line(0x24)
    3352                            .dwattr $C$DW$272, DW_AT_decl_column(0x0f)
    3353                    $C$DW$273       .dwtag  DW_TAG_member
    3354                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$49)
    3355                            .dwattr $C$DW$273, DW_AT_name("staticInFeatures")
    3356                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("staticInFeatures")
    3357                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3358                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3359                            .dwattr $C$DW$273, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\VLI
    3360                            .dwattr $C$DW$273, DW_AT_decl_line(0x25)
    3361                            .dwattr $C$DW$273, DW_AT_decl_column(0x0f)
    3362                    $C$DW$274       .dwtag  DW_TAG_member
    3363                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$34)
    3364                            .dwattr $C$DW$274, DW_AT_name("staticInHarris")
    3365                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("staticInHarris")
    3366                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3367                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3368                            .dwattr $C$DW$274, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\VLI
    3369                            .dwattr $C$DW$274, DW_AT_decl_line(0x26)
    3370                            .dwattr $C$DW$274, DW_AT_decl_column(0x0f)
    3371                    $C$DW$275       .dwtag  DW_TAG_member
    3372                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$49)
    3373                            .dwattr $C$DW$275, DW_AT_name("staticOut")
    3374                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("staticOut")
    3375                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3376                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3377                            .dwattr $C$DW$275, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\VLI
    3378                            .dwattr $C$DW$275, DW_AT_decl_line(0x27)
    3379                            .dwattr $C$DW$275, DW_AT_decl_column(0x0f)
    3380                    $C$DW$276       .dwtag  DW_TAG_member
    3381                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$48)
    3382                            .dwattr $C$DW$276, DW_AT_name("imageWidth")
    3383                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("imageWidth")
    3384                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3385                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3386                            .dwattr $C$DW$276, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\VLI
    3387                            .dwattr $C$DW$276, DW_AT_decl_line(0x28)
    3388                            .dwattr $C$DW$276, DW_AT_decl_column(0x0f)
    3389                    $C$DW$277       .dwtag  DW_TAG_member
    3390                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$48)
    3391                            .dwattr $C$DW$277, DW_AT_name("imageHeight")
    3392                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("imageHeight")
    3393                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   72

    3394                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3395                            .dwattr $C$DW$277, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\VLI
    3396                            .dwattr $C$DW$277, DW_AT_decl_line(0x29)
    3397                            .dwattr $C$DW$277, DW_AT_decl_column(0x0f)
    3398                    $C$DW$278       .dwtag  DW_TAG_member
    3399                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$35)
    3400                            .dwattr $C$DW$278, DW_AT_name("true_num_features")
    3401                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("true_num_features")
    3402                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3403                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3404                            .dwattr $C$DW$278, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\VLI
    3405                            .dwattr $C$DW$278, DW_AT_decl_line(0x2a)
    3406                            .dwattr $C$DW$278, DW_AT_decl_column(0x0f)
    3407                    $C$DW$279       .dwtag  DW_TAG_member
    3408                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$35)
    3409                            .dwattr $C$DW$279, DW_AT_name("desired_num_features")
    3410                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("desired_num_features")
    3411                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3412                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3413                            .dwattr $C$DW$279, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\VLI
    3414                            .dwattr $C$DW$279, DW_AT_decl_line(0x2b)
    3415                            .dwattr $C$DW$279, DW_AT_decl_column(0x0f)
    3416                    $C$DW$280       .dwtag  DW_TAG_member
    3417                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$38)
    3418                            .dwattr $C$DW$280, DW_AT_name("desc")
    3419                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("desc")
    3420                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3421                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3422                            .dwattr $C$DW$280, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\VLI
    3423                            .dwattr $C$DW$280, DW_AT_decl_line(0x2c)
    3424                            .dwattr $C$DW$280, DW_AT_decl_column(0x0f)
    3425                            .dwendtag $C$DW$T$50
    3426                    
    3427                            .dwattr $C$DW$T$50, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\VL
    3428                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x23)
    3429                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    3430                    $C$DW$T$93      .dwtag  DW_TAG_pointer_type
    3431                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$50)
    3432                            .dwattr $C$DW$T$93, DW_AT_address_class(0x20)
    3433                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("orb_bestFeaturesToFront_testParams_t")
    3434                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$50)
    3435                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    3436                            .dwattr $C$DW$T$95, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\VL
    3437                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x2d)
    3438                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x03)
    3439                    $C$DW$T$96      .dwtag  DW_TAG_pointer_type
    3440                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$95)
    3441                            .dwattr $C$DW$T$96, DW_AT_address_class(0x20)
    3442                    $C$DW$T$97      .dwtag  DW_TAG_pointer_type
    3443                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$96)
    3444                            .dwattr $C$DW$T$97, DW_AT_address_class(0x20)
    3445                    
    3446                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3447                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x18)
    3448                    $C$DW$281       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   73

    3449                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$10)
    3450                            .dwattr $C$DW$281, DW_AT_name("fd")
    3451                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("fd")
    3452                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3453                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3454                            .dwattr $C$DW$281, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3455                            .dwattr $C$DW$281, DW_AT_decl_line(0x49)
    3456                            .dwattr $C$DW$281, DW_AT_decl_column(0x0b)
    3457                    $C$DW$282       .dwtag  DW_TAG_member
    3458                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$51)
    3459                            .dwattr $C$DW$282, DW_AT_name("buf")
    3460                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("buf")
    3461                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3462                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3463                            .dwattr $C$DW$282, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3464                            .dwattr $C$DW$282, DW_AT_decl_line(0x4a)
    3465                            .dwattr $C$DW$282, DW_AT_decl_column(0x16)
    3466                    $C$DW$283       .dwtag  DW_TAG_member
    3467                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$51)
    3468                            .dwattr $C$DW$283, DW_AT_name("pos")
    3469                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("pos")
    3470                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3471                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3472                            .dwattr $C$DW$283, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3473                            .dwattr $C$DW$283, DW_AT_decl_line(0x4b)
    3474                            .dwattr $C$DW$283, DW_AT_decl_column(0x16)
    3475                    $C$DW$284       .dwtag  DW_TAG_member
    3476                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$51)
    3477                            .dwattr $C$DW$284, DW_AT_name("bufend")
    3478                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("bufend")
    3479                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3480                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3481                            .dwattr $C$DW$284, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3482                            .dwattr $C$DW$284, DW_AT_decl_line(0x4c)
    3483                            .dwattr $C$DW$284, DW_AT_decl_column(0x16)
    3484                    $C$DW$285       .dwtag  DW_TAG_member
    3485                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$51)
    3486                            .dwattr $C$DW$285, DW_AT_name("buff_stop")
    3487                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("buff_stop")
    3488                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3489                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3490                            .dwattr $C$DW$285, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3491                            .dwattr $C$DW$285, DW_AT_decl_line(0x4d)
    3492                            .dwattr $C$DW$285, DW_AT_decl_column(0x16)
    3493                    $C$DW$286       .dwtag  DW_TAG_member
    3494                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$11)
    3495                            .dwattr $C$DW$286, DW_AT_name("flags")
    3496                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("flags")
    3497                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3498                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3499                            .dwattr $C$DW$286, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3500                            .dwattr $C$DW$286, DW_AT_decl_line(0x4e)
    3501                            .dwattr $C$DW$286, DW_AT_decl_column(0x16)
    3502                            .dwendtag $C$DW$T$52
    3503                    
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   74

    3504                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3505                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x48)
    3506                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    3507                    $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3508                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$52)
    3509                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    3510                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3511                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x4f)
    3512                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    3513                    
    3514                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3515                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x08)
    3516                    $C$DW$287       .dwtag  DW_TAG_member
    3517                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$10)
    3518                            .dwattr $C$DW$287, DW_AT_name("quot")
    3519                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("quot")
    3520                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3521                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3522                            .dwattr $C$DW$287, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3523                            .dwattr $C$DW$287, DW_AT_decl_line(0x3e)
    3524                            .dwattr $C$DW$287, DW_AT_decl_column(0x16)
    3525                    $C$DW$288       .dwtag  DW_TAG_member
    3526                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$10)
    3527                            .dwattr $C$DW$288, DW_AT_name("rem")
    3528                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("rem")
    3529                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3530                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3531                            .dwattr $C$DW$288, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3532                            .dwattr $C$DW$288, DW_AT_decl_line(0x3e)
    3533                            .dwattr $C$DW$288, DW_AT_decl_column(0x1c)
    3534                            .dwendtag $C$DW$T$53
    3535                    
    3536                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3537                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x3e)
    3538                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x10)
    3539                    $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3540                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$53)
    3541                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    3542                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3543                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x3e)
    3544                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x23)
    3545                    
    3546                    $C$DW$T$54      .dwtag  DW_TAG_structure_type
    3547                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x08)
    3548                    $C$DW$289       .dwtag  DW_TAG_member
    3549                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$10)
    3550                            .dwattr $C$DW$289, DW_AT_name("quot")
    3551                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("quot")
    3552                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3553                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3554                            .dwattr $C$DW$289, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3555                            .dwattr $C$DW$289, DW_AT_decl_line(0x40)
    3556                            .dwattr $C$DW$289, DW_AT_decl_column(0x17)
    3557                    $C$DW$290       .dwtag  DW_TAG_member
    3558                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$10)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   75

    3559                            .dwattr $C$DW$290, DW_AT_name("rem")
    3560                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("rem")
    3561                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3562                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3563                            .dwattr $C$DW$290, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3564                            .dwattr $C$DW$290, DW_AT_decl_line(0x40)
    3565                            .dwattr $C$DW$290, DW_AT_decl_column(0x1d)
    3566                            .dwendtag $C$DW$T$54
    3567                    
    3568                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3569                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x40)
    3570                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x10)
    3571                    $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3572                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$54)
    3573                            .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    3574                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3575                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x40)
    3576                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x24)
    3577                    
    3578                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3579                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x10)
    3580                    $C$DW$291       .dwtag  DW_TAG_member
    3581                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$14)
    3582                            .dwattr $C$DW$291, DW_AT_name("quot")
    3583                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("quot")
    3584                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3585                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3586                            .dwattr $C$DW$291, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3587                            .dwattr $C$DW$291, DW_AT_decl_line(0x43)
    3588                            .dwattr $C$DW$291, DW_AT_decl_column(0x1c)
    3589                    $C$DW$292       .dwtag  DW_TAG_member
    3590                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$14)
    3591                            .dwattr $C$DW$292, DW_AT_name("rem")
    3592                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("rem")
    3593                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3594                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3595                            .dwattr $C$DW$292, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3596                            .dwattr $C$DW$292, DW_AT_decl_line(0x43)
    3597                            .dwattr $C$DW$292, DW_AT_decl_column(0x22)
    3598                            .dwendtag $C$DW$T$55
    3599                    
    3600                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3601                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x43)
    3602                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    3603                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3604                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$55)
    3605                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    3606                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3607                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x43)
    3608                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x29)
    3609                    
    3610                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    3611                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x24)
    3612                    $C$DW$293       .dwtag  DW_TAG_member
    3613                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$19)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   76

    3614                            .dwattr $C$DW$293, DW_AT_name("area")
    3615                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("area")
    3616                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3617                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3618                            .dwattr $C$DW$293, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3619                            .dwattr $C$DW$293, DW_AT_decl_line(0x69)
    3620                            .dwattr $C$DW$293, DW_AT_decl_column(0x0d)
    3621                    $C$DW$294       .dwtag  DW_TAG_member
    3622                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$19)
    3623                            .dwattr $C$DW$294, DW_AT_name("xsum")
    3624                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("xsum")
    3625                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3626                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3627                            .dwattr $C$DW$294, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3628                            .dwattr $C$DW$294, DW_AT_decl_line(0x6a)
    3629                            .dwattr $C$DW$294, DW_AT_decl_column(0x0d)
    3630                    $C$DW$295       .dwtag  DW_TAG_member
    3631                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    3632                            .dwattr $C$DW$295, DW_AT_name("ysum")
    3633                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("ysum")
    3634                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3635                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3636                            .dwattr $C$DW$295, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3637                            .dwattr $C$DW$295, DW_AT_decl_line(0x6b)
    3638                            .dwattr $C$DW$295, DW_AT_decl_column(0x0d)
    3639                    $C$DW$296       .dwtag  DW_TAG_member
    3640                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$19)
    3641                            .dwattr $C$DW$296, DW_AT_name("xmin")
    3642                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("xmin")
    3643                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3644                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3645                            .dwattr $C$DW$296, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3646                            .dwattr $C$DW$296, DW_AT_decl_line(0x6d)
    3647                            .dwattr $C$DW$296, DW_AT_decl_column(0x0d)
    3648                    $C$DW$297       .dwtag  DW_TAG_member
    3649                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$19)
    3650                            .dwattr $C$DW$297, DW_AT_name("ymin")
    3651                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("ymin")
    3652                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3653                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3654                            .dwattr $C$DW$297, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3655                            .dwattr $C$DW$297, DW_AT_decl_line(0x6e)
    3656                            .dwattr $C$DW$297, DW_AT_decl_column(0x0d)
    3657                    $C$DW$298       .dwtag  DW_TAG_member
    3658                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    3659                            .dwattr $C$DW$298, DW_AT_name("xmax")
    3660                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("xmax")
    3661                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3662                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3663                            .dwattr $C$DW$298, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3664                            .dwattr $C$DW$298, DW_AT_decl_line(0x6f)
    3665                            .dwattr $C$DW$298, DW_AT_decl_column(0x0d)
    3666                    $C$DW$299       .dwtag  DW_TAG_member
    3667                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$19)
    3668                            .dwattr $C$DW$299, DW_AT_name("ymax")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   77

    3669                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("ymax")
    3670                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3671                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3672                            .dwattr $C$DW$299, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3673                            .dwattr $C$DW$299, DW_AT_decl_line(0x70)
    3674                            .dwattr $C$DW$299, DW_AT_decl_column(0x0d)
    3675                    $C$DW$300       .dwtag  DW_TAG_member
    3676                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$19)
    3677                            .dwattr $C$DW$300, DW_AT_name("seedx")
    3678                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("seedx")
    3679                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3680                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3681                            .dwattr $C$DW$300, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3682                            .dwattr $C$DW$300, DW_AT_decl_line(0x72)
    3683                            .dwattr $C$DW$300, DW_AT_decl_column(0x0d)
    3684                    $C$DW$301       .dwtag  DW_TAG_member
    3685                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$19)
    3686                            .dwattr $C$DW$301, DW_AT_name("seedy")
    3687                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("seedy")
    3688                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3689                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3690                            .dwattr $C$DW$301, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..\
    3691                            .dwattr $C$DW$301, DW_AT_decl_line(0x73)
    3692                            .dwattr $C$DW$301, DW_AT_decl_column(0x0d)
    3693                            .dwendtag $C$DW$T$56
    3694                    
    3695                            .dwattr $C$DW$T$56, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3696                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x68)
    3697                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    3698                    $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    3699                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$56)
    3700                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    3701                            .dwattr $C$DW$T$102, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\.
    3702                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x75)
    3703                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x03)
    3704                    
    3705                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3706                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    3707                    $C$DW$302       .dwtag  DW_TAG_member
    3708                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$8)
    3709                            .dwattr $C$DW$302, DW_AT_name("daylight")
    3710                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("daylight")
    3711                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3712                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3713                            .dwattr $C$DW$302, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3714                            .dwattr $C$DW$302, DW_AT_decl_line(0x52)
    3715                            .dwattr $C$DW$302, DW_AT_decl_column(0x0b)
    3716                    $C$DW$303       .dwtag  DW_TAG_member
    3717                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$10)
    3718                            .dwattr $C$DW$303, DW_AT_name("timezone")
    3719                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("timezone")
    3720                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3721                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3722                            .dwattr $C$DW$303, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3723                            .dwattr $C$DW$303, DW_AT_decl_line(0x53)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   78

    3724                            .dwattr $C$DW$303, DW_AT_decl_column(0x0b)
    3725                    $C$DW$304       .dwtag  DW_TAG_member
    3726                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$57)
    3727                            .dwattr $C$DW$304, DW_AT_name("tzname")
    3728                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("tzname")
    3729                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3730                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3731                            .dwattr $C$DW$304, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3732                            .dwattr $C$DW$304, DW_AT_decl_line(0x54)
    3733                            .dwattr $C$DW$304, DW_AT_decl_column(0x0b)
    3734                    $C$DW$305       .dwtag  DW_TAG_member
    3735                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$57)
    3736                            .dwattr $C$DW$305, DW_AT_name("dstname")
    3737                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("dstname")
    3738                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3739                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3740                            .dwattr $C$DW$305, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3741                            .dwattr $C$DW$305, DW_AT_decl_line(0x55)
    3742                            .dwattr $C$DW$305, DW_AT_decl_column(0x0b)
    3743                            .dwendtag $C$DW$T$58
    3744                    
    3745                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3746                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x51)
    3747                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x01)
    3748                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    3749                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$58)
    3750                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    3751                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3752                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x56)
    3753                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x03)
    3754                    
    3755                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3756                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x20)
    3757                    $C$DW$306       .dwtag  DW_TAG_member
    3758                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$60)
    3759                            .dwattr $C$DW$306, DW_AT_name("val")
    3760                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("val")
    3761                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3762                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3763                            .dwattr $C$DW$306, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\../
    3764                            .dwattr $C$DW$306, DW_AT_decl_line(0x25)
    3765                            .dwattr $C$DW$306, DW_AT_decl_column(0x0c)
    3766                            .dwendtag $C$DW$T$61
    3767                    
    3768                            .dwattr $C$DW$T$61, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\..
    3769                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x24)
    3770                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x10)
    3771                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("RotationMatrix")
    3772                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$61)
    3773                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    3774                            .dwattr $C$DW$T$104, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\.
    3775                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x26)
    3776                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x02)
    3777                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3778                            .dwattr $C$DW$T$2, DW_AT_name("void")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   79

    3779                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3780                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3781                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3782                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    3783                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$3)
    3784                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    3785                            .dwattr $C$DW$T$105, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\.
    3786                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x5c)
    3787                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x19)
    3788                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3789                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3790                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3791                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3792                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3793                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3794                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3795                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3796                    $C$DW$T$132     .dwtag  DW_TAG_pointer_type
    3797                            .dwattr $C$DW$T$132, DW_AT_type(*$C$DW$T$5)
    3798                            .dwattr $C$DW$T$132, DW_AT_address_class(0x20)
    3799                    $C$DW$T$39      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    3800                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$5)
    3801                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3802                            .dwattr $C$DW$T$39, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3803                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x2a)
    3804                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x1d)
    3805                    $C$DW$T$40      .dwtag  DW_TAG_pointer_type
    3806                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
    3807                            .dwattr $C$DW$T$40, DW_AT_address_class(0x20)
    3808                    $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    3809                            .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$39)
    3810                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    3811                            .dwattr $C$DW$T$144, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3812                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x39)
    3813                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x17)
    3814                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3815                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3816                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3817                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3818                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3819                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$6)
    3820                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    3821                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    3822                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    3823                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    3824                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3825                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x2b)
    3826                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x1c)
    3827                    $C$DW$T$32      .dwtag  DW_TAG_pointer_type
    3828                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$20)
    3829                            .dwattr $C$DW$T$32, DW_AT_address_class(0x20)
    3830                    
    3831                    $C$DW$T$43      .dwtag  DW_TAG_array_type
    3832                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$20)
    3833                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   80

    3834                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x20)
    3835                    $C$DW$307       .dwtag  DW_TAG_subrange_type
    3836                            .dwattr $C$DW$307, DW_AT_upper_bound(0x1f)
    3837                            .dwendtag $C$DW$T$43
    3838                    
    3839                    $C$DW$T$146     .dwtag  DW_TAG_const_type
    3840                            .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$20)
    3841                    $C$DW$T$147     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    3842                            .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$20)
    3843                            .dwattr $C$DW$T$147, DW_AT_language(DW_LANG_C)
    3844                            .dwattr $C$DW$T$147, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3845                            .dwattr $C$DW$T$147, DW_AT_decl_line(0x3a)
    3846                            .dwattr $C$DW$T$147, DW_AT_decl_column(0x16)
    3847                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3848                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3849                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3850                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3851                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3852                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3853                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3854                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3855                    $C$DW$T$33      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3856                            .dwattr $C$DW$T$33, DW_AT_type(*$C$DW$T$8)
    3857                            .dwattr $C$DW$T$33, DW_AT_language(DW_LANG_C)
    3858                            .dwattr $C$DW$T$33, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3859                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x2c)
    3860                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x1d)
    3861                    $C$DW$T$34      .dwtag  DW_TAG_pointer_type
    3862                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$33)
    3863                            .dwattr $C$DW$T$34, DW_AT_address_class(0x20)
    3864                    $C$DW$T$149     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    3865                            .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$33)
    3866                            .dwattr $C$DW$T$149, DW_AT_language(DW_LANG_C)
    3867                            .dwattr $C$DW$T$149, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3868                            .dwattr $C$DW$T$149, DW_AT_decl_line(0x3c)
    3869                            .dwattr $C$DW$T$149, DW_AT_decl_column(0x17)
    3870                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3871                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3872                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3873                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3874                    $C$DW$T$150     .dwtag  DW_TAG_pointer_type
    3875                            .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$9)
    3876                            .dwattr $C$DW$T$150, DW_AT_address_class(0x20)
    3877                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3878                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$9)
    3879                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    3880                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3881                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2d)
    3882                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x1c)
    3883                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    3884                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    3885                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    3886                    $C$DW$T$152     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    3887                            .dwattr $C$DW$T$152, DW_AT_type(*$C$DW$T$48)
    3888                            .dwattr $C$DW$T$152, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   81

    3889                            .dwattr $C$DW$T$152, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3890                            .dwattr $C$DW$T$152, DW_AT_decl_line(0x3d)
    3891                            .dwattr $C$DW$T$152, DW_AT_decl_column(0x16)
    3892                    $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3893                            .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$9)
    3894                            .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    3895                            .dwattr $C$DW$T$151, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3896                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x53)
    3897                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x1a)
    3898                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3899                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3900                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3901                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3902                    $C$DW$T$168     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    3903                            .dwattr $C$DW$T$168, DW_AT_type(*$C$DW$T$10)
    3904                            .dwattr $C$DW$T$168, DW_AT_language(DW_LANG_C)
    3905                            .dwattr $C$DW$T$168, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3906                            .dwattr $C$DW$T$168, DW_AT_decl_line(0x53)
    3907                            .dwattr $C$DW$T$168, DW_AT_decl_column(0x0d)
    3908                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3909                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$10)
    3910                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    3911                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3912                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2e)
    3913                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1d)
    3914                    $C$DW$T$162     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    3915                            .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$19)
    3916                            .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    3917                            .dwattr $C$DW$T$162, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_ORB_bestFeaturesToFront\.
    3918                            .dwattr $C$DW$T$162, DW_AT_decl_line(0x77)
    3919                            .dwattr $C$DW$T$162, DW_AT_decl_column(0x11)
    3920                    
    3921                    $C$DW$T$22      .dwtag  DW_TAG_array_type
    3922                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$19)
    3923                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    3924                            .dwattr $C$DW$T$22, DW_AT_byte_size(0x2000)
    3925                    $C$DW$308       .dwtag  DW_TAG_subrange_type
    3926                            .dwattr $C$DW$308, DW_AT_upper_bound(0x7ff)
    3927                            .dwendtag $C$DW$T$22
    3928                    
    3929                    
    3930                    $C$DW$T$23      .dwtag  DW_TAG_array_type
    3931                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$19)
    3932                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3933                            .dwattr $C$DW$T$23, DW_AT_byte_size(0x3c000)
    3934                    $C$DW$309       .dwtag  DW_TAG_subrange_type
    3935                            .dwattr $C$DW$309, DW_AT_upper_bound(0x1d)
    3936                    $C$DW$310       .dwtag  DW_TAG_subrange_type
    3937                            .dwattr $C$DW$310, DW_AT_upper_bound(0x7ff)
    3938                            .dwendtag $C$DW$T$23
    3939                    
    3940                    
    3941                    $C$DW$T$24      .dwtag  DW_TAG_array_type
    3942                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$19)
    3943                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   82

    3944                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x1000)
    3945                    $C$DW$311       .dwtag  DW_TAG_subrange_type
    3946                            .dwattr $C$DW$311, DW_AT_upper_bound(0x3ff)
    3947                            .dwendtag $C$DW$T$24
    3948                    
    3949                    
    3950                    $C$DW$T$25      .dwtag  DW_TAG_array_type
    3951                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$19)
    3952                            .dwattr $C$DW$T$25, DW_AT_language(DW_LANG_C)
    3953                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x1e000)
    3954                    $C$DW$312       .dwtag  DW_TAG_subrange_type
    3955                            .dwattr $C$DW$312, DW_AT_upper_bound(0x1d)
    3956                    $C$DW$313       .dwtag  DW_TAG_subrange_type
    3957                            .dwattr $C$DW$313, DW_AT_upper_bound(0x3ff)
    3958                            .dwendtag $C$DW$T$25
    3959                    
    3960                    
    3961                    $C$DW$T$27      .dwtag  DW_TAG_array_type
    3962                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$19)
    3963                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    3964                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x1e0)
    3965                    $C$DW$314       .dwtag  DW_TAG_subrange_type
    3966                            .dwattr $C$DW$314, DW_AT_upper_bound(0x77)
    3967                            .dwendtag $C$DW$T$27
    3968                    
    3969                    
    3970                    $C$DW$T$28      .dwtag  DW_TAG_array_type
    3971                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$19)
    3972                            .dwattr $C$DW$T$28, DW_AT_language(DW_LANG_C)
    3973                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x40)
    3974                    $C$DW$315       .dwtag  DW_TAG_subrange_type
    3975                            .dwattr $C$DW$315, DW_AT_upper_bound(0x0f)
    3976                            .dwendtag $C$DW$T$28
    3977                    
    3978                    
    3979                    $C$DW$T$62      .dwtag  DW_TAG_array_type
    3980                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$19)
    3981                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3982                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x10)
    3983                    $C$DW$316       .dwtag  DW_TAG_subrange_type
    3984                            .dwattr $C$DW$316, DW_AT_upper_bound(0x03)
    3985                            .dwendtag $C$DW$T$62
    3986                    
    3987                    $C$DW$T$128     .dwtag  DW_TAG_pointer_type
    3988                            .dwattr $C$DW$T$128, DW_AT_type(*$C$DW$T$19)
    3989                            .dwattr $C$DW$T$128, DW_AT_address_class(0x20)
    3990                    $C$DW$T$163     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    3991                            .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$19)
    3992                            .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    3993                            .dwattr $C$DW$T$163, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3994                            .dwattr $C$DW$T$163, DW_AT_decl_line(0x4b)
    3995                            .dwattr $C$DW$T$163, DW_AT_decl_column(0x17)
    3996                    $C$DW$T$164     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    3997                            .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$19)
    3998                            .dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:43:44 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_ORB_bestFeaturesToFront/VLIB_ORB_bestFeaturesToFront_d.se66 PAGE   83

    3999                            .dwattr $C$DW$T$164, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4000                            .dwattr $C$DW$T$164, DW_AT_decl_line(0x4e)
    4001                            .dwattr $C$DW$T$164, DW_AT_decl_column(0x17)
    4002                    $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    4003                            .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$19)
    4004                            .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
    4005                            .dwattr $C$DW$T$165, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
