TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Thu Mar 19 12:44:55 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

     622                            .dwattr $C$DW$28, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     623                            .dwattr $C$DW$28, DW_AT_decl_line(0x87)
     624                            .dwattr $C$DW$28, DW_AT_decl_column(0x05)
     625                    $C$DW$29        .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERR_NOT_IMPLEMENTED"), DW_AT_const_value(0
     626                            .dwattr $C$DW$29, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     627                            .dwattr $C$DW$29, DW_AT_decl_line(0x88)
     628                            .dwattr $C$DW$29, DW_AT_decl_column(0x05)
     629                    $C$DW$30        .dwtag  DW_TAG_enumerator, DW_AT_name("VLIB_ERROR_MAX"), DW_AT_const_value(0x0f)
     630                            .dwattr $C$DW$30, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     631                            .dwattr $C$DW$30, DW_AT_decl_line(0x89)
     632                            .dwattr $C$DW$30, DW_AT_decl_column(0x05)
     633                            .dwendtag $C$DW$T$39
     634                    
     635                            .dwattr $C$DW$T$39, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7
     636                            .dwattr $C$DW$T$39, DW_AT_decl_line(0x79)
     637                            .dwattr $C$DW$T$39, DW_AT_decl_column(0x0e)
     638                    $C$DW$T$40      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_STATUS")
     639                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$39)
     640                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
     641                            .dwattr $C$DW$T$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7
     642                            .dwattr $C$DW$T$40, DW_AT_decl_line(0x8a)
     643                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x03)
     644                    
     645                    $C$DW$T$41      .dwtag  DW_TAG_enumeration_type
     646                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x04)
     647                    $C$DW$31        .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_OPT"), DW_AT_const_value(0x00)
     648                            .dwattr $C$DW$31, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     649                            .dwattr $C$DW$31, DW_AT_decl_line(0x6a)
     650                            .dwattr $C$DW$31, DW_AT_decl_column(0x05)
     651                    $C$DW$32        .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CN"), DW_AT_const_value(0x01)
     652                            .dwattr $C$DW$32, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     653                            .dwattr $C$DW$32, DW_AT_decl_line(0x6b)
     654                            .dwattr $C$DW$32, DW_AT_decl_column(0x05)
     655                    $C$DW$33        .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CNT"), DW_AT_const_value(0x02)
     656                            .dwattr $C$DW$33, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     657                            .dwattr $C$DW$33, DW_AT_decl_line(0x6c)
     658                            .dwattr $C$DW$33, DW_AT_decl_column(0x05)
     659                            .dwendtag $C$DW$T$41
     660                    
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   13

     661                            .dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7
     662                            .dwattr $C$DW$T$41, DW_AT_decl_line(0x69)
     663                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x06)
     664                    
     665                    $C$DW$T$42      .dwtag  DW_TAG_enumeration_type
     666                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x04)
     667                    $C$DW$34        .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
     668                            .dwattr $C$DW$34, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     669                            .dwattr $C$DW$34, DW_AT_decl_line(0x72)
     670                            .dwattr $C$DW$34, DW_AT_decl_column(0x05)
     671                    $C$DW$35        .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
     672                            .dwattr $C$DW$35, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     673                            .dwattr $C$DW$35, DW_AT_decl_line(0x73)
     674                            .dwattr $C$DW$35, DW_AT_decl_column(0x05)
     675                            .dwendtag $C$DW$T$42
     676                    
     677                            .dwattr $C$DW$T$42, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7
     678                            .dwattr $C$DW$T$42, DW_AT_decl_line(0x71)
     679                            .dwattr $C$DW$T$42, DW_AT_decl_column(0x06)
     680                    
     681                    $C$DW$T$26      .dwtag  DW_TAG_structure_type
     682                            .dwattr $C$DW$T$26, DW_AT_byte_size(0x3c)
     683                    $C$DW$36        .dwtag  DW_TAG_member
     684                            .dwattr $C$DW$36, DW_AT_type(*$C$DW$T$19)
     685                            .dwattr $C$DW$36, DW_AT_name("testPattern")
     686                            .dwattr $C$DW$36, DW_AT_TI_symbol_name("testPattern")
     687                            .dwattr $C$DW$36, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     688                            .dwattr $C$DW$36, DW_AT_accessibility(DW_ACCESS_public)
     689                            .dwattr $C$DW$36, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     690                            .dwattr $C$DW$36, DW_AT_decl_line(0x24)
     691                            .dwattr $C$DW$36, DW_AT_decl_column(0x0f)
     692                    $C$DW$37        .dwtag  DW_TAG_member
     693                            .dwattr $C$DW$37, DW_AT_type(*$C$DW$T$20)
     694                            .dwattr $C$DW$37, DW_AT_name("staticIn1")
     695                            .dwattr $C$DW$37, DW_AT_TI_symbol_name("staticIn1")
     696                            .dwattr $C$DW$37, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     697                            .dwattr $C$DW$37, DW_AT_accessibility(DW_ACCESS_public)
     698                            .dwattr $C$DW$37, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     699                            .dwattr $C$DW$37, DW_AT_decl_line(0x25)
     700                            .dwattr $C$DW$37, DW_AT_decl_column(0x0f)
     701                    $C$DW$38        .dwtag  DW_TAG_member
     702                            .dwattr $C$DW$38, DW_AT_type(*$C$DW$T$20)
     703                            .dwattr $C$DW$38, DW_AT_name("staticIn2")
     704                            .dwattr $C$DW$38, DW_AT_TI_symbol_name("staticIn2")
     705                            .dwattr $C$DW$38, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     706                            .dwattr $C$DW$38, DW_AT_accessibility(DW_ACCESS_public)
     707                            .dwattr $C$DW$38, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     708                            .dwattr $C$DW$38, DW_AT_decl_line(0x26)
     709                            .dwattr $C$DW$38, DW_AT_decl_column(0x0f)
     710                    $C$DW$39        .dwtag  DW_TAG_member
     711                            .dwattr $C$DW$39, DW_AT_type(*$C$DW$T$21)
     712                            .dwattr $C$DW$39, DW_AT_name("width")
     713                            .dwattr $C$DW$39, DW_AT_TI_symbol_name("width")
     714                            .dwattr $C$DW$39, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     715                            .dwattr $C$DW$39, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   14

     716                            .dwattr $C$DW$39, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     717                            .dwattr $C$DW$39, DW_AT_decl_line(0x27)
     718                            .dwattr $C$DW$39, DW_AT_decl_column(0x0f)
     719                    $C$DW$40        .dwtag  DW_TAG_member
     720                            .dwattr $C$DW$40, DW_AT_type(*$C$DW$T$21)
     721                            .dwattr $C$DW$40, DW_AT_name("height")
     722                            .dwattr $C$DW$40, DW_AT_TI_symbol_name("height")
     723                            .dwattr $C$DW$40, DW_AT_data_member_location[DW_OP_plus_uconst 0xe]
     724                            .dwattr $C$DW$40, DW_AT_accessibility(DW_ACCESS_public)
     725                            .dwattr $C$DW$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     726                            .dwattr $C$DW$40, DW_AT_decl_line(0x28)
     727                            .dwattr $C$DW$40, DW_AT_decl_column(0x0f)
     728                    $C$DW$41        .dwtag  DW_TAG_member
     729                            .dwattr $C$DW$41, DW_AT_type(*$C$DW$T$22)
     730                            .dwattr $C$DW$41, DW_AT_name("imgGradPitch")
     731                            .dwattr $C$DW$41, DW_AT_TI_symbol_name("imgGradPitch")
     732                            .dwattr $C$DW$41, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     733                            .dwattr $C$DW$41, DW_AT_accessibility(DW_ACCESS_public)
     734                            .dwattr $C$DW$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     735                            .dwattr $C$DW$41, DW_AT_decl_line(0x29)
     736                            .dwattr $C$DW$41, DW_AT_decl_column(0x0f)
     737                    $C$DW$42        .dwtag  DW_TAG_member
     738                            .dwattr $C$DW$42, DW_AT_type(*$C$DW$T$22)
     739                            .dwattr $C$DW$42, DW_AT_name("nfeatures")
     740                            .dwattr $C$DW$42, DW_AT_TI_symbol_name("nfeatures")
     741                            .dwattr $C$DW$42, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     742                            .dwattr $C$DW$42, DW_AT_accessibility(DW_ACCESS_public)
     743                            .dwattr $C$DW$42, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     744                            .dwattr $C$DW$42, DW_AT_decl_line(0x2a)
     745                            .dwattr $C$DW$42, DW_AT_decl_column(0x0f)
     746                    $C$DW$43        .dwtag  DW_TAG_member
     747                            .dwattr $C$DW$43, DW_AT_type(*$C$DW$T$23)
     748                            .dwattr $C$DW$43, DW_AT_name("x")
     749                            .dwattr $C$DW$43, DW_AT_TI_symbol_name("x")
     750                            .dwattr $C$DW$43, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
     751                            .dwattr $C$DW$43, DW_AT_accessibility(DW_ACCESS_public)
     752                            .dwattr $C$DW$43, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     753                            .dwattr $C$DW$43, DW_AT_decl_line(0x2b)
     754                            .dwattr $C$DW$43, DW_AT_decl_column(0x0f)
     755                    $C$DW$44        .dwtag  DW_TAG_member
     756                            .dwattr $C$DW$44, DW_AT_type(*$C$DW$T$23)
     757                            .dwattr $C$DW$44, DW_AT_name("y")
     758                            .dwattr $C$DW$44, DW_AT_TI_symbol_name("y")
     759                            .dwattr $C$DW$44, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
     760                            .dwattr $C$DW$44, DW_AT_accessibility(DW_ACCESS_public)
     761                            .dwattr $C$DW$44, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     762                            .dwattr $C$DW$44, DW_AT_decl_line(0x2c)
     763                            .dwattr $C$DW$44, DW_AT_decl_column(0x0f)
     764                    $C$DW$45        .dwtag  DW_TAG_member
     765                            .dwattr $C$DW$45, DW_AT_type(*$C$DW$T$23)
     766                            .dwattr $C$DW$45, DW_AT_name("outx")
     767                            .dwattr $C$DW$45, DW_AT_TI_symbol_name("outx")
     768                            .dwattr $C$DW$45, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
     769                            .dwattr $C$DW$45, DW_AT_accessibility(DW_ACCESS_public)
     770                            .dwattr $C$DW$45, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   15

     771                            .dwattr $C$DW$45, DW_AT_decl_line(0x2d)
     772                            .dwattr $C$DW$45, DW_AT_decl_column(0x0f)
     773                    $C$DW$46        .dwtag  DW_TAG_member
     774                            .dwattr $C$DW$46, DW_AT_type(*$C$DW$T$23)
     775                            .dwattr $C$DW$46, DW_AT_name("outy")
     776                            .dwattr $C$DW$46, DW_AT_TI_symbol_name("outy")
     777                            .dwattr $C$DW$46, DW_AT_data_member_location[DW_OP_plus_uconst 0x24]
     778                            .dwattr $C$DW$46, DW_AT_accessibility(DW_ACCESS_public)
     779                            .dwattr $C$DW$46, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     780                            .dwattr $C$DW$46, DW_AT_decl_line(0x2e)
     781                            .dwattr $C$DW$46, DW_AT_decl_column(0x0f)
     782                    $C$DW$47        .dwtag  DW_TAG_member
     783                            .dwattr $C$DW$47, DW_AT_type(*$C$DW$T$23)
     784                            .dwattr $C$DW$47, DW_AT_name("outError")
     785                            .dwattr $C$DW$47, DW_AT_TI_symbol_name("outError")
     786                            .dwattr $C$DW$47, DW_AT_data_member_location[DW_OP_plus_uconst 0x28]
     787                            .dwattr $C$DW$47, DW_AT_accessibility(DW_ACCESS_public)
     788                            .dwattr $C$DW$47, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     789                            .dwattr $C$DW$47, DW_AT_decl_line(0x2f)
     790                            .dwattr $C$DW$47, DW_AT_decl_column(0x0f)
     791                    $C$DW$48        .dwtag  DW_TAG_member
     792                            .dwattr $C$DW$48, DW_AT_type(*$C$DW$T$22)
     793                            .dwattr $C$DW$48, DW_AT_name("max_iters")
     794                            .dwattr $C$DW$48, DW_AT_TI_symbol_name("max_iters")
     795                            .dwattr $C$DW$48, DW_AT_data_member_location[DW_OP_plus_uconst 0x2c]
     796                            .dwattr $C$DW$48, DW_AT_accessibility(DW_ACCESS_public)
     797                            .dwattr $C$DW$48, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     798                            .dwattr $C$DW$48, DW_AT_decl_line(0x30)
     799                            .dwattr $C$DW$48, DW_AT_decl_column(0x0f)
     800                    $C$DW$49        .dwtag  DW_TAG_member
     801                            .dwattr $C$DW$49, DW_AT_type(*$C$DW$T$22)
     802                            .dwattr $C$DW$49, DW_AT_name("earlyExitTh")
     803                            .dwattr $C$DW$49, DW_AT_TI_symbol_name("earlyExitTh")
     804                            .dwattr $C$DW$49, DW_AT_data_member_location[DW_OP_plus_uconst 0x30]
     805                            .dwattr $C$DW$49, DW_AT_accessibility(DW_ACCESS_public)
     806                            .dwattr $C$DW$49, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     807                            .dwattr $C$DW$49, DW_AT_decl_line(0x31)
     808                            .dwattr $C$DW$49, DW_AT_decl_column(0x0f)
     809                    $C$DW$50        .dwtag  DW_TAG_member
     810                            .dwattr $C$DW$50, DW_AT_type(*$C$DW$T$19)
     811                            .dwattr $C$DW$50, DW_AT_name("gradFlag")
     812                            .dwattr $C$DW$50, DW_AT_TI_symbol_name("gradFlag")
     813                            .dwattr $C$DW$50, DW_AT_data_member_location[DW_OP_plus_uconst 0x34]
     814                            .dwattr $C$DW$50, DW_AT_accessibility(DW_ACCESS_public)
     815                            .dwattr $C$DW$50, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     816                            .dwattr $C$DW$50, DW_AT_decl_line(0x32)
     817                            .dwattr $C$DW$50, DW_AT_decl_column(0x0f)
     818                    $C$DW$51        .dwtag  DW_TAG_member
     819                            .dwattr $C$DW$51, DW_AT_type(*$C$DW$T$19)
     820                            .dwattr $C$DW$51, DW_AT_name("outEstFlag")
     821                            .dwattr $C$DW$51, DW_AT_TI_symbol_name("outEstFlag")
     822                            .dwattr $C$DW$51, DW_AT_data_member_location[DW_OP_plus_uconst 0x35]
     823                            .dwattr $C$DW$51, DW_AT_accessibility(DW_ACCESS_public)
     824                            .dwattr $C$DW$51, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     825                            .dwattr $C$DW$51, DW_AT_decl_line(0x33)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   16

     826                            .dwattr $C$DW$51, DW_AT_decl_column(0x0f)
     827                    $C$DW$52        .dwtag  DW_TAG_member
     828                            .dwattr $C$DW$52, DW_AT_type(*$C$DW$T$25)
     829                            .dwattr $C$DW$52, DW_AT_name("desc")
     830                            .dwattr $C$DW$52, DW_AT_TI_symbol_name("desc")
     831                            .dwattr $C$DW$52, DW_AT_data_member_location[DW_OP_plus_uconst 0x38]
     832                            .dwattr $C$DW$52, DW_AT_accessibility(DW_ACCESS_public)
     833                            .dwattr $C$DW$52, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
     834                            .dwattr $C$DW$52, DW_AT_decl_line(0x34)
     835                            .dwattr $C$DW$52, DW_AT_decl_column(0x0f)
     836                            .dwendtag $C$DW$T$26
     837                    
     838                            .dwattr $C$DW$T$26, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7
     839                            .dwattr $C$DW$T$26, DW_AT_decl_line(0x23)
     840                            .dwattr $C$DW$T$26, DW_AT_decl_column(0x10)
     841                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("trackFeaturesLK_7x7_testParams_t")
     842                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$26)
     843                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
     844                            .dwattr $C$DW$T$47, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7
     845                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x35)
     846                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x03)
     847                    $C$DW$T$48      .dwtag  DW_TAG_pointer_type
     848                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
     849                            .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
     850                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
     851                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
     852                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
     853                    $C$DW$T$50      .dwtag  DW_TAG_const_type
     854                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$49)
     855                    
     856                    $C$DW$T$51      .dwtag  DW_TAG_array_type
     857                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$47)
     858                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
     859                            .dwattr $C$DW$T$51, DW_AT_byte_size(0x348)
     860                    $C$DW$53        .dwtag  DW_TAG_subrange_type
     861                            .dwattr $C$DW$53, DW_AT_upper_bound(0x0d)
     862                            .dwendtag $C$DW$T$51
     863                    
     864                    
     865                    $C$DW$T$28      .dwtag  DW_TAG_structure_type
     866                            .dwattr $C$DW$T$28, DW_AT_byte_size(0x18)
     867                    $C$DW$54        .dwtag  DW_TAG_member
     868                            .dwattr $C$DW$54, DW_AT_type(*$C$DW$T$10)
     869                            .dwattr $C$DW$54, DW_AT_name("fd")
     870                            .dwattr $C$DW$54, DW_AT_TI_symbol_name("fd")
     871                            .dwattr $C$DW$54, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     872                            .dwattr $C$DW$54, DW_AT_accessibility(DW_ACCESS_public)
     873                            .dwattr $C$DW$54, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
     874                            .dwattr $C$DW$54, DW_AT_decl_line(0x49)
     875                            .dwattr $C$DW$54, DW_AT_decl_column(0x0b)
     876                    $C$DW$55        .dwtag  DW_TAG_member
     877                            .dwattr $C$DW$55, DW_AT_type(*$C$DW$T$27)
     878                            .dwattr $C$DW$55, DW_AT_name("buf")
     879                            .dwattr $C$DW$55, DW_AT_TI_symbol_name("buf")
     880                            .dwattr $C$DW$55, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   17

     881                            .dwattr $C$DW$55, DW_AT_accessibility(DW_ACCESS_public)
     882                            .dwattr $C$DW$55, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
     883                            .dwattr $C$DW$55, DW_AT_decl_line(0x4a)
     884                            .dwattr $C$DW$55, DW_AT_decl_column(0x16)
     885                    $C$DW$56        .dwtag  DW_TAG_member
     886                            .dwattr $C$DW$56, DW_AT_type(*$C$DW$T$27)
     887                            .dwattr $C$DW$56, DW_AT_name("pos")
     888                            .dwattr $C$DW$56, DW_AT_TI_symbol_name("pos")
     889                            .dwattr $C$DW$56, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
     890                            .dwattr $C$DW$56, DW_AT_accessibility(DW_ACCESS_public)
     891                            .dwattr $C$DW$56, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
     892                            .dwattr $C$DW$56, DW_AT_decl_line(0x4b)
     893                            .dwattr $C$DW$56, DW_AT_decl_column(0x16)
     894                    $C$DW$57        .dwtag  DW_TAG_member
     895                            .dwattr $C$DW$57, DW_AT_type(*$C$DW$T$27)
     896                            .dwattr $C$DW$57, DW_AT_name("bufend")
     897                            .dwattr $C$DW$57, DW_AT_TI_symbol_name("bufend")
     898                            .dwattr $C$DW$57, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
     899                            .dwattr $C$DW$57, DW_AT_accessibility(DW_ACCESS_public)
     900                            .dwattr $C$DW$57, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
     901                            .dwattr $C$DW$57, DW_AT_decl_line(0x4c)
     902                            .dwattr $C$DW$57, DW_AT_decl_column(0x16)
     903                    $C$DW$58        .dwtag  DW_TAG_member
     904                            .dwattr $C$DW$58, DW_AT_type(*$C$DW$T$27)
     905                            .dwattr $C$DW$58, DW_AT_name("buff_stop")
     906                            .dwattr $C$DW$58, DW_AT_TI_symbol_name("buff_stop")
     907                            .dwattr $C$DW$58, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
     908                            .dwattr $C$DW$58, DW_AT_accessibility(DW_ACCESS_public)
     909                            .dwattr $C$DW$58, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
     910                            .dwattr $C$DW$58, DW_AT_decl_line(0x4d)
     911                            .dwattr $C$DW$58, DW_AT_decl_column(0x16)
     912                    $C$DW$59        .dwtag  DW_TAG_member
     913                            .dwattr $C$DW$59, DW_AT_type(*$C$DW$T$11)
     914                            .dwattr $C$DW$59, DW_AT_name("flags")
     915                            .dwattr $C$DW$59, DW_AT_TI_symbol_name("flags")
     916                            .dwattr $C$DW$59, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
     917                            .dwattr $C$DW$59, DW_AT_accessibility(DW_ACCESS_public)
     918                            .dwattr $C$DW$59, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
     919                            .dwattr $C$DW$59, DW_AT_decl_line(0x4e)
     920                            .dwattr $C$DW$59, DW_AT_decl_column(0x16)
     921                            .dwendtag $C$DW$T$28
     922                    
     923                            .dwattr $C$DW$T$28, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
     924                            .dwattr $C$DW$T$28, DW_AT_decl_line(0x48)
     925                            .dwattr $C$DW$T$28, DW_AT_decl_column(0x10)
     926                    $C$DW$T$52      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
     927                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$28)
     928                            .dwattr $C$DW$T$52, DW_AT_language(DW_LANG_C)
     929                            .dwattr $C$DW$T$52, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
     930                            .dwattr $C$DW$T$52, DW_AT_decl_line(0x4f)
     931                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x03)
     932                    
     933                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
     934                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x08)
     935                    $C$DW$60        .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   18

     936                            .dwattr $C$DW$60, DW_AT_type(*$C$DW$T$10)
     937                            .dwattr $C$DW$60, DW_AT_name("quot")
     938                            .dwattr $C$DW$60, DW_AT_TI_symbol_name("quot")
     939                            .dwattr $C$DW$60, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     940                            .dwattr $C$DW$60, DW_AT_accessibility(DW_ACCESS_public)
     941                            .dwattr $C$DW$60, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
     942                            .dwattr $C$DW$60, DW_AT_decl_line(0x3e)
     943                            .dwattr $C$DW$60, DW_AT_decl_column(0x16)
     944                    $C$DW$61        .dwtag  DW_TAG_member
     945                            .dwattr $C$DW$61, DW_AT_type(*$C$DW$T$10)
     946                            .dwattr $C$DW$61, DW_AT_name("rem")
     947                            .dwattr $C$DW$61, DW_AT_TI_symbol_name("rem")
     948                            .dwattr $C$DW$61, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     949                            .dwattr $C$DW$61, DW_AT_accessibility(DW_ACCESS_public)
     950                            .dwattr $C$DW$61, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
     951                            .dwattr $C$DW$61, DW_AT_decl_line(0x3e)
     952                            .dwattr $C$DW$61, DW_AT_decl_column(0x1c)
     953                            .dwendtag $C$DW$T$29
     954                    
     955                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
     956                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x3e)
     957                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
     958                    $C$DW$T$53      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
     959                            .dwattr $C$DW$T$53, DW_AT_type(*$C$DW$T$29)
     960                            .dwattr $C$DW$T$53, DW_AT_language(DW_LANG_C)
     961                            .dwattr $C$DW$T$53, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
     962                            .dwattr $C$DW$T$53, DW_AT_decl_line(0x3e)
     963                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x23)
     964                    
     965                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
     966                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
     967                    $C$DW$62        .dwtag  DW_TAG_member
     968                            .dwattr $C$DW$62, DW_AT_type(*$C$DW$T$10)
     969                            .dwattr $C$DW$62, DW_AT_name("quot")
     970                            .dwattr $C$DW$62, DW_AT_TI_symbol_name("quot")
     971                            .dwattr $C$DW$62, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
     972                            .dwattr $C$DW$62, DW_AT_accessibility(DW_ACCESS_public)
     973                            .dwattr $C$DW$62, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
     974                            .dwattr $C$DW$62, DW_AT_decl_line(0x40)
     975                            .dwattr $C$DW$62, DW_AT_decl_column(0x17)
     976                    $C$DW$63        .dwtag  DW_TAG_member
     977                            .dwattr $C$DW$63, DW_AT_type(*$C$DW$T$10)
     978                            .dwattr $C$DW$63, DW_AT_name("rem")
     979                            .dwattr $C$DW$63, DW_AT_TI_symbol_name("rem")
     980                            .dwattr $C$DW$63, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
     981                            .dwattr $C$DW$63, DW_AT_accessibility(DW_ACCESS_public)
     982                            .dwattr $C$DW$63, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
     983                            .dwattr $C$DW$63, DW_AT_decl_line(0x40)
     984                            .dwattr $C$DW$63, DW_AT_decl_column(0x1d)
     985                            .dwendtag $C$DW$T$30
     986                    
     987                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
     988                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x40)
     989                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
     990                    $C$DW$T$54      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   19

     991                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$30)
     992                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
     993                            .dwattr $C$DW$T$54, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
     994                            .dwattr $C$DW$T$54, DW_AT_decl_line(0x40)
     995                            .dwattr $C$DW$T$54, DW_AT_decl_column(0x24)
     996                    
     997                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
     998                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x10)
     999                    $C$DW$64        .dwtag  DW_TAG_member
    1000                            .dwattr $C$DW$64, DW_AT_type(*$C$DW$T$14)
    1001                            .dwattr $C$DW$64, DW_AT_name("quot")
    1002                            .dwattr $C$DW$64, DW_AT_TI_symbol_name("quot")
    1003                            .dwattr $C$DW$64, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1004                            .dwattr $C$DW$64, DW_AT_accessibility(DW_ACCESS_public)
    1005                            .dwattr $C$DW$64, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1006                            .dwattr $C$DW$64, DW_AT_decl_line(0x43)
    1007                            .dwattr $C$DW$64, DW_AT_decl_column(0x1c)
    1008                    $C$DW$65        .dwtag  DW_TAG_member
    1009                            .dwattr $C$DW$65, DW_AT_type(*$C$DW$T$14)
    1010                            .dwattr $C$DW$65, DW_AT_name("rem")
    1011                            .dwattr $C$DW$65, DW_AT_TI_symbol_name("rem")
    1012                            .dwattr $C$DW$65, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1013                            .dwattr $C$DW$65, DW_AT_accessibility(DW_ACCESS_public)
    1014                            .dwattr $C$DW$65, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1015                            .dwattr $C$DW$65, DW_AT_decl_line(0x43)
    1016                            .dwattr $C$DW$65, DW_AT_decl_column(0x22)
    1017                            .dwendtag $C$DW$T$31
    1018                    
    1019                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1020                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x43)
    1021                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    1022                    $C$DW$T$55      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    1023                            .dwattr $C$DW$T$55, DW_AT_type(*$C$DW$T$31)
    1024                            .dwattr $C$DW$T$55, DW_AT_language(DW_LANG_C)
    1025                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1026                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x43)
    1027                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x29)
    1028                    
    1029                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    1030                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x24)
    1031                    $C$DW$66        .dwtag  DW_TAG_member
    1032                            .dwattr $C$DW$66, DW_AT_type(*$C$DW$T$32)
    1033                            .dwattr $C$DW$66, DW_AT_name("area")
    1034                            .dwattr $C$DW$66, DW_AT_TI_symbol_name("area")
    1035                            .dwattr $C$DW$66, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1036                            .dwattr $C$DW$66, DW_AT_accessibility(DW_ACCESS_public)
    1037                            .dwattr $C$DW$66, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
    1038                            .dwattr $C$DW$66, DW_AT_decl_line(0x69)
    1039                            .dwattr $C$DW$66, DW_AT_decl_column(0x0d)
    1040                    $C$DW$67        .dwtag  DW_TAG_member
    1041                            .dwattr $C$DW$67, DW_AT_type(*$C$DW$T$32)
    1042                            .dwattr $C$DW$67, DW_AT_name("xsum")
    1043                            .dwattr $C$DW$67, DW_AT_TI_symbol_name("xsum")
    1044                            .dwattr $C$DW$67, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1045                            .dwattr $C$DW$67, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   20

    1046                            .dwattr $C$DW$67, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
    1047                            .dwattr $C$DW$67, DW_AT_decl_line(0x6a)
    1048                            .dwattr $C$DW$67, DW_AT_decl_column(0x0d)
    1049                    $C$DW$68        .dwtag  DW_TAG_member
    1050                            .dwattr $C$DW$68, DW_AT_type(*$C$DW$T$32)
    1051                            .dwattr $C$DW$68, DW_AT_name("ysum")
    1052                            .dwattr $C$DW$68, DW_AT_TI_symbol_name("ysum")
    1053                            .dwattr $C$DW$68, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1054                            .dwattr $C$DW$68, DW_AT_accessibility(DW_ACCESS_public)
    1055                            .dwattr $C$DW$68, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
    1056                            .dwattr $C$DW$68, DW_AT_decl_line(0x6b)
    1057                            .dwattr $C$DW$68, DW_AT_decl_column(0x0d)
    1058                    $C$DW$69        .dwtag  DW_TAG_member
    1059                            .dwattr $C$DW$69, DW_AT_type(*$C$DW$T$32)
    1060                            .dwattr $C$DW$69, DW_AT_name("xmin")
    1061                            .dwattr $C$DW$69, DW_AT_TI_symbol_name("xmin")
    1062                            .dwattr $C$DW$69, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1063                            .dwattr $C$DW$69, DW_AT_accessibility(DW_ACCESS_public)
    1064                            .dwattr $C$DW$69, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
    1065                            .dwattr $C$DW$69, DW_AT_decl_line(0x6d)
    1066                            .dwattr $C$DW$69, DW_AT_decl_column(0x0d)
    1067                    $C$DW$70        .dwtag  DW_TAG_member
    1068                            .dwattr $C$DW$70, DW_AT_type(*$C$DW$T$32)
    1069                            .dwattr $C$DW$70, DW_AT_name("ymin")
    1070                            .dwattr $C$DW$70, DW_AT_TI_symbol_name("ymin")
    1071                            .dwattr $C$DW$70, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1072                            .dwattr $C$DW$70, DW_AT_accessibility(DW_ACCESS_public)
    1073                            .dwattr $C$DW$70, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
    1074                            .dwattr $C$DW$70, DW_AT_decl_line(0x6e)
    1075                            .dwattr $C$DW$70, DW_AT_decl_column(0x0d)
    1076                    $C$DW$71        .dwtag  DW_TAG_member
    1077                            .dwattr $C$DW$71, DW_AT_type(*$C$DW$T$32)
    1078                            .dwattr $C$DW$71, DW_AT_name("xmax")
    1079                            .dwattr $C$DW$71, DW_AT_TI_symbol_name("xmax")
    1080                            .dwattr $C$DW$71, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1081                            .dwattr $C$DW$71, DW_AT_accessibility(DW_ACCESS_public)
    1082                            .dwattr $C$DW$71, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
    1083                            .dwattr $C$DW$71, DW_AT_decl_line(0x6f)
    1084                            .dwattr $C$DW$71, DW_AT_decl_column(0x0d)
    1085                    $C$DW$72        .dwtag  DW_TAG_member
    1086                            .dwattr $C$DW$72, DW_AT_type(*$C$DW$T$32)
    1087                            .dwattr $C$DW$72, DW_AT_name("ymax")
    1088                            .dwattr $C$DW$72, DW_AT_TI_symbol_name("ymax")
    1089                            .dwattr $C$DW$72, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1090                            .dwattr $C$DW$72, DW_AT_accessibility(DW_ACCESS_public)
    1091                            .dwattr $C$DW$72, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
    1092                            .dwattr $C$DW$72, DW_AT_decl_line(0x70)
    1093                            .dwattr $C$DW$72, DW_AT_decl_column(0x0d)
    1094                    $C$DW$73        .dwtag  DW_TAG_member
    1095                            .dwattr $C$DW$73, DW_AT_type(*$C$DW$T$32)
    1096                            .dwattr $C$DW$73, DW_AT_name("seedx")
    1097                            .dwattr $C$DW$73, DW_AT_TI_symbol_name("seedx")
    1098                            .dwattr $C$DW$73, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1099                            .dwattr $C$DW$73, DW_AT_accessibility(DW_ACCESS_public)
    1100                            .dwattr $C$DW$73, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   21

    1101                            .dwattr $C$DW$73, DW_AT_decl_line(0x72)
    1102                            .dwattr $C$DW$73, DW_AT_decl_column(0x0d)
    1103                    $C$DW$74        .dwtag  DW_TAG_member
    1104                            .dwattr $C$DW$74, DW_AT_type(*$C$DW$T$32)
    1105                            .dwattr $C$DW$74, DW_AT_name("seedy")
    1106                            .dwattr $C$DW$74, DW_AT_TI_symbol_name("seedy")
    1107                            .dwattr $C$DW$74, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1108                            .dwattr $C$DW$74, DW_AT_accessibility(DW_ACCESS_public)
    1109                            .dwattr $C$DW$74, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7x7
    1110                            .dwattr $C$DW$74, DW_AT_decl_line(0x73)
    1111                            .dwattr $C$DW$74, DW_AT_decl_column(0x0d)
    1112                            .dwendtag $C$DW$T$33
    1113                    
    1114                            .dwattr $C$DW$T$33, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7
    1115                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x68)
    1116                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    1117                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    1118                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$33)
    1119                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    1120                            .dwattr $C$DW$T$56, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7
    1121                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x75)
    1122                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x03)
    1123                    
    1124                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    1125                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    1126                    $C$DW$75        .dwtag  DW_TAG_member
    1127                            .dwattr $C$DW$75, DW_AT_type(*$C$DW$T$8)
    1128                            .dwattr $C$DW$75, DW_AT_name("daylight")
    1129                            .dwattr $C$DW$75, DW_AT_TI_symbol_name("daylight")
    1130                            .dwattr $C$DW$75, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1131                            .dwattr $C$DW$75, DW_AT_accessibility(DW_ACCESS_public)
    1132                            .dwattr $C$DW$75, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1133                            .dwattr $C$DW$75, DW_AT_decl_line(0x52)
    1134                            .dwattr $C$DW$75, DW_AT_decl_column(0x0b)
    1135                    $C$DW$76        .dwtag  DW_TAG_member
    1136                            .dwattr $C$DW$76, DW_AT_type(*$C$DW$T$10)
    1137                            .dwattr $C$DW$76, DW_AT_name("timezone")
    1138                            .dwattr $C$DW$76, DW_AT_TI_symbol_name("timezone")
    1139                            .dwattr $C$DW$76, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1140                            .dwattr $C$DW$76, DW_AT_accessibility(DW_ACCESS_public)
    1141                            .dwattr $C$DW$76, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1142                            .dwattr $C$DW$76, DW_AT_decl_line(0x53)
    1143                            .dwattr $C$DW$76, DW_AT_decl_column(0x0b)
    1144                    $C$DW$77        .dwtag  DW_TAG_member
    1145                            .dwattr $C$DW$77, DW_AT_type(*$C$DW$T$34)
    1146                            .dwattr $C$DW$77, DW_AT_name("tzname")
    1147                            .dwattr $C$DW$77, DW_AT_TI_symbol_name("tzname")
    1148                            .dwattr $C$DW$77, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1149                            .dwattr $C$DW$77, DW_AT_accessibility(DW_ACCESS_public)
    1150                            .dwattr $C$DW$77, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1151                            .dwattr $C$DW$77, DW_AT_decl_line(0x54)
    1152                            .dwattr $C$DW$77, DW_AT_decl_column(0x0b)
    1153                    $C$DW$78        .dwtag  DW_TAG_member
    1154                            .dwattr $C$DW$78, DW_AT_type(*$C$DW$T$34)
    1155                            .dwattr $C$DW$78, DW_AT_name("dstname")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   22

    1156                            .dwattr $C$DW$78, DW_AT_TI_symbol_name("dstname")
    1157                            .dwattr $C$DW$78, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1158                            .dwattr $C$DW$78, DW_AT_accessibility(DW_ACCESS_public)
    1159                            .dwattr $C$DW$78, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1160                            .dwattr $C$DW$78, DW_AT_decl_line(0x55)
    1161                            .dwattr $C$DW$78, DW_AT_decl_column(0x0b)
    1162                            .dwendtag $C$DW$T$35
    1163                    
    1164                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1165                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x51)
    1166                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    1167                    $C$DW$T$57      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    1168                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$35)
    1169                            .dwattr $C$DW$T$57, DW_AT_language(DW_LANG_C)
    1170                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1171                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x56)
    1172                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x03)
    1173                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    1174                            .dwattr $C$DW$T$2, DW_AT_name("void")
    1175                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    1176                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    1177                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    1178                    $C$DW$T$58      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    1179                            .dwattr $C$DW$T$58, DW_AT_type(*$C$DW$T$3)
    1180                            .dwattr $C$DW$T$58, DW_AT_language(DW_LANG_C)
    1181                            .dwattr $C$DW$T$58, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7
    1182                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x5c)
    1183                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x19)
    1184                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    1185                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    1186                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    1187                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    1188                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    1189                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    1190                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    1191                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    1192                    $C$DW$T$61      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    1193                            .dwattr $C$DW$T$61, DW_AT_type(*$C$DW$T$5)
    1194                            .dwattr $C$DW$T$61, DW_AT_language(DW_LANG_C)
    1195                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1196                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x2a)
    1197                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x1d)
    1198                    $C$DW$T$62      .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    1199                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$61)
    1200                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    1201                            .dwattr $C$DW$T$62, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1202                            .dwattr $C$DW$T$62, DW_AT_decl_line(0x39)
    1203                            .dwattr $C$DW$T$62, DW_AT_decl_column(0x17)
    1204                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    1205                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    1206                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    1207                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    1208                    $C$DW$T$27      .dwtag  DW_TAG_pointer_type
    1209                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$6)
    1210                            .dwattr $C$DW$T$27, DW_AT_address_class(0x20)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   23

    1211                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    1212                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    1213                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    1214                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1215                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
    1216                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    1217                    $C$DW$T$20      .dwtag  DW_TAG_pointer_type
    1218                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$19)
    1219                            .dwattr $C$DW$T$20, DW_AT_address_class(0x20)
    1220                    $C$DW$T$63      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    1221                            .dwattr $C$DW$T$63, DW_AT_type(*$C$DW$T$19)
    1222                            .dwattr $C$DW$T$63, DW_AT_language(DW_LANG_C)
    1223                            .dwattr $C$DW$T$63, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1224                            .dwattr $C$DW$T$63, DW_AT_decl_line(0x3a)
    1225                            .dwattr $C$DW$T$63, DW_AT_decl_column(0x16)
    1226                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    1227                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    1228                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    1229                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    1230                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    1231                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    1232                            .dwattr $C$DW$T$8, DW_AT_name("short")
    1233                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    1234                    $C$DW$T$64      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    1235                            .dwattr $C$DW$T$64, DW_AT_type(*$C$DW$T$8)
    1236                            .dwattr $C$DW$T$64, DW_AT_language(DW_LANG_C)
    1237                            .dwattr $C$DW$T$64, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1238                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x2c)
    1239                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x1d)
    1240                    $C$DW$T$65      .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    1241                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$64)
    1242                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    1243                            .dwattr $C$DW$T$65, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1244                            .dwattr $C$DW$T$65, DW_AT_decl_line(0x3c)
    1245                            .dwattr $C$DW$T$65, DW_AT_decl_column(0x17)
    1246                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    1247                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    1248                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    1249                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    1250                    $C$DW$T$21      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    1251                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$9)
    1252                            .dwattr $C$DW$T$21, DW_AT_language(DW_LANG_C)
    1253                            .dwattr $C$DW$T$21, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1254                            .dwattr $C$DW$T$21, DW_AT_decl_line(0x2d)
    1255                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x1c)
    1256                    $C$DW$T$23      .dwtag  DW_TAG_pointer_type
    1257                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$21)
    1258                            .dwattr $C$DW$T$23, DW_AT_address_class(0x20)
    1259                    
    1260                    $C$DW$T$67      .dwtag  DW_TAG_array_type
    1261                            .dwattr $C$DW$T$67, DW_AT_type(*$C$DW$T$21)
    1262                            .dwattr $C$DW$T$67, DW_AT_language(DW_LANG_C)
    1263                            .dwattr $C$DW$T$67, DW_AT_byte_size(0x10)
    1264                    $C$DW$79        .dwtag  DW_TAG_subrange_type
    1265                            .dwattr $C$DW$79, DW_AT_upper_bound(0x07)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   24

    1266                            .dwendtag $C$DW$T$67
    1267                    
    1268                    $C$DW$T$68      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    1269                            .dwattr $C$DW$T$68, DW_AT_type(*$C$DW$T$21)
    1270                            .dwattr $C$DW$T$68, DW_AT_language(DW_LANG_C)
    1271                            .dwattr $C$DW$T$68, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1272                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x3d)
    1273                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x16)
    1274                    $C$DW$T$66      .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    1275                            .dwattr $C$DW$T$66, DW_AT_type(*$C$DW$T$9)
    1276                            .dwattr $C$DW$T$66, DW_AT_language(DW_LANG_C)
    1277                            .dwattr $C$DW$T$66, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1278                            .dwattr $C$DW$T$66, DW_AT_decl_line(0x53)
    1279                            .dwattr $C$DW$T$66, DW_AT_decl_column(0x1a)
    1280                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    1281                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    1282                            .dwattr $C$DW$T$10, DW_AT_name("int")
    1283                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    1284                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    1285                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$10)
    1286                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    1287                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1288                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x53)
    1289                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x0d)
    1290                    $C$DW$T$32      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    1291                            .dwattr $C$DW$T$32, DW_AT_type(*$C$DW$T$10)
    1292                            .dwattr $C$DW$T$32, DW_AT_language(DW_LANG_C)
    1293                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1294                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x2e)
    1295                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x1d)
    1296                    $C$DW$T$71      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    1297                            .dwattr $C$DW$T$71, DW_AT_type(*$C$DW$T$32)
    1298                            .dwattr $C$DW$T$71, DW_AT_language(DW_LANG_C)
    1299                            .dwattr $C$DW$T$71, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7
    1300                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x77)
    1301                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x11)
    1302                    
    1303                    $C$DW$T$36      .dwtag  DW_TAG_array_type
    1304                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$32)
    1305                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    1306                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x10)
    1307                    $C$DW$80        .dwtag  DW_TAG_subrange_type
    1308                            .dwattr $C$DW$80, DW_AT_upper_bound(0x03)
    1309                            .dwendtag $C$DW$T$36
    1310                    
    1311                    $C$DW$T$59      .dwtag  DW_TAG_pointer_type
    1312                            .dwattr $C$DW$T$59, DW_AT_type(*$C$DW$T$32)
    1313                            .dwattr $C$DW$T$59, DW_AT_address_class(0x20)
    1314                    $C$DW$T$72      .dwtag  DW_TAG_const_type
    1315                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$59)
    1316                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    1317                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$32)
    1318                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    1319                            .dwattr $C$DW$T$73, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1320                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x4b)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   25

    1321                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x17)
    1322                    $C$DW$T$74      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    1323                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$32)
    1324                            .dwattr $C$DW$T$74, DW_AT_language(DW_LANG_C)
    1325                            .dwattr $C$DW$T$74, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1326                            .dwattr $C$DW$T$74, DW_AT_decl_line(0x4e)
    1327                            .dwattr $C$DW$T$74, DW_AT_decl_column(0x17)
    1328                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    1329                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$32)
    1330                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    1331                            .dwattr $C$DW$T$75, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1332                            .dwattr $C$DW$T$75, DW_AT_decl_line(0x49)
    1333                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x17)
    1334                    $C$DW$T$76      .dwtag  DW_TAG_typedef, DW_AT_name("int_least32_t")
    1335                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$32)
    1336                            .dwattr $C$DW$T$76, DW_AT_language(DW_LANG_C)
    1337                            .dwattr $C$DW$T$76, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1338                            .dwattr $C$DW$T$76, DW_AT_decl_line(0x3e)
    1339                            .dwattr $C$DW$T$76, DW_AT_decl_column(0x17)
    1340                    $C$DW$T$77      .dwtag  DW_TAG_typedef, DW_AT_name("intptr_t")
    1341                            .dwattr $C$DW$T$77, DW_AT_type(*$C$DW$T$10)
    1342                            .dwattr $C$DW$T$77, DW_AT_language(DW_LANG_C)
    1343                            .dwattr $C$DW$T$77, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1344                            .dwattr $C$DW$T$77, DW_AT_decl_line(0x58)
    1345                            .dwattr $C$DW$T$77, DW_AT_decl_column(0x1a)
    1346                    $C$DW$T$11      .dwtag  DW_TAG_base_type
    1347                            .dwattr $C$DW$T$11, DW_AT_encoding(DW_ATE_unsigned)
    1348                            .dwattr $C$DW$T$11, DW_AT_name("unsigned int")
    1349                            .dwattr $C$DW$T$11, DW_AT_byte_size(0x04)
    1350                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_VAL")
    1351                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$11)
    1352                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    1353                            .dwattr $C$DW$T$79, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_7
    1354                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x5d)
    1355                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x17)
    1356                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("clock_t")
    1357                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$11)
    1358                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    1359                            .dwattr $C$DW$T$87, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1360                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x37)
    1361                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x16)
    1362                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("size_t")
    1363                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$11)
    1364                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    1365                            .dwattr $C$DW$T$86, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1366                            .dwattr $C$DW$T$86, DW_AT_decl_line(0x45)
    1367                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x19)
    1368                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("time_t")
    1369                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$11)
    1370                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    1371                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1372                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x38)
    1373                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x16)
    1374                    $C$DW$T$22      .dwtag  DW_TAG_typedef, DW_AT_name("uint32_t")
    1375                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$11)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   26

    1376                            .dwattr $C$DW$T$22, DW_AT_language(DW_LANG_C)
    1377                            .dwattr $C$DW$T$22, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1378                            .dwattr $C$DW$T$22, DW_AT_decl_line(0x2f)
    1379                            .dwattr $C$DW$T$22, DW_AT_decl_column(0x1c)
    1380                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast16_t")
    1381                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$22)
    1382                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    1383                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1384                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x4c)
    1385                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x16)
    1386                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast32_t")
    1387                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$22)
    1388                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    1389                            .dwattr $C$DW$T$82, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1390                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x4f)
    1391                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x16)
    1392                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast8_t")
    1393                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$22)
    1394                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    1395                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1396                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x4a)
    1397                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x16)
    1398                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least32_t")
    1399                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$22)
    1400                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    1401                            .dwattr $C$DW$T$84, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1402                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x3f)
    1403                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x16)
    1404                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("uintptr_t")
    1405                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$11)
    1406                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    1407                            .dwattr $C$DW$T$85, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1408                            .dwattr $C$DW$T$85, DW_AT_decl_line(0x59)
    1409                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x1a)
    1410                    $C$DW$T$12      .dwtag  DW_TAG_base_type
    1411                            .dwattr $C$DW$T$12, DW_AT_encoding(DW_ATE_signed)
    1412                            .dwattr $C$DW$T$12, DW_AT_name("__int40_t")
    1413                            .dwattr $C$DW$T$12, DW_AT_byte_size(0x08)
    1414                            .dwattr $C$DW$T$12, DW_AT_bit_size(0x28)
    1415                            .dwattr $C$DW$T$12, DW_AT_bit_offset(0x18)
    1416                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("int40_t")
    1417                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$12)
    1418                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    1419                            .dwattr $C$DW$T$88, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1420                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x31)
    1421                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x21)
    1422                    $C$DW$T$89      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast40_t")
    1423                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$88)
    1424                            .dwattr $C$DW$T$89, DW_AT_language(DW_LANG_C)
    1425                            .dwattr $C$DW$T$89, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1426                            .dwattr $C$DW$T$89, DW_AT_decl_line(0x51)
    1427                            .dwattr $C$DW$T$89, DW_AT_decl_column(0x17)
    1428                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("int_least40_t")
    1429                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$88)
    1430                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   27

    1431                            .dwattr $C$DW$T$90, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1432                            .dwattr $C$DW$T$90, DW_AT_decl_line(0x41)
    1433                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x17)
    1434                    $C$DW$T$13      .dwtag  DW_TAG_base_type
    1435                            .dwattr $C$DW$T$13, DW_AT_encoding(DW_ATE_unsigned)
    1436                            .dwattr $C$DW$T$13, DW_AT_name("unsigned __int40_t")
    1437                            .dwattr $C$DW$T$13, DW_AT_byte_size(0x08)
    1438                            .dwattr $C$DW$T$13, DW_AT_bit_size(0x28)
    1439                            .dwattr $C$DW$T$13, DW_AT_bit_offset(0x18)
    1440                    $C$DW$T$91      .dwtag  DW_TAG_typedef, DW_AT_name("uint40_t")
    1441                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$13)
    1442                            .dwattr $C$DW$T$91, DW_AT_language(DW_LANG_C)
    1443                            .dwattr $C$DW$T$91, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1444                            .dwattr $C$DW$T$91, DW_AT_decl_line(0x32)
    1445                            .dwattr $C$DW$T$91, DW_AT_decl_column(0x20)
    1446                    $C$DW$T$92      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast40_t")
    1447                            .dwattr $C$DW$T$92, DW_AT_type(*$C$DW$T$91)
    1448                            .dwattr $C$DW$T$92, DW_AT_language(DW_LANG_C)
    1449                            .dwattr $C$DW$T$92, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1450                            .dwattr $C$DW$T$92, DW_AT_decl_line(0x52)
    1451                            .dwattr $C$DW$T$92, DW_AT_decl_column(0x16)
    1452                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("uint_least40_t")
    1453                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$91)
    1454                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    1455                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1456                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x42)
    1457                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x16)
    1458                    $C$DW$T$14      .dwtag  DW_TAG_base_type
    1459                            .dwattr $C$DW$T$14, DW_AT_encoding(DW_ATE_signed)
    1460                            .dwattr $C$DW$T$14, DW_AT_name("long long")
    1461                            .dwattr $C$DW$T$14, DW_AT_byte_size(0x08)
    1462                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("int64_t")
    1463                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$14)
    1464                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    1465                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1466                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x34)
    1467                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x21)
    1468                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("int_fast64_t")
    1469                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$94)
    1470                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    1471                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1472                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x54)
    1473                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x17)
    1474                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("int_least64_t")
    1475                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$94)
    1476                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    1477                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1478                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x44)
    1479                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x17)
    1480                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("intmax_t")
    1481                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$14)
    1482                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    1483                            .dwattr $C$DW$T$97, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1484                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x5c)
    1485                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x20)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   28

    1486                    $C$DW$T$15      .dwtag  DW_TAG_base_type
    1487                            .dwattr $C$DW$T$15, DW_AT_encoding(DW_ATE_unsigned)
    1488                            .dwattr $C$DW$T$15, DW_AT_name("unsigned long long")
    1489                            .dwattr $C$DW$T$15, DW_AT_byte_size(0x08)
    1490                    $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("uint64_t")
    1491                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$15)
    1492                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    1493                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1494                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x35)
    1495                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x20)
    1496                    $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("uint_fast64_t")
    1497                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$98)
    1498                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    1499                            .dwattr $C$DW$T$99, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1500                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x55)
    1501                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x16)
    1502                    $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least64_t")
    1503                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$98)
    1504                            .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    1505                            .dwattr $C$DW$T$100, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    1506                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x45)
    1507                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x16)
    1508                    $C$DW$T$101     .dwtag  DW_TAG_typedef, DW_AT_name("uintmax_t")
    1509                            .dwattr $C$DW$T$101, DW_AT_type(*$C$DW$T$15)
    1510                            .dwattr $C$DW$T$101, DW_AT_language(DW_LANG_C)
    1511                            .dwattr $C$DW$T$101, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    1512                            .dwattr $C$DW$T$101, DW_AT_decl_line(0x5d)
    1513                            .dwattr $C$DW$T$101, DW_AT_decl_column(0x20)
    1514                    $C$DW$T$16      .dwtag  DW_TAG_base_type
    1515                            .dwattr $C$DW$T$16, DW_AT_encoding(DW_ATE_float)
    1516                            .dwattr $C$DW$T$16, DW_AT_name("float")
    1517                            .dwattr $C$DW$T$16, DW_AT_byte_size(0x04)
    1518                    $C$DW$T$102     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_F32")
    1519                            .dwattr $C$DW$T$102, DW_AT_type(*$C$DW$T$16)
    1520                            .dwattr $C$DW$T$102, DW_AT_language(DW_LANG_C)
    1521                            .dwattr $C$DW$T$102, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_
    1522                            .dwattr $C$DW$T$102, DW_AT_decl_line(0x5b)
    1523                            .dwattr $C$DW$T$102, DW_AT_decl_column(0x0f)
    1524                    $C$DW$T$103     .dwtag  DW_TAG_typedef, DW_AT_name("float32_t")
    1525                            .dwattr $C$DW$T$103, DW_AT_type(*$C$DW$T$16)
    1526                            .dwattr $C$DW$T$103, DW_AT_language(DW_LANG_C)
    1527                            .dwattr $C$DW$T$103, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\inclu
    1528                            .dwattr $C$DW$T$103, DW_AT_decl_line(0x30)
    1529                            .dwattr $C$DW$T$103, DW_AT_decl_column(0x0f)
    1530                    $C$DW$T$17      .dwtag  DW_TAG_base_type
    1531                            .dwattr $C$DW$T$17, DW_AT_encoding(DW_ATE_float)
    1532                            .dwattr $C$DW$T$17, DW_AT_name("double")
    1533                            .dwattr $C$DW$T$17, DW_AT_byte_size(0x08)
    1534                    $C$DW$T$104     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_D64")
    1535                            .dwattr $C$DW$T$104, DW_AT_type(*$C$DW$T$17)
    1536                            .dwattr $C$DW$T$104, DW_AT_language(DW_LANG_C)
    1537                            .dwattr $C$DW$T$104, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_trackFeaturesLucasKanade_
    1538                            .dwattr $C$DW$T$104, DW_AT_decl_line(0x5a)
    1539                            .dwattr $C$DW$T$104, DW_AT_decl_column(0x10)
    1540                    $C$DW$T$105     .dwtag  DW_TAG_typedef, DW_AT_name("__float2_t")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   29

    1541                            .dwattr $C$DW$T$105, DW_AT_type(*$C$DW$T$17)
    1542                            .dwattr $C$DW$T$105, DW_AT_language(DW_LANG_C)
    1543                            .dwattr $C$DW$T$105, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    1544                            .dwattr $C$DW$T$105, DW_AT_decl_line(0x5f)
    1545                            .dwattr $C$DW$T$105, DW_AT_decl_column(0x14)
    1546                    $C$DW$T$18      .dwtag  DW_TAG_base_type
    1547                            .dwattr $C$DW$T$18, DW_AT_encoding(DW_ATE_float)
    1548                            .dwattr $C$DW$T$18, DW_AT_name("long double")
    1549                            .dwattr $C$DW$T$18, DW_AT_byte_size(0x08)
    1550                    $C$DW$T$24      .dwtag  DW_TAG_base_type
    1551                            .dwattr $C$DW$T$24, DW_AT_encoding(DW_ATE_signed_char)
    1552                            .dwattr $C$DW$T$24, DW_AT_name("signed char")
    1553                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x01)
    1554                    $C$DW$T$25      .dwtag  DW_TAG_pointer_type
    1555                            .dwattr $C$DW$T$25, DW_AT_type(*$C$DW$T$24)
    1556                            .dwattr $C$DW$T$25, DW_AT_address_class(0x20)
    1557                    $C$DW$T$106     .dwtag  DW_TAG_typedef, DW_AT_name("va_list")
    1558                            .dwattr $C$DW$T$106, DW_AT_type(*$C$DW$T$25)
    1559                            .dwattr $C$DW$T$106, DW_AT_language(DW_LANG_C)
    1560                            .dwattr $C$DW$T$106, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    1561                            .dwattr $C$DW$T$106, DW_AT_decl_line(0x2f)
    1562                            .dwattr $C$DW$T$106, DW_AT_decl_column(0x12)
    1563                    
    1564                    $C$DW$T$34      .dwtag  DW_TAG_array_type
    1565                            .dwattr $C$DW$T$34, DW_AT_type(*$C$DW$T$24)
    1566                            .dwattr $C$DW$T$34, DW_AT_language(DW_LANG_C)
    1567                            .dwattr $C$DW$T$34, DW_AT_byte_size(0x04)
    1568                    $C$DW$81        .dwtag  DW_TAG_subrange_type
    1569                            .dwattr $C$DW$81, DW_AT_upper_bound(0x03)
    1570                            .dwendtag $C$DW$T$34
    1571                    
    1572                    
    1573                    $C$DW$T$37      .dwtag  DW_TAG_structure_type
    1574                            .dwattr $C$DW$T$37, DW_AT_name("__simd128_int32_t")
    1575                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x10)
    1576                    $C$DW$82        .dwtag  DW_TAG_member
    1577                            .dwattr $C$DW$82, DW_AT_type(*$C$DW$T$36)
    1578                            .dwattr $C$DW$82, DW_AT_name("_v")
    1579                            .dwattr $C$DW$82, DW_AT_TI_symbol_name("_v")
    1580                            .dwattr $C$DW$82, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1581                            .dwattr $C$DW$82, DW_AT_accessibility(DW_ACCESS_public)
    1582                            .dwattr $C$DW$82, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\include\
    1583                            .dwattr $C$DW$82, DW_AT_decl_line(0x44)
    1584                            .dwattr $C$DW$82, DW_AT_decl_column(0x01)
    1585                            .dwendtag $C$DW$T$37
    1586                    
    1587                            .dwattr $C$DW$T$37, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\includ
    1588                            .dwattr $C$DW$T$37, DW_AT_decl_line(0x44)
    1589                            .dwattr $C$DW$T$37, DW_AT_decl_column(0x01)
    1590                    $C$DW$T$107     .dwtag  DW_TAG_typedef, DW_AT_name("int32x4_t")
    1591                            .dwattr $C$DW$T$107, DW_AT_type(*$C$DW$T$37)
    1592                            .dwattr $C$DW$T$107, DW_AT_language(DW_LANG_C)
    1593                            .dwattr $C$DW$T$107, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\inclu
    1594                            .dwattr $C$DW$T$107, DW_AT_decl_line(0x44)
    1595                            .dwattr $C$DW$T$107, DW_AT_decl_column(0x01)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   30

    1596                    $C$DW$T$108     .dwtag  DW_TAG_typedef, DW_AT_name("__x128_t")
    1597                            .dwattr $C$DW$T$108, DW_AT_type(*$C$DW$T$107)
    1598                            .dwattr $C$DW$T$108, DW_AT_language(DW_LANG_C)
    1599                            .dwattr $C$DW$T$108, DW_AT_decl_file("C:\VLIB_Tools\CCSV5_4_0\ccsv5\tools\compiler\C6000\inclu
    1600                            .dwattr $C$DW$T$108, DW_AT_decl_line(0x46)
    1601                            .dwattr $C$DW$T$108, DW_AT_decl_column(0x13)
    1602                    
    1603                    $C$DW$T$38      .dwtag  DW_TAG_structure_type
    1604                            .dwattr $C$DW$T$38, DW_AT_name("tm")
    1605                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x24)
    1606                    $C$DW$83        .dwtag  DW_TAG_member
    1607                            .dwattr $C$DW$83, DW_AT_type(*$C$DW$T$10)
    1608                            .dwattr $C$DW$83, DW_AT_name("tm_sec")
    1609                            .dwattr $C$DW$83, DW_AT_TI_symbol_name("tm_sec")
    1610                            .dwattr $C$DW$83, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    1611                            .dwattr $C$DW$83, DW_AT_accessibility(DW_ACCESS_public)
    1612                            .dwattr $C$DW$83, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1613                            .dwattr $C$DW$83, DW_AT_decl_line(0x41)
    1614                            .dwattr $C$DW$83, DW_AT_decl_column(0x09)
    1615                    $C$DW$84        .dwtag  DW_TAG_member
    1616                            .dwattr $C$DW$84, DW_AT_type(*$C$DW$T$10)
    1617                            .dwattr $C$DW$84, DW_AT_name("tm_min")
    1618                            .dwattr $C$DW$84, DW_AT_TI_symbol_name("tm_min")
    1619                            .dwattr $C$DW$84, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    1620                            .dwattr $C$DW$84, DW_AT_accessibility(DW_ACCESS_public)
    1621                            .dwattr $C$DW$84, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1622                            .dwattr $C$DW$84, DW_AT_decl_line(0x42)
    1623                            .dwattr $C$DW$84, DW_AT_decl_column(0x09)
    1624                    $C$DW$85        .dwtag  DW_TAG_member
    1625                            .dwattr $C$DW$85, DW_AT_type(*$C$DW$T$10)
    1626                            .dwattr $C$DW$85, DW_AT_name("tm_hour")
    1627                            .dwattr $C$DW$85, DW_AT_TI_symbol_name("tm_hour")
    1628                            .dwattr $C$DW$85, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    1629                            .dwattr $C$DW$85, DW_AT_accessibility(DW_ACCESS_public)
    1630                            .dwattr $C$DW$85, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1631                            .dwattr $C$DW$85, DW_AT_decl_line(0x43)
    1632                            .dwattr $C$DW$85, DW_AT_decl_column(0x09)
    1633                    $C$DW$86        .dwtag  DW_TAG_member
    1634                            .dwattr $C$DW$86, DW_AT_type(*$C$DW$T$10)
    1635                            .dwattr $C$DW$86, DW_AT_name("tm_mday")
    1636                            .dwattr $C$DW$86, DW_AT_TI_symbol_name("tm_mday")
    1637                            .dwattr $C$DW$86, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    1638                            .dwattr $C$DW$86, DW_AT_accessibility(DW_ACCESS_public)
    1639                            .dwattr $C$DW$86, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1640                            .dwattr $C$DW$86, DW_AT_decl_line(0x44)
    1641                            .dwattr $C$DW$86, DW_AT_decl_column(0x09)
    1642                    $C$DW$87        .dwtag  DW_TAG_member
    1643                            .dwattr $C$DW$87, DW_AT_type(*$C$DW$T$10)
    1644                            .dwattr $C$DW$87, DW_AT_name("tm_mon")
    1645                            .dwattr $C$DW$87, DW_AT_TI_symbol_name("tm_mon")
    1646                            .dwattr $C$DW$87, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    1647                            .dwattr $C$DW$87, DW_AT_accessibility(DW_ACCESS_public)
    1648                            .dwattr $C$DW$87, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1649                            .dwattr $C$DW$87, DW_AT_decl_line(0x45)
    1650                            .dwattr $C$DW$87, DW_AT_decl_column(0x09)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:44:55 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_trackFeaturesLucasKanade_7x7/VLIB_trackFeaturesLucasKanade_7x7_idat.se66 PAGE   31

    1651                    $C$DW$88        .dwtag  DW_TAG_member
    1652                            .dwattr $C$DW$88, DW_AT_type(*$C$DW$T$10)
    1653                            .dwattr $C$DW$88, DW_AT_name("tm_year")
    1654                            .dwattr $C$DW$88, DW_AT_TI_symbol_name("tm_year")
    1655                            .dwattr $C$DW$88, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    1656                            .dwattr $C$DW$88, DW_AT_accessibility(DW_ACCESS_public)
    1657                            .dwattr $C$DW$88, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1658                            .dwattr $C$DW$88, DW_AT_decl_line(0x46)
    1659                            .dwattr $C$DW$88, DW_AT_decl_column(0x09)
    1660                    $C$DW$89        .dwtag  DW_TAG_member
    1661                            .dwattr $C$DW$89, DW_AT_type(*$C$DW$T$10)
    1662                            .dwattr $C$DW$89, DW_AT_name("tm_wday")
    1663                            .dwattr $C$DW$89, DW_AT_TI_symbol_name("tm_wday")
    1664                            .dwattr $C$DW$89, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    1665                            .dwattr $C$DW$89, DW_AT_accessibility(DW_ACCESS_public)
    1666                            .dwattr $C$DW$89, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1667                            .dwattr $C$DW$89, DW_AT_decl_line(0x47)
    1668                            .dwattr $C$DW$89, DW_AT_decl_column(0x09)
    1669                    $C$DW$90        .dwtag  DW_TAG_member
    1670                            .dwattr $C$DW$90, DW_AT_type(*$C$DW$T$10)
    1671                            .dwattr $C$DW$90, DW_AT_name("tm_yday")
    1672                            .dwattr $C$DW$90, DW_AT_TI_symbol_name("tm_yday")
    1673                            .dwattr $C$DW$90, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    1674                            .dwattr $C$DW$90, DW_AT_accessibility(DW_ACCESS_public)
    1675                            .dwattr $C$DW$90, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1676                            .dwattr $C$DW$90, DW_AT_decl_line(0x48)
    1677                            .dwattr $C$DW$90, DW_AT_decl_column(0x09)
    1678                    $C$DW$91        .dwtag  DW_TAG_member
    1679                            .dwattr $C$DW$91, DW_AT_type(*$C$DW$T$10)
    1680                            .dwattr $C$DW$91, DW_AT_name("tm_isdst")
    1681                            .dwattr $C$DW$91, DW_AT_TI_symbol_name("tm_isdst")
    1682                            .dwattr $C$DW$91, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    1683                            .dwattr $C$DW$91, DW_AT_accessibility(DW_ACCESS_public)
    1684                            .dwattr $C$DW$91, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include/
    1685                            .dwattr $C$DW$91, DW_AT_decl_line(0x49)
    1686                            .dwattr $C$DW$91, DW_AT_decl_column(0x09)
    1687                            .dwendtag $C$DW$T$38
    1688                    
    1689                            .dwattr $C$DW$T$38, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    1690                            .dwattr $C$DW$T$38, DW_AT_decl_line(0x3f)
    1691                            .dwattr $C$DW$T$38, DW_AT_decl_column(0x08)
    1692                            .dwattr $C$DW$CU, DW_AT_language(DW_LANG_C)
    1693                    
    1694                    ;***************************************************************
    1695                    ;* DWARF CIE ENTRIES                                           *
    1696                    ;***************************************************************
    1697                    
    1698                    $C$DW$CIE       .dwcie 19
    1699                            .dwcfi  cfa_register, 31
    1700                            .dwcfi  cfa_offset, 0
    1701                            .dwcfi  undefined, 0
