TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Thu Mar 19 12:38:15 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    3311                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x03)
    3312                    
    3313                    $C$DW$T$70      .dwtag  DW_TAG_enumeration_type
    3314                            .dwattr $C$DW$T$70, DW_AT_byte_size(0x04)
    3315                    $C$DW$266       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_OPT"), DW_AT_const_value(0x00)
    3316                            .dwattr $C$DW$266, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\../co
    3317                            .dwattr $C$DW$266, DW_AT_decl_line(0x6a)
    3318                            .dwattr $C$DW$266, DW_AT_decl_column(0x05)
    3319                    $C$DW$267       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CN"), DW_AT_const_value(0x01)
    3320                            .dwattr $C$DW$267, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\../co
    3321                            .dwattr $C$DW$267, DW_AT_decl_line(0x6b)
    3322                            .dwattr $C$DW$267, DW_AT_decl_column(0x05)
    3323                    $C$DW$268       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_CNT"), DW_AT_const_value(0x02)
    3324                            .dwattr $C$DW$268, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\../co
    3325                            .dwattr $C$DW$268, DW_AT_decl_line(0x6c)
    3326                            .dwattr $C$DW$268, DW_AT_decl_column(0x05)
    3327                            .dwendtag $C$DW$T$70
    3328                    
    3329                            .dwattr $C$DW$T$70, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\../c
    3330                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x69)
    3331                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x06)
    3332                    
    3333                    $C$DW$T$71      .dwtag  DW_TAG_enumeration_type
    3334                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    3335                    $C$DW$269       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    3336                            .dwattr $C$DW$269, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\../co
    3337                            .dwattr $C$DW$269, DW_AT_decl_line(0x72)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   69

    3338                            .dwattr $C$DW$269, DW_AT_decl_column(0x05)
    3339                    $C$DW$270       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    3340                            .dwattr $C$DW$270, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\../co
    3341                            .dwattr $C$DW$270, DW_AT_decl_line(0x73)
    3342                            .dwattr $C$DW$270, DW_AT_decl_column(0x05)
    3343                            .dwendtag $C$DW$T$71
    3344                    
    3345                            .dwattr $C$DW$T$71, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\../c
    3346                            .dwattr $C$DW$T$71, DW_AT_decl_line(0x71)
    3347                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x06)
    3348                    
    3349                    $C$DW$T$72      .dwtag  DW_TAG_enumeration_type
    3350                            .dwattr $C$DW$T$72, DW_AT_byte_size(0x04)
    3351                    $C$DW$271       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_OK"), DW_AT_const_value(0x00)
    3352                            .dwattr $C$DW$271, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3353                            .dwattr $C$DW$271, DW_AT_decl_line(0xa2)
    3354                            .dwattr $C$DW$271, DW_AT_decl_column(0x05)
    3355                    $C$DW$272       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_FAIL"), DW_AT_const_value(-1)
    3356                            .dwattr $C$DW$272, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3357                            .dwattr $C$DW$272, DW_AT_decl_line(0xa3)
    3358                            .dwattr $C$DW$272, DW_AT_decl_column(0x05)
    3359                            .dwendtag $C$DW$T$72
    3360                    
    3361                            .dwattr $C$DW$T$72, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3362                            .dwattr $C$DW$T$72, DW_AT_decl_line(0xa1)
    3363                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x0e)
    3364                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("CORBResult")
    3365                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$72)
    3366                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    3367                            .dwattr $C$DW$T$73, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3368                            .dwattr $C$DW$T$73, DW_AT_decl_line(0xa4)
    3369                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x02)
    3370                    
    3371                    $C$DW$T$21      .dwtag  DW_TAG_structure_type
    3372                            .dwattr $C$DW$T$21, DW_AT_byte_size(0x14)
    3373                    $C$DW$273       .dwtag  DW_TAG_member
    3374                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$19)
    3375                            .dwattr $C$DW$273, DW_AT_name("width")
    3376                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("width")
    3377                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3378                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3379                            .dwattr $C$DW$273, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3380                            .dwattr $C$DW$273, DW_AT_decl_line(0xaa)
    3381                            .dwattr $C$DW$273, DW_AT_decl_column(0x0d)
    3382                    $C$DW$274       .dwtag  DW_TAG_member
    3383                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$19)
    3384                            .dwattr $C$DW$274, DW_AT_name("height")
    3385                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("height")
    3386                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3387                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3388                            .dwattr $C$DW$274, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3389                            .dwattr $C$DW$274, DW_AT_decl_line(0xab)
    3390                            .dwattr $C$DW$274, DW_AT_decl_column(0x0d)
    3391                    $C$DW$275       .dwtag  DW_TAG_member
    3392                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$19)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   70

    3393                            .dwattr $C$DW$275, DW_AT_name("marginPixels")
    3394                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("marginPixels")
    3395                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3396                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3397                            .dwattr $C$DW$275, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3398                            .dwattr $C$DW$275, DW_AT_decl_line(0xac)
    3399                            .dwattr $C$DW$275, DW_AT_decl_column(0x0d)
    3400                    $C$DW$276       .dwtag  DW_TAG_member
    3401                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$20)
    3402                            .dwattr $C$DW$276, DW_AT_name("fastDifferenceThreshold")
    3403                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    3404                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3405                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3406                            .dwattr $C$DW$276, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3407                            .dwattr $C$DW$276, DW_AT_decl_line(0xae)
    3408                            .dwattr $C$DW$276, DW_AT_decl_column(0x0d)
    3409                    $C$DW$277       .dwtag  DW_TAG_member
    3410                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$19)
    3411                            .dwattr $C$DW$277, DW_AT_name("n_features_desired")
    3412                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("n_features_desired")
    3413                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3414                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3415                            .dwattr $C$DW$277, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3416                            .dwattr $C$DW$277, DW_AT_decl_line(0xb2)
    3417                            .dwattr $C$DW$277, DW_AT_decl_column(0x0d)
    3418                            .dwendtag $C$DW$T$21
    3419                    
    3420                            .dwattr $C$DW$T$21, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3421                            .dwattr $C$DW$T$21, DW_AT_decl_line(0xa9)
    3422                            .dwattr $C$DW$T$21, DW_AT_decl_column(0x10)
    3423                    $C$DW$T$75      .dwtag  DW_TAG_typedef, DW_AT_name("CORBParameters")
    3424                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$21)
    3425                            .dwattr $C$DW$T$75, DW_AT_language(DW_LANG_C)
    3426                            .dwattr $C$DW$T$75, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3427                            .dwattr $C$DW$T$75, DW_AT_decl_line(0xb3)
    3428                            .dwattr $C$DW$T$75, DW_AT_decl_column(0x02)
    3429                    $C$DW$T$76      .dwtag  DW_TAG_const_type
    3430                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$75)
    3431                    
    3432                    $C$DW$T$25      .dwtag  DW_TAG_structure_type
    3433                            .dwattr $C$DW$T$25, DW_AT_byte_size(0x38)
    3434                    $C$DW$278       .dwtag  DW_TAG_member
    3435                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$19)
    3436                            .dwattr $C$DW$278, DW_AT_name("x")
    3437                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("x")
    3438                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3439                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
    3440                            .dwattr $C$DW$278, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3441                            .dwattr $C$DW$278, DW_AT_decl_line(0xdc)
    3442                            .dwattr $C$DW$278, DW_AT_decl_column(0x0d)
    3443                    $C$DW$279       .dwtag  DW_TAG_member
    3444                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$19)
    3445                            .dwattr $C$DW$279, DW_AT_name("y")
    3446                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("y")
    3447                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   71

    3448                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3449                            .dwattr $C$DW$279, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3450                            .dwattr $C$DW$279, DW_AT_decl_line(0xde)
    3451                            .dwattr $C$DW$279, DW_AT_decl_column(0x0d)
    3452                    $C$DW$280       .dwtag  DW_TAG_member
    3453                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$19)
    3454                            .dwattr $C$DW$280, DW_AT_name("octave")
    3455                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("octave")
    3456                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3457                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3458                            .dwattr $C$DW$280, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3459                            .dwattr $C$DW$280, DW_AT_decl_line(0xe0)
    3460                            .dwattr $C$DW$280, DW_AT_decl_column(0x0d)
    3461                    $C$DW$281       .dwtag  DW_TAG_member
    3462                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$22)
    3463                            .dwattr $C$DW$281, DW_AT_name("angle")
    3464                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("angle")
    3465                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3466                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3467                            .dwattr $C$DW$281, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3468                            .dwattr $C$DW$281, DW_AT_decl_line(0xe3)
    3469                            .dwattr $C$DW$281, DW_AT_decl_column(0x0e)
    3470                    $C$DW$282       .dwtag  DW_TAG_member
    3471                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$19)
    3472                            .dwattr $C$DW$282, DW_AT_name("fastResponse")
    3473                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("fastResponse")
    3474                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3475                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3476                            .dwattr $C$DW$282, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3477                            .dwattr $C$DW$282, DW_AT_decl_line(0xe4)
    3478                            .dwattr $C$DW$282, DW_AT_decl_column(0x0e)
    3479                    $C$DW$283       .dwtag  DW_TAG_member
    3480                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$23)
    3481                            .dwattr $C$DW$283, DW_AT_name("harrisResponse")
    3482                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("harrisResponse")
    3483                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3484                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3485                            .dwattr $C$DW$283, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3486                            .dwattr $C$DW$283, DW_AT_decl_line(0xe5)
    3487                            .dwattr $C$DW$283, DW_AT_decl_column(0x0e)
    3488                    $C$DW$284       .dwtag  DW_TAG_member
    3489                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$24)
    3490                            .dwattr $C$DW$284, DW_AT_name("descriptor")
    3491                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("descriptor")
    3492                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3493                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3494                            .dwattr $C$DW$284, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3495                            .dwattr $C$DW$284, DW_AT_decl_line(0xe6)
    3496                            .dwattr $C$DW$284, DW_AT_decl_column(0x0e)
    3497                            .dwendtag $C$DW$T$25
    3498                    
    3499                            .dwattr $C$DW$T$25, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3500                            .dwattr $C$DW$T$25, DW_AT_decl_line(0xdb)
    3501                            .dwattr $C$DW$T$25, DW_AT_decl_column(0x10)
    3502                    $C$DW$T$51      .dwtag  DW_TAG_typedef, DW_AT_name("CORBFeature")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   72

    3503                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$25)
    3504                            .dwattr $C$DW$T$51, DW_AT_language(DW_LANG_C)
    3505                            .dwattr $C$DW$T$51, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3506                            .dwattr $C$DW$T$51, DW_AT_decl_line(0xe7)
    3507                            .dwattr $C$DW$T$51, DW_AT_decl_column(0x02)
    3508                    $C$DW$T$52      .dwtag  DW_TAG_pointer_type
    3509                            .dwattr $C$DW$T$52, DW_AT_type(*$C$DW$T$51)
    3510                            .dwattr $C$DW$T$52, DW_AT_address_class(0x20)
    3511                    $C$DW$T$80      .dwtag  DW_TAG_restrict_type
    3512                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$52)
    3513                    $C$DW$T$81      .dwtag  DW_TAG_pointer_type
    3514                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$25)
    3515                            .dwattr $C$DW$T$81, DW_AT_address_class(0x20)
    3516                    
    3517                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3518                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x24)
    3519                    $C$DW$285       .dwtag  DW_TAG_member
    3520                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$20)
    3521                            .dwattr $C$DW$285, DW_AT_name("testPattern")
    3522                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("testPattern")
    3523                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3524                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3525                            .dwattr $C$DW$285, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\VLIB_
    3526                            .dwattr $C$DW$285, DW_AT_decl_line(0x25)
    3527                            .dwattr $C$DW$285, DW_AT_decl_column(0x15)
    3528                    $C$DW$286       .dwtag  DW_TAG_member
    3529                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$26)
    3530                            .dwattr $C$DW$286, DW_AT_name("staticIn")
    3531                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("staticIn")
    3532                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3533                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3534                            .dwattr $C$DW$286, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\VLIB_
    3535                            .dwattr $C$DW$286, DW_AT_decl_line(0x26)
    3536                            .dwattr $C$DW$286, DW_AT_decl_column(0x15)
    3537                    $C$DW$287       .dwtag  DW_TAG_member
    3538                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$28)
    3539                            .dwattr $C$DW$287, DW_AT_name("staticOut")
    3540                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("staticOut")
    3541                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3542                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3543                            .dwattr $C$DW$287, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\VLIB_
    3544                            .dwattr $C$DW$287, DW_AT_decl_line(0x27)
    3545                            .dwattr $C$DW$287, DW_AT_decl_column(0x15)
    3546                    $C$DW$288       .dwtag  DW_TAG_member
    3547                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    3548                            .dwattr $C$DW$288, DW_AT_name("out_n_features")
    3549                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("out_n_features")
    3550                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3551                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3552                            .dwattr $C$DW$288, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\VLIB_
    3553                            .dwattr $C$DW$288, DW_AT_decl_line(0x28)
    3554                            .dwattr $C$DW$288, DW_AT_decl_column(0x15)
    3555                    $C$DW$289       .dwtag  DW_TAG_member
    3556                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$27)
    3557                            .dwattr $C$DW$289, DW_AT_name("imageWidth")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   73

    3558                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("imageWidth")
    3559                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3560                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3561                            .dwattr $C$DW$289, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\VLIB_
    3562                            .dwattr $C$DW$289, DW_AT_decl_line(0x29)
    3563                            .dwattr $C$DW$289, DW_AT_decl_column(0x15)
    3564                    $C$DW$290       .dwtag  DW_TAG_member
    3565                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$27)
    3566                            .dwattr $C$DW$290, DW_AT_name("imageHeight")
    3567                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("imageHeight")
    3568                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x12]
    3569                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3570                            .dwattr $C$DW$290, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\VLIB_
    3571                            .dwattr $C$DW$290, DW_AT_decl_line(0x2a)
    3572                            .dwattr $C$DW$290, DW_AT_decl_column(0x15)
    3573                    $C$DW$291       .dwtag  DW_TAG_member
    3574                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$27)
    3575                            .dwattr $C$DW$291, DW_AT_name("imagePitch")
    3576                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("imagePitch")
    3577                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3578                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3579                            .dwattr $C$DW$291, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\VLIB_
    3580                            .dwattr $C$DW$291, DW_AT_decl_line(0x2b)
    3581                            .dwattr $C$DW$291, DW_AT_decl_column(0x15)
    3582                    $C$DW$292       .dwtag  DW_TAG_member
    3583                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$29)
    3584                            .dwattr $C$DW$292, DW_AT_name("max_num_features")
    3585                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("max_num_features")
    3586                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3587                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3588                            .dwattr $C$DW$292, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\VLIB_
    3589                            .dwattr $C$DW$292, DW_AT_decl_line(0x2c)
    3590                            .dwattr $C$DW$292, DW_AT_decl_column(0x15)
    3591                    $C$DW$293       .dwtag  DW_TAG_member
    3592                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$32)
    3593                            .dwattr $C$DW$293, DW_AT_name("sortResults")
    3594                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("sortResults")
    3595                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3596                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3597                            .dwattr $C$DW$293, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\VLIB_
    3598                            .dwattr $C$DW$293, DW_AT_decl_line(0x2d)
    3599                            .dwattr $C$DW$293, DW_AT_decl_column(0x15)
    3600                    $C$DW$294       .dwtag  DW_TAG_member
    3601                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$34)
    3602                            .dwattr $C$DW$294, DW_AT_name("desc")
    3603                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("desc")
    3604                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3605                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3606                            .dwattr $C$DW$294, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\VLIB_
    3607                            .dwattr $C$DW$294, DW_AT_decl_line(0x2e)
    3608                            .dwattr $C$DW$294, DW_AT_decl_column(0x15)
    3609                            .dwendtag $C$DW$T$35
    3610                    
    3611                            .dwattr $C$DW$T$35, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\VLIB
    3612                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x24)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   74

    3613                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x10)
    3614                    $C$DW$T$82      .dwtag  DW_TAG_pointer_type
    3615                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$35)
    3616                            .dwattr $C$DW$T$82, DW_AT_address_class(0x20)
    3617                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("afast12_detectCorners_testParams_t")
    3618                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$35)
    3619                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3620                            .dwattr $C$DW$T$84, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\VLIB
    3621                            .dwattr $C$DW$T$84, DW_AT_decl_line(0x2f)
    3622                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x03)
    3623                    $C$DW$T$85      .dwtag  DW_TAG_pointer_type
    3624                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$84)
    3625                            .dwattr $C$DW$T$85, DW_AT_address_class(0x20)
    3626                    $C$DW$T$86      .dwtag  DW_TAG_pointer_type
    3627                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$85)
    3628                            .dwattr $C$DW$T$86, DW_AT_address_class(0x20)
    3629                    
    3630                    $C$DW$T$40      .dwtag  DW_TAG_structure_type
    3631                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x5a008)
    3632                    $C$DW$295       .dwtag  DW_TAG_member
    3633                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$19)
    3634                            .dwattr $C$DW$295, DW_AT_name("octave")
    3635                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("octave")
    3636                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3637                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3638                            .dwattr $C$DW$295, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3639                            .dwattr $C$DW$295, DW_AT_decl_line(0xb9)
    3640                            .dwattr $C$DW$295, DW_AT_decl_column(0x0d)
    3641                    $C$DW$296       .dwtag  DW_TAG_member
    3642                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$37)
    3643                            .dwattr $C$DW$296, DW_AT_name("relative_patterns")
    3644                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("relative_patterns")
    3645                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3646                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3647                            .dwattr $C$DW$296, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3648                            .dwattr $C$DW$296, DW_AT_decl_line(0xbb)
    3649                            .dwattr $C$DW$296, DW_AT_decl_column(0x0d)
    3650                    $C$DW$297       .dwtag  DW_TAG_member
    3651                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$39)
    3652                            .dwattr $C$DW$297, DW_AT_name("rotated_patterns")
    3653                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("rotated_patterns")
    3654                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c004]
    3655                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3656                            .dwattr $C$DW$297, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3657                            .dwattr $C$DW$297, DW_AT_decl_line(0xbc)
    3658                            .dwattr $C$DW$297, DW_AT_decl_column(0x0d)
    3659                    $C$DW$298       .dwtag  DW_TAG_member
    3660                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$19)
    3661                            .dwattr $C$DW$298, DW_AT_name("integralImageWidth")
    3662                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("integralImageWidth")
    3663                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a004]
    3664                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3665                            .dwattr $C$DW$298, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3666                            .dwattr $C$DW$298, DW_AT_decl_line(0xbd)
    3667                            .dwattr $C$DW$298, DW_AT_decl_column(0x0d)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   75

    3668                            .dwendtag $C$DW$T$40
    3669                    
    3670                            .dwattr $C$DW$T$40, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3671                            .dwattr $C$DW$T$40, DW_AT_decl_line(0xb8)
    3672                            .dwattr $C$DW$T$40, DW_AT_decl_column(0x10)
    3673                    $C$DW$T$44      .dwtag  DW_TAG_typedef, DW_AT_name("CORBPatterns")
    3674                            .dwattr $C$DW$T$44, DW_AT_type(*$C$DW$T$40)
    3675                            .dwattr $C$DW$T$44, DW_AT_language(DW_LANG_C)
    3676                            .dwattr $C$DW$T$44, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3677                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xbe)
    3678                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x02)
    3679                    
    3680                    $C$DW$T$43      .dwtag  DW_TAG_structure_type
    3681                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x400)
    3682                    $C$DW$299       .dwtag  DW_TAG_member
    3683                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$41)
    3684                            .dwattr $C$DW$299, DW_AT_name("orientation_horizontal_offsets")
    3685                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("orientation_horizontal_offsets")
    3686                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3687                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3688                            .dwattr $C$DW$299, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3689                            .dwattr $C$DW$299, DW_AT_decl_line(0xc4)
    3690                            .dwattr $C$DW$299, DW_AT_decl_column(0x0d)
    3691                    $C$DW$300       .dwtag  DW_TAG_member
    3692                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$41)
    3693                            .dwattr $C$DW$300, DW_AT_name("orientation_vertical_offsets")
    3694                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("orientation_vertical_offsets")
    3695                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
    3696                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3697                            .dwattr $C$DW$300, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3698                            .dwattr $C$DW$300, DW_AT_decl_line(0xc5)
    3699                            .dwattr $C$DW$300, DW_AT_decl_column(0x0d)
    3700                    $C$DW$301       .dwtag  DW_TAG_member
    3701                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$42)
    3702                            .dwattr $C$DW$301, DW_AT_name("u_max")
    3703                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("u_max")
    3704                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c0]
    3705                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3706                            .dwattr $C$DW$301, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3707                            .dwattr $C$DW$301, DW_AT_decl_line(0xc6)
    3708                            .dwattr $C$DW$301, DW_AT_decl_column(0x0d)
    3709                            .dwendtag $C$DW$T$43
    3710                    
    3711                            .dwattr $C$DW$T$43, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3712                            .dwattr $C$DW$T$43, DW_AT_decl_line(0xc3)
    3713                            .dwattr $C$DW$T$43, DW_AT_decl_column(0x10)
    3714                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOrientationOffsets")
    3715                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$43)
    3716                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3717                            .dwattr $C$DW$T$45, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3718                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xc7)
    3719                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x02)
    3720                    
    3721                    $C$DW$T$50      .dwtag  DW_TAG_structure_type
    3722                            .dwattr $C$DW$T$50, DW_AT_byte_size(0x5a420)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   76

    3723                    $C$DW$302       .dwtag  DW_TAG_member
    3724                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$44)
    3725                            .dwattr $C$DW$302, DW_AT_name("patterns")
    3726                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("patterns")
    3727                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3728                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3729                            .dwattr $C$DW$302, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3730                            .dwattr $C$DW$302, DW_AT_decl_line(0xcd)
    3731                            .dwattr $C$DW$302, DW_AT_decl_column(0x1c)
    3732                    $C$DW$303       .dwtag  DW_TAG_member
    3733                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$45)
    3734                            .dwattr $C$DW$303, DW_AT_name("offsets")
    3735                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("offsets")
    3736                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a008]
    3737                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3738                            .dwattr $C$DW$303, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3739                            .dwattr $C$DW$303, DW_AT_decl_line(0xce)
    3740                            .dwattr $C$DW$303, DW_AT_decl_column(0x1c)
    3741                    $C$DW$304       .dwtag  DW_TAG_member
    3742                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$26)
    3743                            .dwattr $C$DW$304, DW_AT_name("image")
    3744                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("image")
    3745                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a408]
    3746                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3747                            .dwattr $C$DW$304, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3748                            .dwattr $C$DW$304, DW_AT_decl_line(0xcf)
    3749                            .dwattr $C$DW$304, DW_AT_decl_column(0x1c)
    3750                    $C$DW$305       .dwtag  DW_TAG_member
    3751                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$26)
    3752                            .dwattr $C$DW$305, DW_AT_name("prefimage")
    3753                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("prefimage")
    3754                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a40c]
    3755                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3756                            .dwattr $C$DW$305, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3757                            .dwattr $C$DW$305, DW_AT_decl_line(0xd0)
    3758                            .dwattr $C$DW$305, DW_AT_decl_column(0x1c)
    3759                    $C$DW$306       .dwtag  DW_TAG_member
    3760                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$46)
    3761                            .dwattr $C$DW$306, DW_AT_name("harrisImage")
    3762                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("harrisImage")
    3763                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a410]
    3764                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3765                            .dwattr $C$DW$306, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3766                            .dwattr $C$DW$306, DW_AT_decl_line(0xd1)
    3767                            .dwattr $C$DW$306, DW_AT_decl_column(0x1c)
    3768                    $C$DW$307       .dwtag  DW_TAG_member
    3769                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$47)
    3770                            .dwattr $C$DW$307, DW_AT_name("integralImage")
    3771                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("integralImage")
    3772                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a414]
    3773                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3774                            .dwattr $C$DW$307, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3775                            .dwattr $C$DW$307, DW_AT_decl_line(0xd2)
    3776                            .dwattr $C$DW$307, DW_AT_decl_column(0x1c)
    3777                    $C$DW$308       .dwtag  DW_TAG_member
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   77

    3778                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$34)
    3779                            .dwattr $C$DW$308, DW_AT_name("scratchBuffer")
    3780                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("scratchBuffer")
    3781                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a418]
    3782                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3783                            .dwattr $C$DW$308, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3784                            .dwattr $C$DW$308, DW_AT_decl_line(0xd3)
    3785                            .dwattr $C$DW$308, DW_AT_decl_column(0x1c)
    3786                    $C$DW$309       .dwtag  DW_TAG_member
    3787                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$49)
    3788                            .dwattr $C$DW$309, DW_AT_name("orbPattern31")
    3789                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("orbPattern31")
    3790                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a41c]
    3791                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3792                            .dwattr $C$DW$309, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3793                            .dwattr $C$DW$309, DW_AT_decl_line(0xd4)
    3794                            .dwattr $C$DW$309, DW_AT_decl_column(0x1c)
    3795                            .dwendtag $C$DW$T$50
    3796                    
    3797                            .dwattr $C$DW$T$50, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3798                            .dwattr $C$DW$T$50, DW_AT_decl_line(0xcc)
    3799                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x10)
    3800                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("CORBInput")
    3801                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$50)
    3802                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3803                            .dwattr $C$DW$T$87, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3804                            .dwattr $C$DW$T$87, DW_AT_decl_line(0xd5)
    3805                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x02)
    3806                    $C$DW$T$88      .dwtag  DW_TAG_pointer_type
    3807                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$87)
    3808                            .dwattr $C$DW$T$88, DW_AT_address_class(0x20)
    3809                    
    3810                    $C$DW$T$53      .dwtag  DW_TAG_structure_type
    3811                            .dwattr $C$DW$T$53, DW_AT_byte_size(0x08)
    3812                    $C$DW$310       .dwtag  DW_TAG_member
    3813                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$52)
    3814                            .dwattr $C$DW$310, DW_AT_name("features")
    3815                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("features")
    3816                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3817                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3818                            .dwattr $C$DW$310, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3819                            .dwattr $C$DW$310, DW_AT_decl_line(0xed)
    3820                            .dwattr $C$DW$310, DW_AT_decl_column(0x12)
    3821                    $C$DW$311       .dwtag  DW_TAG_member
    3822                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$19)
    3823                            .dwattr $C$DW$311, DW_AT_name("n_features")
    3824                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("n_features")
    3825                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3826                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3827                            .dwattr $C$DW$311, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    3828                            .dwattr $C$DW$311, DW_AT_decl_line(0xee)
    3829                            .dwattr $C$DW$311, DW_AT_decl_column(0x12)
    3830                            .dwendtag $C$DW$T$53
    3831                    
    3832                            .dwattr $C$DW$T$53, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   78

    3833                            .dwattr $C$DW$T$53, DW_AT_decl_line(0xec)
    3834                            .dwattr $C$DW$T$53, DW_AT_decl_column(0x10)
    3835                    $C$DW$T$90      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOutput")
    3836                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$53)
    3837                            .dwattr $C$DW$T$90, DW_AT_language(DW_LANG_C)
    3838                            .dwattr $C$DW$T$90, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    3839                            .dwattr $C$DW$T$90, DW_AT_decl_line(0xef)
    3840                            .dwattr $C$DW$T$90, DW_AT_decl_column(0x02)
    3841                    $C$DW$T$91      .dwtag  DW_TAG_pointer_type
    3842                            .dwattr $C$DW$T$91, DW_AT_type(*$C$DW$T$90)
    3843                            .dwattr $C$DW$T$91, DW_AT_address_class(0x20)
    3844                    
    3845                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3846                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x18)
    3847                    $C$DW$312       .dwtag  DW_TAG_member
    3848                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$10)
    3849                            .dwattr $C$DW$312, DW_AT_name("fd")
    3850                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("fd")
    3851                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3852                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3853                            .dwattr $C$DW$312, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3854                            .dwattr $C$DW$312, DW_AT_decl_line(0x49)
    3855                            .dwattr $C$DW$312, DW_AT_decl_column(0x0b)
    3856                    $C$DW$313       .dwtag  DW_TAG_member
    3857                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$54)
    3858                            .dwattr $C$DW$313, DW_AT_name("buf")
    3859                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("buf")
    3860                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3861                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3862                            .dwattr $C$DW$313, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3863                            .dwattr $C$DW$313, DW_AT_decl_line(0x4a)
    3864                            .dwattr $C$DW$313, DW_AT_decl_column(0x16)
    3865                    $C$DW$314       .dwtag  DW_TAG_member
    3866                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$54)
    3867                            .dwattr $C$DW$314, DW_AT_name("pos")
    3868                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("pos")
    3869                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3870                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3871                            .dwattr $C$DW$314, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3872                            .dwattr $C$DW$314, DW_AT_decl_line(0x4b)
    3873                            .dwattr $C$DW$314, DW_AT_decl_column(0x16)
    3874                    $C$DW$315       .dwtag  DW_TAG_member
    3875                            .dwattr $C$DW$315, DW_AT_type(*$C$DW$T$54)
    3876                            .dwattr $C$DW$315, DW_AT_name("bufend")
    3877                            .dwattr $C$DW$315, DW_AT_TI_symbol_name("bufend")
    3878                            .dwattr $C$DW$315, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3879                            .dwattr $C$DW$315, DW_AT_accessibility(DW_ACCESS_public)
    3880                            .dwattr $C$DW$315, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3881                            .dwattr $C$DW$315, DW_AT_decl_line(0x4c)
    3882                            .dwattr $C$DW$315, DW_AT_decl_column(0x16)
    3883                    $C$DW$316       .dwtag  DW_TAG_member
    3884                            .dwattr $C$DW$316, DW_AT_type(*$C$DW$T$54)
    3885                            .dwattr $C$DW$316, DW_AT_name("buff_stop")
    3886                            .dwattr $C$DW$316, DW_AT_TI_symbol_name("buff_stop")
    3887                            .dwattr $C$DW$316, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   79

    3888                            .dwattr $C$DW$316, DW_AT_accessibility(DW_ACCESS_public)
    3889                            .dwattr $C$DW$316, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3890                            .dwattr $C$DW$316, DW_AT_decl_line(0x4d)
    3891                            .dwattr $C$DW$316, DW_AT_decl_column(0x16)
    3892                    $C$DW$317       .dwtag  DW_TAG_member
    3893                            .dwattr $C$DW$317, DW_AT_type(*$C$DW$T$11)
    3894                            .dwattr $C$DW$317, DW_AT_name("flags")
    3895                            .dwattr $C$DW$317, DW_AT_TI_symbol_name("flags")
    3896                            .dwattr $C$DW$317, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3897                            .dwattr $C$DW$317, DW_AT_accessibility(DW_ACCESS_public)
    3898                            .dwattr $C$DW$317, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3899                            .dwattr $C$DW$317, DW_AT_decl_line(0x4e)
    3900                            .dwattr $C$DW$317, DW_AT_decl_column(0x16)
    3901                            .dwendtag $C$DW$T$55
    3902                    
    3903                            .dwattr $C$DW$T$55, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3904                            .dwattr $C$DW$T$55, DW_AT_decl_line(0x48)
    3905                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    3906                    $C$DW$T$93      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3907                            .dwattr $C$DW$T$93, DW_AT_type(*$C$DW$T$55)
    3908                            .dwattr $C$DW$T$93, DW_AT_language(DW_LANG_C)
    3909                            .dwattr $C$DW$T$93, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3910                            .dwattr $C$DW$T$93, DW_AT_decl_line(0x4f)
    3911                            .dwattr $C$DW$T$93, DW_AT_decl_column(0x03)
    3912                    
    3913                    $C$DW$T$56      .dwtag  DW_TAG_structure_type
    3914                            .dwattr $C$DW$T$56, DW_AT_byte_size(0x08)
    3915                    $C$DW$318       .dwtag  DW_TAG_member
    3916                            .dwattr $C$DW$318, DW_AT_type(*$C$DW$T$10)
    3917                            .dwattr $C$DW$318, DW_AT_name("quot")
    3918                            .dwattr $C$DW$318, DW_AT_TI_symbol_name("quot")
    3919                            .dwattr $C$DW$318, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3920                            .dwattr $C$DW$318, DW_AT_accessibility(DW_ACCESS_public)
    3921                            .dwattr $C$DW$318, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3922                            .dwattr $C$DW$318, DW_AT_decl_line(0x3e)
    3923                            .dwattr $C$DW$318, DW_AT_decl_column(0x16)
    3924                    $C$DW$319       .dwtag  DW_TAG_member
    3925                            .dwattr $C$DW$319, DW_AT_type(*$C$DW$T$10)
    3926                            .dwattr $C$DW$319, DW_AT_name("rem")
    3927                            .dwattr $C$DW$319, DW_AT_TI_symbol_name("rem")
    3928                            .dwattr $C$DW$319, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3929                            .dwattr $C$DW$319, DW_AT_accessibility(DW_ACCESS_public)
    3930                            .dwattr $C$DW$319, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3931                            .dwattr $C$DW$319, DW_AT_decl_line(0x3e)
    3932                            .dwattr $C$DW$319, DW_AT_decl_column(0x1c)
    3933                            .dwendtag $C$DW$T$56
    3934                    
    3935                            .dwattr $C$DW$T$56, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3936                            .dwattr $C$DW$T$56, DW_AT_decl_line(0x3e)
    3937                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x10)
    3938                    $C$DW$T$94      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3939                            .dwattr $C$DW$T$94, DW_AT_type(*$C$DW$T$56)
    3940                            .dwattr $C$DW$T$94, DW_AT_language(DW_LANG_C)
    3941                            .dwattr $C$DW$T$94, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3942                            .dwattr $C$DW$T$94, DW_AT_decl_line(0x3e)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   80

    3943                            .dwattr $C$DW$T$94, DW_AT_decl_column(0x23)
    3944                    
    3945                    $C$DW$T$57      .dwtag  DW_TAG_structure_type
    3946                            .dwattr $C$DW$T$57, DW_AT_byte_size(0x08)
    3947                    $C$DW$320       .dwtag  DW_TAG_member
    3948                            .dwattr $C$DW$320, DW_AT_type(*$C$DW$T$10)
    3949                            .dwattr $C$DW$320, DW_AT_name("quot")
    3950                            .dwattr $C$DW$320, DW_AT_TI_symbol_name("quot")
    3951                            .dwattr $C$DW$320, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3952                            .dwattr $C$DW$320, DW_AT_accessibility(DW_ACCESS_public)
    3953                            .dwattr $C$DW$320, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3954                            .dwattr $C$DW$320, DW_AT_decl_line(0x40)
    3955                            .dwattr $C$DW$320, DW_AT_decl_column(0x17)
    3956                    $C$DW$321       .dwtag  DW_TAG_member
    3957                            .dwattr $C$DW$321, DW_AT_type(*$C$DW$T$10)
    3958                            .dwattr $C$DW$321, DW_AT_name("rem")
    3959                            .dwattr $C$DW$321, DW_AT_TI_symbol_name("rem")
    3960                            .dwattr $C$DW$321, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3961                            .dwattr $C$DW$321, DW_AT_accessibility(DW_ACCESS_public)
    3962                            .dwattr $C$DW$321, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3963                            .dwattr $C$DW$321, DW_AT_decl_line(0x40)
    3964                            .dwattr $C$DW$321, DW_AT_decl_column(0x1d)
    3965                            .dwendtag $C$DW$T$57
    3966                    
    3967                            .dwattr $C$DW$T$57, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3968                            .dwattr $C$DW$T$57, DW_AT_decl_line(0x40)
    3969                            .dwattr $C$DW$T$57, DW_AT_decl_column(0x10)
    3970                    $C$DW$T$95      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3971                            .dwattr $C$DW$T$95, DW_AT_type(*$C$DW$T$57)
    3972                            .dwattr $C$DW$T$95, DW_AT_language(DW_LANG_C)
    3973                            .dwattr $C$DW$T$95, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3974                            .dwattr $C$DW$T$95, DW_AT_decl_line(0x40)
    3975                            .dwattr $C$DW$T$95, DW_AT_decl_column(0x24)
    3976                    
    3977                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3978                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x10)
    3979                    $C$DW$322       .dwtag  DW_TAG_member
    3980                            .dwattr $C$DW$322, DW_AT_type(*$C$DW$T$14)
    3981                            .dwattr $C$DW$322, DW_AT_name("quot")
    3982                            .dwattr $C$DW$322, DW_AT_TI_symbol_name("quot")
    3983                            .dwattr $C$DW$322, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3984                            .dwattr $C$DW$322, DW_AT_accessibility(DW_ACCESS_public)
    3985                            .dwattr $C$DW$322, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3986                            .dwattr $C$DW$322, DW_AT_decl_line(0x43)
    3987                            .dwattr $C$DW$322, DW_AT_decl_column(0x1c)
    3988                    $C$DW$323       .dwtag  DW_TAG_member
    3989                            .dwattr $C$DW$323, DW_AT_type(*$C$DW$T$14)
    3990                            .dwattr $C$DW$323, DW_AT_name("rem")
    3991                            .dwattr $C$DW$323, DW_AT_TI_symbol_name("rem")
    3992                            .dwattr $C$DW$323, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3993                            .dwattr $C$DW$323, DW_AT_accessibility(DW_ACCESS_public)
    3994                            .dwattr $C$DW$323, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3995                            .dwattr $C$DW$323, DW_AT_decl_line(0x43)
    3996                            .dwattr $C$DW$323, DW_AT_decl_column(0x22)
    3997                            .dwendtag $C$DW$T$58
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   81

    3998                    
    3999                            .dwattr $C$DW$T$58, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4000                            .dwattr $C$DW$T$58, DW_AT_decl_line(0x43)
    4001                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    4002                    $C$DW$T$96      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    4003                            .dwattr $C$DW$T$96, DW_AT_type(*$C$DW$T$58)
    4004                            .dwattr $C$DW$T$96, DW_AT_language(DW_LANG_C)
    4005                            .dwattr $C$DW$T$96, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4006                            .dwattr $C$DW$T$96, DW_AT_decl_line(0x43)
    4007                            .dwattr $C$DW$T$96, DW_AT_decl_column(0x29)
    4008                    
    4009                    $C$DW$T$59      .dwtag  DW_TAG_structure_type
    4010                            .dwattr $C$DW$T$59, DW_AT_byte_size(0x24)
    4011                    $C$DW$324       .dwtag  DW_TAG_member
    4012                            .dwattr $C$DW$324, DW_AT_type(*$C$DW$T$19)
    4013                            .dwattr $C$DW$324, DW_AT_name("area")
    4014                            .dwattr $C$DW$324, DW_AT_TI_symbol_name("area")
    4015                            .dwattr $C$DW$324, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4016                            .dwattr $C$DW$324, DW_AT_accessibility(DW_ACCESS_public)
    4017                            .dwattr $C$DW$324, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    4018                            .dwattr $C$DW$324, DW_AT_decl_line(0x69)
    4019                            .dwattr $C$DW$324, DW_AT_decl_column(0x0d)
    4020                    $C$DW$325       .dwtag  DW_TAG_member
    4021                            .dwattr $C$DW$325, DW_AT_type(*$C$DW$T$19)
    4022                            .dwattr $C$DW$325, DW_AT_name("xsum")
    4023                            .dwattr $C$DW$325, DW_AT_TI_symbol_name("xsum")
    4024                            .dwattr $C$DW$325, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4025                            .dwattr $C$DW$325, DW_AT_accessibility(DW_ACCESS_public)
    4026                            .dwattr $C$DW$325, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    4027                            .dwattr $C$DW$325, DW_AT_decl_line(0x6a)
    4028                            .dwattr $C$DW$325, DW_AT_decl_column(0x0d)
    4029                    $C$DW$326       .dwtag  DW_TAG_member
    4030                            .dwattr $C$DW$326, DW_AT_type(*$C$DW$T$19)
    4031                            .dwattr $C$DW$326, DW_AT_name("ysum")
    4032                            .dwattr $C$DW$326, DW_AT_TI_symbol_name("ysum")
    4033                            .dwattr $C$DW$326, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4034                            .dwattr $C$DW$326, DW_AT_accessibility(DW_ACCESS_public)
    4035                            .dwattr $C$DW$326, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    4036                            .dwattr $C$DW$326, DW_AT_decl_line(0x6b)
    4037                            .dwattr $C$DW$326, DW_AT_decl_column(0x0d)
    4038                    $C$DW$327       .dwtag  DW_TAG_member
    4039                            .dwattr $C$DW$327, DW_AT_type(*$C$DW$T$19)
    4040                            .dwattr $C$DW$327, DW_AT_name("xmin")
    4041                            .dwattr $C$DW$327, DW_AT_TI_symbol_name("xmin")
    4042                            .dwattr $C$DW$327, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4043                            .dwattr $C$DW$327, DW_AT_accessibility(DW_ACCESS_public)
    4044                            .dwattr $C$DW$327, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    4045                            .dwattr $C$DW$327, DW_AT_decl_line(0x6d)
    4046                            .dwattr $C$DW$327, DW_AT_decl_column(0x0d)
    4047                    $C$DW$328       .dwtag  DW_TAG_member
    4048                            .dwattr $C$DW$328, DW_AT_type(*$C$DW$T$19)
    4049                            .dwattr $C$DW$328, DW_AT_name("ymin")
    4050                            .dwattr $C$DW$328, DW_AT_TI_symbol_name("ymin")
    4051                            .dwattr $C$DW$328, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    4052                            .dwattr $C$DW$328, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   82

    4053                            .dwattr $C$DW$328, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    4054                            .dwattr $C$DW$328, DW_AT_decl_line(0x6e)
    4055                            .dwattr $C$DW$328, DW_AT_decl_column(0x0d)
    4056                    $C$DW$329       .dwtag  DW_TAG_member
    4057                            .dwattr $C$DW$329, DW_AT_type(*$C$DW$T$19)
    4058                            .dwattr $C$DW$329, DW_AT_name("xmax")
    4059                            .dwattr $C$DW$329, DW_AT_TI_symbol_name("xmax")
    4060                            .dwattr $C$DW$329, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    4061                            .dwattr $C$DW$329, DW_AT_accessibility(DW_ACCESS_public)
    4062                            .dwattr $C$DW$329, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    4063                            .dwattr $C$DW$329, DW_AT_decl_line(0x6f)
    4064                            .dwattr $C$DW$329, DW_AT_decl_column(0x0d)
    4065                    $C$DW$330       .dwtag  DW_TAG_member
    4066                            .dwattr $C$DW$330, DW_AT_type(*$C$DW$T$19)
    4067                            .dwattr $C$DW$330, DW_AT_name("ymax")
    4068                            .dwattr $C$DW$330, DW_AT_TI_symbol_name("ymax")
    4069                            .dwattr $C$DW$330, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    4070                            .dwattr $C$DW$330, DW_AT_accessibility(DW_ACCESS_public)
    4071                            .dwattr $C$DW$330, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    4072                            .dwattr $C$DW$330, DW_AT_decl_line(0x70)
    4073                            .dwattr $C$DW$330, DW_AT_decl_column(0x0d)
    4074                    $C$DW$331       .dwtag  DW_TAG_member
    4075                            .dwattr $C$DW$331, DW_AT_type(*$C$DW$T$19)
    4076                            .dwattr $C$DW$331, DW_AT_name("seedx")
    4077                            .dwattr $C$DW$331, DW_AT_TI_symbol_name("seedx")
    4078                            .dwattr $C$DW$331, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    4079                            .dwattr $C$DW$331, DW_AT_accessibility(DW_ACCESS_public)
    4080                            .dwattr $C$DW$331, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    4081                            .dwattr $C$DW$331, DW_AT_decl_line(0x72)
    4082                            .dwattr $C$DW$331, DW_AT_decl_column(0x0d)
    4083                    $C$DW$332       .dwtag  DW_TAG_member
    4084                            .dwattr $C$DW$332, DW_AT_type(*$C$DW$T$19)
    4085                            .dwattr $C$DW$332, DW_AT_name("seedy")
    4086                            .dwattr $C$DW$332, DW_AT_TI_symbol_name("seedy")
    4087                            .dwattr $C$DW$332, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    4088                            .dwattr $C$DW$332, DW_AT_accessibility(DW_ACCESS_public)
    4089                            .dwattr $C$DW$332, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\co
    4090                            .dwattr $C$DW$332, DW_AT_decl_line(0x73)
    4091                            .dwattr $C$DW$332, DW_AT_decl_column(0x0d)
    4092                            .dwendtag $C$DW$T$59
    4093                    
    4094                            .dwattr $C$DW$T$59, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    4095                            .dwattr $C$DW$T$59, DW_AT_decl_line(0x68)
    4096                            .dwattr $C$DW$T$59, DW_AT_decl_column(0x10)
    4097                    $C$DW$T$97      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    4098                            .dwattr $C$DW$T$97, DW_AT_type(*$C$DW$T$59)
    4099                            .dwattr $C$DW$T$97, DW_AT_language(DW_LANG_C)
    4100                            .dwattr $C$DW$T$97, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\c
    4101                            .dwattr $C$DW$T$97, DW_AT_decl_line(0x75)
    4102                            .dwattr $C$DW$T$97, DW_AT_decl_column(0x03)
    4103                    
    4104                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    4105                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x10)
    4106                    $C$DW$333       .dwtag  DW_TAG_member
    4107                            .dwattr $C$DW$333, DW_AT_type(*$C$DW$T$8)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   83

    4108                            .dwattr $C$DW$333, DW_AT_name("daylight")
    4109                            .dwattr $C$DW$333, DW_AT_TI_symbol_name("daylight")
    4110                            .dwattr $C$DW$333, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4111                            .dwattr $C$DW$333, DW_AT_accessibility(DW_ACCESS_public)
    4112                            .dwattr $C$DW$333, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4113                            .dwattr $C$DW$333, DW_AT_decl_line(0x52)
    4114                            .dwattr $C$DW$333, DW_AT_decl_column(0x0b)
    4115                    $C$DW$334       .dwtag  DW_TAG_member
    4116                            .dwattr $C$DW$334, DW_AT_type(*$C$DW$T$10)
    4117                            .dwattr $C$DW$334, DW_AT_name("timezone")
    4118                            .dwattr $C$DW$334, DW_AT_TI_symbol_name("timezone")
    4119                            .dwattr $C$DW$334, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    4120                            .dwattr $C$DW$334, DW_AT_accessibility(DW_ACCESS_public)
    4121                            .dwattr $C$DW$334, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4122                            .dwattr $C$DW$334, DW_AT_decl_line(0x53)
    4123                            .dwattr $C$DW$334, DW_AT_decl_column(0x0b)
    4124                    $C$DW$335       .dwtag  DW_TAG_member
    4125                            .dwattr $C$DW$335, DW_AT_type(*$C$DW$T$60)
    4126                            .dwattr $C$DW$335, DW_AT_name("tzname")
    4127                            .dwattr $C$DW$335, DW_AT_TI_symbol_name("tzname")
    4128                            .dwattr $C$DW$335, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    4129                            .dwattr $C$DW$335, DW_AT_accessibility(DW_ACCESS_public)
    4130                            .dwattr $C$DW$335, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4131                            .dwattr $C$DW$335, DW_AT_decl_line(0x54)
    4132                            .dwattr $C$DW$335, DW_AT_decl_column(0x0b)
    4133                    $C$DW$336       .dwtag  DW_TAG_member
    4134                            .dwattr $C$DW$336, DW_AT_type(*$C$DW$T$60)
    4135                            .dwattr $C$DW$336, DW_AT_name("dstname")
    4136                            .dwattr $C$DW$336, DW_AT_TI_symbol_name("dstname")
    4137                            .dwattr $C$DW$336, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    4138                            .dwattr $C$DW$336, DW_AT_accessibility(DW_ACCESS_public)
    4139                            .dwattr $C$DW$336, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    4140                            .dwattr $C$DW$336, DW_AT_decl_line(0x55)
    4141                            .dwattr $C$DW$336, DW_AT_decl_column(0x0b)
    4142                            .dwendtag $C$DW$T$61
    4143                    
    4144                            .dwattr $C$DW$T$61, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4145                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x51)
    4146                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x01)
    4147                    $C$DW$T$98      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    4148                            .dwattr $C$DW$T$98, DW_AT_type(*$C$DW$T$61)
    4149                            .dwattr $C$DW$T$98, DW_AT_language(DW_LANG_C)
    4150                            .dwattr $C$DW$T$98, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4151                            .dwattr $C$DW$T$98, DW_AT_decl_line(0x56)
    4152                            .dwattr $C$DW$T$98, DW_AT_decl_column(0x03)
    4153                    
    4154                    $C$DW$T$64      .dwtag  DW_TAG_structure_type
    4155                            .dwattr $C$DW$T$64, DW_AT_byte_size(0x20)
    4156                    $C$DW$337       .dwtag  DW_TAG_member
    4157                            .dwattr $C$DW$337, DW_AT_type(*$C$DW$T$63)
    4158                            .dwattr $C$DW$337, DW_AT_name("val")
    4159                            .dwattr $C$DW$337, DW_AT_TI_symbol_name("val")
    4160                            .dwattr $C$DW$337, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    4161                            .dwattr $C$DW$337, DW_AT_accessibility(DW_ACCESS_public)
    4162                            .dwattr $C$DW$337, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\../co
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   84

    4163                            .dwattr $C$DW$337, DW_AT_decl_line(0x25)
    4164                            .dwattr $C$DW$337, DW_AT_decl_column(0x0c)
    4165                            .dwendtag $C$DW$T$64
    4166                    
    4167                            .dwattr $C$DW$T$64, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\../c
    4168                            .dwattr $C$DW$T$64, DW_AT_decl_line(0x24)
    4169                            .dwattr $C$DW$T$64, DW_AT_decl_column(0x10)
    4170                    $C$DW$T$99      .dwtag  DW_TAG_typedef, DW_AT_name("RotationMatrix")
    4171                            .dwattr $C$DW$T$99, DW_AT_type(*$C$DW$T$64)
    4172                            .dwattr $C$DW$T$99, DW_AT_language(DW_LANG_C)
    4173                            .dwattr $C$DW$T$99, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\../c
    4174                            .dwattr $C$DW$T$99, DW_AT_decl_line(0x26)
    4175                            .dwattr $C$DW$T$99, DW_AT_decl_column(0x02)
    4176                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    4177                            .dwattr $C$DW$T$2, DW_AT_name("void")
    4178                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    4179                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    4180                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    4181                    $C$DW$T$100     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    4182                            .dwattr $C$DW$T$100, DW_AT_type(*$C$DW$T$3)
    4183                            .dwattr $C$DW$T$100, DW_AT_language(DW_LANG_C)
    4184                            .dwattr $C$DW$T$100, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\
    4185                            .dwattr $C$DW$T$100, DW_AT_decl_line(0x5c)
    4186                            .dwattr $C$DW$T$100, DW_AT_decl_column(0x19)
    4187                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    4188                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    4189                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    4190                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    4191                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    4192                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    4193                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    4194                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    4195                    $C$DW$T$127     .dwtag  DW_TAG_pointer_type
    4196                            .dwattr $C$DW$T$127, DW_AT_type(*$C$DW$T$5)
    4197                            .dwattr $C$DW$T$127, DW_AT_address_class(0x20)
    4198                    $C$DW$T$48      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    4199                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$5)
    4200                            .dwattr $C$DW$T$48, DW_AT_language(DW_LANG_C)
    4201                            .dwattr $C$DW$T$48, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4202                            .dwattr $C$DW$T$48, DW_AT_decl_line(0x2a)
    4203                            .dwattr $C$DW$T$48, DW_AT_decl_column(0x1d)
    4204                    $C$DW$T$49      .dwtag  DW_TAG_pointer_type
    4205                            .dwattr $C$DW$T$49, DW_AT_type(*$C$DW$T$48)
    4206                            .dwattr $C$DW$T$49, DW_AT_address_class(0x20)
    4207                    $C$DW$T$139     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    4208                            .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$48)
    4209                            .dwattr $C$DW$T$139, DW_AT_language(DW_LANG_C)
    4210                            .dwattr $C$DW$T$139, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4211                            .dwattr $C$DW$T$139, DW_AT_decl_line(0x39)
    4212                            .dwattr $C$DW$T$139, DW_AT_decl_column(0x17)
    4213                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    4214                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    4215                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    4216                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    4217                    $C$DW$T$54      .dwtag  DW_TAG_pointer_type
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   85

    4218                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$6)
    4219                            .dwattr $C$DW$T$54, DW_AT_address_class(0x20)
    4220                    $C$DW$T$140     .dwtag  DW_TAG_const_type
    4221                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$6)
    4222                    $C$DW$T$141     .dwtag  DW_TAG_pointer_type
    4223                            .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$140)
    4224                            .dwattr $C$DW$T$141, DW_AT_address_class(0x20)
    4225                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    4226                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$6)
    4227                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    4228                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4229                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x2b)
    4230                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x1c)
    4231                    
    4232                    $C$DW$T$24      .dwtag  DW_TAG_array_type
    4233                            .dwattr $C$DW$T$24, DW_AT_type(*$C$DW$T$20)
    4234                            .dwattr $C$DW$T$24, DW_AT_language(DW_LANG_C)
    4235                            .dwattr $C$DW$T$24, DW_AT_byte_size(0x20)
    4236                    $C$DW$338       .dwtag  DW_TAG_subrange_type
    4237                            .dwattr $C$DW$338, DW_AT_upper_bound(0x1f)
    4238                            .dwendtag $C$DW$T$24
    4239                    
    4240                    $C$DW$T$26      .dwtag  DW_TAG_pointer_type
    4241                            .dwattr $C$DW$T$26, DW_AT_type(*$C$DW$T$20)
    4242                            .dwattr $C$DW$T$26, DW_AT_address_class(0x20)
    4243                    $C$DW$T$142     .dwtag  DW_TAG_const_type
    4244                            .dwattr $C$DW$T$142, DW_AT_type(*$C$DW$T$20)
    4245                    $C$DW$T$143     .dwtag  DW_TAG_pointer_type
    4246                            .dwattr $C$DW$T$143, DW_AT_type(*$C$DW$T$142)
    4247                            .dwattr $C$DW$T$143, DW_AT_address_class(0x20)
    4248                    $C$DW$T$144     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    4249                            .dwattr $C$DW$T$144, DW_AT_type(*$C$DW$T$20)
    4250                            .dwattr $C$DW$T$144, DW_AT_language(DW_LANG_C)
    4251                            .dwattr $C$DW$T$144, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4252                            .dwattr $C$DW$T$144, DW_AT_decl_line(0x3a)
    4253                            .dwattr $C$DW$T$144, DW_AT_decl_column(0x16)
    4254                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    4255                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    4256                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    4257                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    4258                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    4259                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    4260                            .dwattr $C$DW$T$8, DW_AT_name("short")
    4261                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    4262                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    4263                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$8)
    4264                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    4265                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4266                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x2c)
    4267                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x1d)
    4268                    $C$DW$T$46      .dwtag  DW_TAG_pointer_type
    4269                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$23)
    4270                            .dwattr $C$DW$T$46, DW_AT_address_class(0x20)
    4271                    $C$DW$T$145     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    4272                            .dwattr $C$DW$T$145, DW_AT_type(*$C$DW$T$23)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   86

    4273                            .dwattr $C$DW$T$145, DW_AT_language(DW_LANG_C)
    4274                            .dwattr $C$DW$T$145, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4275                            .dwattr $C$DW$T$145, DW_AT_decl_line(0x3c)
    4276                            .dwattr $C$DW$T$145, DW_AT_decl_column(0x17)
    4277                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    4278                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    4279                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    4280                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    4281                    $C$DW$T$146     .dwtag  DW_TAG_pointer_type
    4282                            .dwattr $C$DW$T$146, DW_AT_type(*$C$DW$T$9)
    4283                            .dwattr $C$DW$T$146, DW_AT_address_class(0x20)
    4284                    $C$DW$T$147     .dwtag  DW_TAG_restrict_type
    4285                            .dwattr $C$DW$T$147, DW_AT_type(*$C$DW$T$146)
    4286                    $C$DW$T$27      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    4287                            .dwattr $C$DW$T$27, DW_AT_type(*$C$DW$T$9)
    4288                            .dwattr $C$DW$T$27, DW_AT_language(DW_LANG_C)
    4289                            .dwattr $C$DW$T$27, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4290                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x2d)
    4291                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x1c)
    4292                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    4293                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$27)
    4294                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    4295                    $C$DW$T$149     .dwtag  DW_TAG_restrict_type
    4296                            .dwattr $C$DW$T$149, DW_AT_type(*$C$DW$T$28)
    4297                    $C$DW$T$150     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    4298                            .dwattr $C$DW$T$150, DW_AT_type(*$C$DW$T$27)
    4299                            .dwattr $C$DW$T$150, DW_AT_language(DW_LANG_C)
    4300                            .dwattr $C$DW$T$150, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4301                            .dwattr $C$DW$T$150, DW_AT_decl_line(0x3d)
    4302                            .dwattr $C$DW$T$150, DW_AT_decl_column(0x16)
    4303                    $C$DW$T$148     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    4304                            .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$9)
    4305                            .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    4306                            .dwattr $C$DW$T$148, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4307                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x53)
    4308                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x1a)
    4309                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    4310                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    4311                            .dwattr $C$DW$T$10, DW_AT_name("int")
    4312                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    4313                    $C$DW$T$172     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    4314                            .dwattr $C$DW$T$172, DW_AT_type(*$C$DW$T$10)
    4315                            .dwattr $C$DW$T$172, DW_AT_language(DW_LANG_C)
    4316                            .dwattr $C$DW$T$172, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    4317                            .dwattr $C$DW$T$172, DW_AT_decl_line(0x53)
    4318                            .dwattr $C$DW$T$172, DW_AT_decl_column(0x0d)
    4319                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    4320                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$10)
    4321                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    4322                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    4323                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2e)
    4324                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1d)
    4325                    $C$DW$T$165     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    4326                            .dwattr $C$DW$T$165, DW_AT_type(*$C$DW$T$19)
    4327                            .dwattr $C$DW$T$165, DW_AT_language(DW_LANG_C)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   87

    4328                            .dwattr $C$DW$T$165, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_afast12_detectCorners\..\
    4329                            .dwattr $C$DW$T$165, DW_AT_decl_line(0x77)
    4330                            .dwattr $C$DW$T$165, DW_AT_decl_column(0x11)
    4331                    
    4332                    $C$DW$T$36      .dwtag  DW_TAG_array_type
    4333                            .dwattr $C$DW$T$36, DW_AT_type(*$C$DW$T$19)
    4334                            .dwattr $C$DW$T$36, DW_AT_language(DW_LANG_C)
    4335                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x2000)
    4336                    $C$DW$339       .dwtag  DW_TAG_subrange_type
    4337                            .dwattr $C$DW$339, DW_AT_upper_bound(0x7ff)
    4338                            .dwendtag $C$DW$T$36
    4339                    
    4340                    
    4341                    $C$DW$T$37      .dwtag  DW_TAG_array_type
    4342                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$19)
    4343                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    4344                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x3c000)
    4345                    $C$DW$340       .dwtag  DW_TAG_subrange_type
    4346                            .dwattr $C$DW$340, DW_AT_upper_bound(0x1d)
    4347                    $C$DW$341       .dwtag  DW_TAG_subrange_type
    4348                            .dwattr $C$DW$341, DW_AT_upper_bound(0x7ff)
    4349                            .dwendtag $C$DW$T$37
    4350                    
    4351                    
    4352                    $C$DW$T$38      .dwtag  DW_TAG_array_type
    4353                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$19)
    4354                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    4355                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x1000)
    4356                    $C$DW$342       .dwtag  DW_TAG_subrange_type
    4357                            .dwattr $C$DW$342, DW_AT_upper_bound(0x3ff)
    4358                            .dwendtag $C$DW$T$38
    4359                    
    4360                    
    4361                    $C$DW$T$39      .dwtag  DW_TAG_array_type
    4362                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$19)
    4363                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    4364                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x1e000)
    4365                    $C$DW$343       .dwtag  DW_TAG_subrange_type
    4366                            .dwattr $C$DW$343, DW_AT_upper_bound(0x1d)
    4367                    $C$DW$344       .dwtag  DW_TAG_subrange_type
    4368                            .dwattr $C$DW$344, DW_AT_upper_bound(0x3ff)
    4369                            .dwendtag $C$DW$T$39
    4370                    
    4371                    
    4372                    $C$DW$T$41      .dwtag  DW_TAG_array_type
    4373                            .dwattr $C$DW$T$41, DW_AT_type(*$C$DW$T$19)
    4374                            .dwattr $C$DW$T$41, DW_AT_language(DW_LANG_C)
    4375                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x1e0)
    4376                    $C$DW$345       .dwtag  DW_TAG_subrange_type
    4377                            .dwattr $C$DW$345, DW_AT_upper_bound(0x77)
    4378                            .dwendtag $C$DW$T$41
    4379                    
    4380                    
    4381                    $C$DW$T$42      .dwtag  DW_TAG_array_type
    4382                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$19)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:16 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_afast12_detectCorners/VLIB_afast12_detectCorners_d.se66 PAGE   88

    4383                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    4384                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x40)
    4385                    $C$DW$346       .dwtag  DW_TAG_subrange_type
    4386                            .dwattr $C$DW$346, DW_AT_upper_bound(0x0f)
    4387                            .dwendtag $C$DW$T$42
    4388                    
    4389                    
    4390                    $C$DW$T$65      .dwtag  DW_TAG_array_type
    4391                            .dwattr $C$DW$T$65, DW_AT_type(*$C$DW$T$19)
    4392                            .dwattr $C$DW$T$65, DW_AT_language(DW_LANG_C)
    4393                            .dwattr $C$DW$T$65, DW_AT_byte_size(0x10)
    4394                    $C$DW$347       .dwtag  DW_TAG_subrange_type
    4395                            .dwattr $C$DW$347, DW_AT_upper_bound(0x03)
    4396                            .dwendtag $C$DW$T$65
    4397                    
    4398                    $C$DW$T$123     .dwtag  DW_TAG_pointer_type
    4399                            .dwattr $C$DW$T$123, DW_AT_type(*$C$DW$T$19)
    4400                            .dwattr $C$DW$T$123, DW_AT_address_class(0x20)
    4401                    $C$DW$T$167     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    4402                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$19)
    4403                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    4404                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
