TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE    1

       1                    ;******************************************************************************
       2                    ;* TMS320C6x C/C++ Codegen                                          PC v7.4.2 *
       3                    ;* Date/Time created: Thu Mar 19 12:38:26 2015                                *
       4                    ;******************************************************************************
       5                            .compiler_opts --abi=eabi --c64p_l1d_workaround=off --endian=little --hll_source=on --long_pre
       6                    
       7                    ;******************************************************************************
       8                    ;* GLOBAL FILE PARAMETERS                                                     *
       9                    ;*                                                                            *
      10                    ;*   Architecture      : TMS320C66xx                                          *
      11                    ;*   Optimization      : Enabled at level 3                                   *

    2793                    $C$DW$T$68      .dwtag  DW_TAG_enumeration_type
    2794                            .dwattr $C$DW$T$68, DW_AT_byte_size(0x04)
    2795                    $C$DW$244       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_FAIL"), DW_AT_const_value(0x00)
    2796                            .dwattr $C$DW$244, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\../
    2797                            .dwattr $C$DW$244, DW_AT_decl_line(0x72)
    2798                            .dwattr $C$DW$244, DW_AT_decl_column(0x05)
    2799                    $C$DW$245       .dwtag  DW_TAG_enumerator, DW_AT_name("vlib_KERNEL_PASS"), DW_AT_const_value(0x01)
    2800                            .dwattr $C$DW$245, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\../
    2801                            .dwattr $C$DW$245, DW_AT_decl_line(0x73)
    2802                            .dwattr $C$DW$245, DW_AT_decl_column(0x05)
    2803                            .dwendtag $C$DW$T$68
    2804                    
    2805                            .dwattr $C$DW$T$68, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    2806                            .dwattr $C$DW$T$68, DW_AT_decl_line(0x71)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   59

    2807                            .dwattr $C$DW$T$68, DW_AT_decl_column(0x06)
    2808                    
    2809                    $C$DW$T$69      .dwtag  DW_TAG_enumeration_type
    2810                            .dwattr $C$DW$T$69, DW_AT_byte_size(0x04)
    2811                    $C$DW$246       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_FALSE"), DW_AT_const_value(0x00)
    2812                            .dwattr $C$DW$246, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    2813                            .dwattr $C$DW$246, DW_AT_decl_line(0x8f)
    2814                            .dwattr $C$DW$246, DW_AT_decl_column(0x05)
    2815                    $C$DW$247       .dwtag  DW_TAG_enumerator, DW_AT_name("BOOL_TRUE"), DW_AT_const_value(0x01)
    2816                            .dwattr $C$DW$247, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    2817                            .dwattr $C$DW$247, DW_AT_decl_line(0x90)
    2818                            .dwattr $C$DW$247, DW_AT_decl_column(0x05)
    2819                            .dwendtag $C$DW$T$69
    2820                    
    2821                            .dwattr $C$DW$T$69, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    2822                            .dwattr $C$DW$T$69, DW_AT_decl_line(0x8e)
    2823                            .dwattr $C$DW$T$69, DW_AT_decl_column(0x0e)
    2824                    $C$DW$T$70      .dwtag  DW_TAG_typedef, DW_AT_name("CORB_Bool")
    2825                            .dwattr $C$DW$T$70, DW_AT_type(*$C$DW$T$69)
    2826                            .dwattr $C$DW$T$70, DW_AT_language(DW_LANG_C)
    2827                            .dwattr $C$DW$T$70, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    2828                            .dwattr $C$DW$T$70, DW_AT_decl_line(0x91)
    2829                            .dwattr $C$DW$T$70, DW_AT_decl_column(0x02)
    2830                    
    2831                    $C$DW$T$71      .dwtag  DW_TAG_enumeration_type
    2832                            .dwattr $C$DW$T$71, DW_AT_byte_size(0x04)
    2833                    $C$DW$248       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_OK"), DW_AT_const_value(0x00)
    2834                            .dwattr $C$DW$248, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    2835                            .dwattr $C$DW$248, DW_AT_decl_line(0xa2)
    2836                            .dwattr $C$DW$248, DW_AT_decl_column(0x05)
    2837                    $C$DW$249       .dwtag  DW_TAG_enumerator, DW_AT_name("CORB_FAIL"), DW_AT_const_value(-1)
    2838                            .dwattr $C$DW$249, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    2839                            .dwattr $C$DW$249, DW_AT_decl_line(0xa3)
    2840                            .dwattr $C$DW$249, DW_AT_decl_column(0x05)
    2841                            .dwendtag $C$DW$T$71
    2842                    
    2843                            .dwattr $C$DW$T$71, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    2844                            .dwattr $C$DW$T$71, DW_AT_decl_line(0xa1)
    2845                            .dwattr $C$DW$T$71, DW_AT_decl_column(0x0e)
    2846                    $C$DW$T$72      .dwtag  DW_TAG_typedef, DW_AT_name("CORBResult")
    2847                            .dwattr $C$DW$T$72, DW_AT_type(*$C$DW$T$71)
    2848                            .dwattr $C$DW$T$72, DW_AT_language(DW_LANG_C)
    2849                            .dwattr $C$DW$T$72, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    2850                            .dwattr $C$DW$T$72, DW_AT_decl_line(0xa4)
    2851                            .dwattr $C$DW$T$72, DW_AT_decl_column(0x02)
    2852                    
    2853                    $C$DW$T$27      .dwtag  DW_TAG_structure_type
    2854                            .dwattr $C$DW$T$27, DW_AT_byte_size(0x24)
    2855                    $C$DW$250       .dwtag  DW_TAG_member
    2856                            .dwattr $C$DW$250, DW_AT_type(*$C$DW$T$19)
    2857                            .dwattr $C$DW$250, DW_AT_name("testPattern")
    2858                            .dwattr $C$DW$250, DW_AT_TI_symbol_name("testPattern")
    2859                            .dwattr $C$DW$250, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2860                            .dwattr $C$DW$250, DW_AT_accessibility(DW_ACCESS_public)
    2861                            .dwattr $C$DW$250, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\VLI
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   60

    2862                            .dwattr $C$DW$250, DW_AT_decl_line(0x24)
    2863                            .dwattr $C$DW$250, DW_AT_decl_column(0x0f)
    2864                    $C$DW$251       .dwtag  DW_TAG_member
    2865                            .dwattr $C$DW$251, DW_AT_type(*$C$DW$T$21)
    2866                            .dwattr $C$DW$251, DW_AT_name("staticInFeatures")
    2867                            .dwattr $C$DW$251, DW_AT_TI_symbol_name("staticInFeatures")
    2868                            .dwattr $C$DW$251, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2869                            .dwattr $C$DW$251, DW_AT_accessibility(DW_ACCESS_public)
    2870                            .dwattr $C$DW$251, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\VLI
    2871                            .dwattr $C$DW$251, DW_AT_decl_line(0x25)
    2872                            .dwattr $C$DW$251, DW_AT_decl_column(0x0f)
    2873                    $C$DW$252       .dwtag  DW_TAG_member
    2874                            .dwattr $C$DW$252, DW_AT_type(*$C$DW$T$22)
    2875                            .dwattr $C$DW$252, DW_AT_name("staticInFastResponse")
    2876                            .dwattr $C$DW$252, DW_AT_TI_symbol_name("staticInFastResponse")
    2877                            .dwattr $C$DW$252, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2878                            .dwattr $C$DW$252, DW_AT_accessibility(DW_ACCESS_public)
    2879                            .dwattr $C$DW$252, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\VLI
    2880                            .dwattr $C$DW$252, DW_AT_decl_line(0x26)
    2881                            .dwattr $C$DW$252, DW_AT_decl_column(0x0f)
    2882                    $C$DW$253       .dwtag  DW_TAG_member
    2883                            .dwattr $C$DW$253, DW_AT_type(*$C$DW$T$21)
    2884                            .dwattr $C$DW$253, DW_AT_name("staticOut")
    2885                            .dwattr $C$DW$253, DW_AT_TI_symbol_name("staticOut")
    2886                            .dwattr $C$DW$253, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    2887                            .dwattr $C$DW$253, DW_AT_accessibility(DW_ACCESS_public)
    2888                            .dwattr $C$DW$253, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\VLI
    2889                            .dwattr $C$DW$253, DW_AT_decl_line(0x27)
    2890                            .dwattr $C$DW$253, DW_AT_decl_column(0x0f)
    2891                    $C$DW$254       .dwtag  DW_TAG_member
    2892                            .dwattr $C$DW$254, DW_AT_type(*$C$DW$T$22)
    2893                            .dwattr $C$DW$254, DW_AT_name("staticOutFastResponse")
    2894                            .dwattr $C$DW$254, DW_AT_TI_symbol_name("staticOutFastResponse")
    2895                            .dwattr $C$DW$254, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    2896                            .dwattr $C$DW$254, DW_AT_accessibility(DW_ACCESS_public)
    2897                            .dwattr $C$DW$254, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\VLI
    2898                            .dwattr $C$DW$254, DW_AT_decl_line(0x28)
    2899                            .dwattr $C$DW$254, DW_AT_decl_column(0x0f)
    2900                    $C$DW$255       .dwtag  DW_TAG_member
    2901                            .dwattr $C$DW$255, DW_AT_type(*$C$DW$T$23)
    2902                            .dwattr $C$DW$255, DW_AT_name("out_n_features")
    2903                            .dwattr $C$DW$255, DW_AT_TI_symbol_name("out_n_features")
    2904                            .dwattr $C$DW$255, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    2905                            .dwattr $C$DW$255, DW_AT_accessibility(DW_ACCESS_public)
    2906                            .dwattr $C$DW$255, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\VLI
    2907                            .dwattr $C$DW$255, DW_AT_decl_line(0x29)
    2908                            .dwattr $C$DW$255, DW_AT_decl_column(0x0f)
    2909                    $C$DW$256       .dwtag  DW_TAG_member
    2910                            .dwattr $C$DW$256, DW_AT_type(*$C$DW$T$20)
    2911                            .dwattr $C$DW$256, DW_AT_name("imageWidth")
    2912                            .dwattr $C$DW$256, DW_AT_TI_symbol_name("imageWidth")
    2913                            .dwattr $C$DW$256, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    2914                            .dwattr $C$DW$256, DW_AT_accessibility(DW_ACCESS_public)
    2915                            .dwattr $C$DW$256, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\VLI
    2916                            .dwattr $C$DW$256, DW_AT_decl_line(0x2a)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   61

    2917                            .dwattr $C$DW$256, DW_AT_decl_column(0x0f)
    2918                    $C$DW$257       .dwtag  DW_TAG_member
    2919                            .dwattr $C$DW$257, DW_AT_type(*$C$DW$T$20)
    2920                            .dwattr $C$DW$257, DW_AT_name("imageHeight")
    2921                            .dwattr $C$DW$257, DW_AT_TI_symbol_name("imageHeight")
    2922                            .dwattr $C$DW$257, DW_AT_data_member_location[DW_OP_plus_uconst 0x1a]
    2923                            .dwattr $C$DW$257, DW_AT_accessibility(DW_ACCESS_public)
    2924                            .dwattr $C$DW$257, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\VLI
    2925                            .dwattr $C$DW$257, DW_AT_decl_line(0x2b)
    2926                            .dwattr $C$DW$257, DW_AT_decl_column(0x0f)
    2927                    $C$DW$258       .dwtag  DW_TAG_member
    2928                            .dwattr $C$DW$258, DW_AT_type(*$C$DW$T$24)
    2929                            .dwattr $C$DW$258, DW_AT_name("true_num_features")
    2930                            .dwattr $C$DW$258, DW_AT_TI_symbol_name("true_num_features")
    2931                            .dwattr $C$DW$258, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    2932                            .dwattr $C$DW$258, DW_AT_accessibility(DW_ACCESS_public)
    2933                            .dwattr $C$DW$258, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\VLI
    2934                            .dwattr $C$DW$258, DW_AT_decl_line(0x2c)
    2935                            .dwattr $C$DW$258, DW_AT_decl_column(0x0f)
    2936                    $C$DW$259       .dwtag  DW_TAG_member
    2937                            .dwattr $C$DW$259, DW_AT_type(*$C$DW$T$26)
    2938                            .dwattr $C$DW$259, DW_AT_name("desc")
    2939                            .dwattr $C$DW$259, DW_AT_TI_symbol_name("desc")
    2940                            .dwattr $C$DW$259, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    2941                            .dwattr $C$DW$259, DW_AT_accessibility(DW_ACCESS_public)
    2942                            .dwattr $C$DW$259, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\VLI
    2943                            .dwattr $C$DW$259, DW_AT_decl_line(0x2d)
    2944                            .dwattr $C$DW$259, DW_AT_decl_column(0x0f)
    2945                            .dwendtag $C$DW$T$27
    2946                    
    2947                            .dwattr $C$DW$T$27, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\VL
    2948                            .dwattr $C$DW$T$27, DW_AT_decl_line(0x23)
    2949                            .dwattr $C$DW$T$27, DW_AT_decl_column(0x10)
    2950                    $C$DW$T$76      .dwtag  DW_TAG_pointer_type
    2951                            .dwattr $C$DW$T$76, DW_AT_type(*$C$DW$T$27)
    2952                            .dwattr $C$DW$T$76, DW_AT_address_class(0x20)
    2953                    $C$DW$T$73      .dwtag  DW_TAG_typedef, DW_AT_name("aFast_nonmaxSuppression_testParams_t")
    2954                            .dwattr $C$DW$T$73, DW_AT_type(*$C$DW$T$27)
    2955                            .dwattr $C$DW$T$73, DW_AT_language(DW_LANG_C)
    2956                            .dwattr $C$DW$T$73, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\VL
    2957                            .dwattr $C$DW$T$73, DW_AT_decl_line(0x2e)
    2958                            .dwattr $C$DW$T$73, DW_AT_decl_column(0x03)
    2959                    $C$DW$T$74      .dwtag  DW_TAG_pointer_type
    2960                            .dwattr $C$DW$T$74, DW_AT_type(*$C$DW$T$73)
    2961                            .dwattr $C$DW$T$74, DW_AT_address_class(0x20)
    2962                    $C$DW$T$75      .dwtag  DW_TAG_pointer_type
    2963                            .dwattr $C$DW$T$75, DW_AT_type(*$C$DW$T$74)
    2964                            .dwattr $C$DW$T$75, DW_AT_address_class(0x20)
    2965                    
    2966                    $C$DW$T$29      .dwtag  DW_TAG_structure_type
    2967                            .dwattr $C$DW$T$29, DW_AT_byte_size(0x18)
    2968                    $C$DW$260       .dwtag  DW_TAG_member
    2969                            .dwattr $C$DW$260, DW_AT_type(*$C$DW$T$10)
    2970                            .dwattr $C$DW$260, DW_AT_name("fd")
    2971                            .dwattr $C$DW$260, DW_AT_TI_symbol_name("fd")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   62

    2972                            .dwattr $C$DW$260, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    2973                            .dwattr $C$DW$260, DW_AT_accessibility(DW_ACCESS_public)
    2974                            .dwattr $C$DW$260, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2975                            .dwattr $C$DW$260, DW_AT_decl_line(0x49)
    2976                            .dwattr $C$DW$260, DW_AT_decl_column(0x0b)
    2977                    $C$DW$261       .dwtag  DW_TAG_member
    2978                            .dwattr $C$DW$261, DW_AT_type(*$C$DW$T$28)
    2979                            .dwattr $C$DW$261, DW_AT_name("buf")
    2980                            .dwattr $C$DW$261, DW_AT_TI_symbol_name("buf")
    2981                            .dwattr $C$DW$261, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    2982                            .dwattr $C$DW$261, DW_AT_accessibility(DW_ACCESS_public)
    2983                            .dwattr $C$DW$261, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2984                            .dwattr $C$DW$261, DW_AT_decl_line(0x4a)
    2985                            .dwattr $C$DW$261, DW_AT_decl_column(0x16)
    2986                    $C$DW$262       .dwtag  DW_TAG_member
    2987                            .dwattr $C$DW$262, DW_AT_type(*$C$DW$T$28)
    2988                            .dwattr $C$DW$262, DW_AT_name("pos")
    2989                            .dwattr $C$DW$262, DW_AT_TI_symbol_name("pos")
    2990                            .dwattr $C$DW$262, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    2991                            .dwattr $C$DW$262, DW_AT_accessibility(DW_ACCESS_public)
    2992                            .dwattr $C$DW$262, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    2993                            .dwattr $C$DW$262, DW_AT_decl_line(0x4b)
    2994                            .dwattr $C$DW$262, DW_AT_decl_column(0x16)
    2995                    $C$DW$263       .dwtag  DW_TAG_member
    2996                            .dwattr $C$DW$263, DW_AT_type(*$C$DW$T$28)
    2997                            .dwattr $C$DW$263, DW_AT_name("bufend")
    2998                            .dwattr $C$DW$263, DW_AT_TI_symbol_name("bufend")
    2999                            .dwattr $C$DW$263, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3000                            .dwattr $C$DW$263, DW_AT_accessibility(DW_ACCESS_public)
    3001                            .dwattr $C$DW$263, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3002                            .dwattr $C$DW$263, DW_AT_decl_line(0x4c)
    3003                            .dwattr $C$DW$263, DW_AT_decl_column(0x16)
    3004                    $C$DW$264       .dwtag  DW_TAG_member
    3005                            .dwattr $C$DW$264, DW_AT_type(*$C$DW$T$28)
    3006                            .dwattr $C$DW$264, DW_AT_name("buff_stop")
    3007                            .dwattr $C$DW$264, DW_AT_TI_symbol_name("buff_stop")
    3008                            .dwattr $C$DW$264, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3009                            .dwattr $C$DW$264, DW_AT_accessibility(DW_ACCESS_public)
    3010                            .dwattr $C$DW$264, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3011                            .dwattr $C$DW$264, DW_AT_decl_line(0x4d)
    3012                            .dwattr $C$DW$264, DW_AT_decl_column(0x16)
    3013                    $C$DW$265       .dwtag  DW_TAG_member
    3014                            .dwattr $C$DW$265, DW_AT_type(*$C$DW$T$11)
    3015                            .dwattr $C$DW$265, DW_AT_name("flags")
    3016                            .dwattr $C$DW$265, DW_AT_TI_symbol_name("flags")
    3017                            .dwattr $C$DW$265, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3018                            .dwattr $C$DW$265, DW_AT_accessibility(DW_ACCESS_public)
    3019                            .dwattr $C$DW$265, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3020                            .dwattr $C$DW$265, DW_AT_decl_line(0x4e)
    3021                            .dwattr $C$DW$265, DW_AT_decl_column(0x16)
    3022                            .dwendtag $C$DW$T$29
    3023                    
    3024                            .dwattr $C$DW$T$29, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3025                            .dwattr $C$DW$T$29, DW_AT_decl_line(0x48)
    3026                            .dwattr $C$DW$T$29, DW_AT_decl_column(0x10)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   63

    3027                    $C$DW$T$78      .dwtag  DW_TAG_typedef, DW_AT_name("FILE")
    3028                            .dwattr $C$DW$T$78, DW_AT_type(*$C$DW$T$29)
    3029                            .dwattr $C$DW$T$78, DW_AT_language(DW_LANG_C)
    3030                            .dwattr $C$DW$T$78, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3031                            .dwattr $C$DW$T$78, DW_AT_decl_line(0x4f)
    3032                            .dwattr $C$DW$T$78, DW_AT_decl_column(0x03)
    3033                    
    3034                    $C$DW$T$30      .dwtag  DW_TAG_structure_type
    3035                            .dwattr $C$DW$T$30, DW_AT_byte_size(0x08)
    3036                    $C$DW$266       .dwtag  DW_TAG_member
    3037                            .dwattr $C$DW$266, DW_AT_type(*$C$DW$T$10)
    3038                            .dwattr $C$DW$266, DW_AT_name("quot")
    3039                            .dwattr $C$DW$266, DW_AT_TI_symbol_name("quot")
    3040                            .dwattr $C$DW$266, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3041                            .dwattr $C$DW$266, DW_AT_accessibility(DW_ACCESS_public)
    3042                            .dwattr $C$DW$266, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3043                            .dwattr $C$DW$266, DW_AT_decl_line(0x3e)
    3044                            .dwattr $C$DW$266, DW_AT_decl_column(0x16)
    3045                    $C$DW$267       .dwtag  DW_TAG_member
    3046                            .dwattr $C$DW$267, DW_AT_type(*$C$DW$T$10)
    3047                            .dwattr $C$DW$267, DW_AT_name("rem")
    3048                            .dwattr $C$DW$267, DW_AT_TI_symbol_name("rem")
    3049                            .dwattr $C$DW$267, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3050                            .dwattr $C$DW$267, DW_AT_accessibility(DW_ACCESS_public)
    3051                            .dwattr $C$DW$267, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3052                            .dwattr $C$DW$267, DW_AT_decl_line(0x3e)
    3053                            .dwattr $C$DW$267, DW_AT_decl_column(0x1c)
    3054                            .dwendtag $C$DW$T$30
    3055                    
    3056                            .dwattr $C$DW$T$30, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3057                            .dwattr $C$DW$T$30, DW_AT_decl_line(0x3e)
    3058                            .dwattr $C$DW$T$30, DW_AT_decl_column(0x10)
    3059                    $C$DW$T$79      .dwtag  DW_TAG_typedef, DW_AT_name("div_t")
    3060                            .dwattr $C$DW$T$79, DW_AT_type(*$C$DW$T$30)
    3061                            .dwattr $C$DW$T$79, DW_AT_language(DW_LANG_C)
    3062                            .dwattr $C$DW$T$79, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3063                            .dwattr $C$DW$T$79, DW_AT_decl_line(0x3e)
    3064                            .dwattr $C$DW$T$79, DW_AT_decl_column(0x23)
    3065                    
    3066                    $C$DW$T$31      .dwtag  DW_TAG_structure_type
    3067                            .dwattr $C$DW$T$31, DW_AT_byte_size(0x08)
    3068                    $C$DW$268       .dwtag  DW_TAG_member
    3069                            .dwattr $C$DW$268, DW_AT_type(*$C$DW$T$10)
    3070                            .dwattr $C$DW$268, DW_AT_name("quot")
    3071                            .dwattr $C$DW$268, DW_AT_TI_symbol_name("quot")
    3072                            .dwattr $C$DW$268, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3073                            .dwattr $C$DW$268, DW_AT_accessibility(DW_ACCESS_public)
    3074                            .dwattr $C$DW$268, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3075                            .dwattr $C$DW$268, DW_AT_decl_line(0x40)
    3076                            .dwattr $C$DW$268, DW_AT_decl_column(0x17)
    3077                    $C$DW$269       .dwtag  DW_TAG_member
    3078                            .dwattr $C$DW$269, DW_AT_type(*$C$DW$T$10)
    3079                            .dwattr $C$DW$269, DW_AT_name("rem")
    3080                            .dwattr $C$DW$269, DW_AT_TI_symbol_name("rem")
    3081                            .dwattr $C$DW$269, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   64

    3082                            .dwattr $C$DW$269, DW_AT_accessibility(DW_ACCESS_public)
    3083                            .dwattr $C$DW$269, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3084                            .dwattr $C$DW$269, DW_AT_decl_line(0x40)
    3085                            .dwattr $C$DW$269, DW_AT_decl_column(0x1d)
    3086                            .dwendtag $C$DW$T$31
    3087                    
    3088                            .dwattr $C$DW$T$31, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3089                            .dwattr $C$DW$T$31, DW_AT_decl_line(0x40)
    3090                            .dwattr $C$DW$T$31, DW_AT_decl_column(0x10)
    3091                    $C$DW$T$80      .dwtag  DW_TAG_typedef, DW_AT_name("ldiv_t")
    3092                            .dwattr $C$DW$T$80, DW_AT_type(*$C$DW$T$31)
    3093                            .dwattr $C$DW$T$80, DW_AT_language(DW_LANG_C)
    3094                            .dwattr $C$DW$T$80, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3095                            .dwattr $C$DW$T$80, DW_AT_decl_line(0x40)
    3096                            .dwattr $C$DW$T$80, DW_AT_decl_column(0x24)
    3097                    
    3098                    $C$DW$T$32      .dwtag  DW_TAG_structure_type
    3099                            .dwattr $C$DW$T$32, DW_AT_byte_size(0x10)
    3100                    $C$DW$270       .dwtag  DW_TAG_member
    3101                            .dwattr $C$DW$270, DW_AT_type(*$C$DW$T$14)
    3102                            .dwattr $C$DW$270, DW_AT_name("quot")
    3103                            .dwattr $C$DW$270, DW_AT_TI_symbol_name("quot")
    3104                            .dwattr $C$DW$270, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3105                            .dwattr $C$DW$270, DW_AT_accessibility(DW_ACCESS_public)
    3106                            .dwattr $C$DW$270, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3107                            .dwattr $C$DW$270, DW_AT_decl_line(0x43)
    3108                            .dwattr $C$DW$270, DW_AT_decl_column(0x1c)
    3109                    $C$DW$271       .dwtag  DW_TAG_member
    3110                            .dwattr $C$DW$271, DW_AT_type(*$C$DW$T$14)
    3111                            .dwattr $C$DW$271, DW_AT_name("rem")
    3112                            .dwattr $C$DW$271, DW_AT_TI_symbol_name("rem")
    3113                            .dwattr $C$DW$271, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3114                            .dwattr $C$DW$271, DW_AT_accessibility(DW_ACCESS_public)
    3115                            .dwattr $C$DW$271, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3116                            .dwattr $C$DW$271, DW_AT_decl_line(0x43)
    3117                            .dwattr $C$DW$271, DW_AT_decl_column(0x22)
    3118                            .dwendtag $C$DW$T$32
    3119                    
    3120                            .dwattr $C$DW$T$32, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3121                            .dwattr $C$DW$T$32, DW_AT_decl_line(0x43)
    3122                            .dwattr $C$DW$T$32, DW_AT_decl_column(0x10)
    3123                    $C$DW$T$81      .dwtag  DW_TAG_typedef, DW_AT_name("lldiv_t")
    3124                            .dwattr $C$DW$T$81, DW_AT_type(*$C$DW$T$32)
    3125                            .dwattr $C$DW$T$81, DW_AT_language(DW_LANG_C)
    3126                            .dwattr $C$DW$T$81, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3127                            .dwattr $C$DW$T$81, DW_AT_decl_line(0x43)
    3128                            .dwattr $C$DW$T$81, DW_AT_decl_column(0x29)
    3129                    
    3130                    $C$DW$T$33      .dwtag  DW_TAG_structure_type
    3131                            .dwattr $C$DW$T$33, DW_AT_byte_size(0x24)
    3132                    $C$DW$272       .dwtag  DW_TAG_member
    3133                            .dwattr $C$DW$272, DW_AT_type(*$C$DW$T$23)
    3134                            .dwattr $C$DW$272, DW_AT_name("area")
    3135                            .dwattr $C$DW$272, DW_AT_TI_symbol_name("area")
    3136                            .dwattr $C$DW$272, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   65

    3137                            .dwattr $C$DW$272, DW_AT_accessibility(DW_ACCESS_public)
    3138                            .dwattr $C$DW$272, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3139                            .dwattr $C$DW$272, DW_AT_decl_line(0x69)
    3140                            .dwattr $C$DW$272, DW_AT_decl_column(0x0d)
    3141                    $C$DW$273       .dwtag  DW_TAG_member
    3142                            .dwattr $C$DW$273, DW_AT_type(*$C$DW$T$23)
    3143                            .dwattr $C$DW$273, DW_AT_name("xsum")
    3144                            .dwattr $C$DW$273, DW_AT_TI_symbol_name("xsum")
    3145                            .dwattr $C$DW$273, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3146                            .dwattr $C$DW$273, DW_AT_accessibility(DW_ACCESS_public)
    3147                            .dwattr $C$DW$273, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3148                            .dwattr $C$DW$273, DW_AT_decl_line(0x6a)
    3149                            .dwattr $C$DW$273, DW_AT_decl_column(0x0d)
    3150                    $C$DW$274       .dwtag  DW_TAG_member
    3151                            .dwattr $C$DW$274, DW_AT_type(*$C$DW$T$23)
    3152                            .dwattr $C$DW$274, DW_AT_name("ysum")
    3153                            .dwattr $C$DW$274, DW_AT_TI_symbol_name("ysum")
    3154                            .dwattr $C$DW$274, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3155                            .dwattr $C$DW$274, DW_AT_accessibility(DW_ACCESS_public)
    3156                            .dwattr $C$DW$274, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3157                            .dwattr $C$DW$274, DW_AT_decl_line(0x6b)
    3158                            .dwattr $C$DW$274, DW_AT_decl_column(0x0d)
    3159                    $C$DW$275       .dwtag  DW_TAG_member
    3160                            .dwattr $C$DW$275, DW_AT_type(*$C$DW$T$23)
    3161                            .dwattr $C$DW$275, DW_AT_name("xmin")
    3162                            .dwattr $C$DW$275, DW_AT_TI_symbol_name("xmin")
    3163                            .dwattr $C$DW$275, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3164                            .dwattr $C$DW$275, DW_AT_accessibility(DW_ACCESS_public)
    3165                            .dwattr $C$DW$275, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3166                            .dwattr $C$DW$275, DW_AT_decl_line(0x6d)
    3167                            .dwattr $C$DW$275, DW_AT_decl_column(0x0d)
    3168                    $C$DW$276       .dwtag  DW_TAG_member
    3169                            .dwattr $C$DW$276, DW_AT_type(*$C$DW$T$23)
    3170                            .dwattr $C$DW$276, DW_AT_name("ymin")
    3171                            .dwattr $C$DW$276, DW_AT_TI_symbol_name("ymin")
    3172                            .dwattr $C$DW$276, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3173                            .dwattr $C$DW$276, DW_AT_accessibility(DW_ACCESS_public)
    3174                            .dwattr $C$DW$276, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3175                            .dwattr $C$DW$276, DW_AT_decl_line(0x6e)
    3176                            .dwattr $C$DW$276, DW_AT_decl_column(0x0d)
    3177                    $C$DW$277       .dwtag  DW_TAG_member
    3178                            .dwattr $C$DW$277, DW_AT_type(*$C$DW$T$23)
    3179                            .dwattr $C$DW$277, DW_AT_name("xmax")
    3180                            .dwattr $C$DW$277, DW_AT_TI_symbol_name("xmax")
    3181                            .dwattr $C$DW$277, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3182                            .dwattr $C$DW$277, DW_AT_accessibility(DW_ACCESS_public)
    3183                            .dwattr $C$DW$277, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3184                            .dwattr $C$DW$277, DW_AT_decl_line(0x6f)
    3185                            .dwattr $C$DW$277, DW_AT_decl_column(0x0d)
    3186                    $C$DW$278       .dwtag  DW_TAG_member
    3187                            .dwattr $C$DW$278, DW_AT_type(*$C$DW$T$23)
    3188                            .dwattr $C$DW$278, DW_AT_name("ymax")
    3189                            .dwattr $C$DW$278, DW_AT_TI_symbol_name("ymax")
    3190                            .dwattr $C$DW$278, DW_AT_data_member_location[DW_OP_plus_uconst 0x18]
    3191                            .dwattr $C$DW$278, DW_AT_accessibility(DW_ACCESS_public)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   66

    3192                            .dwattr $C$DW$278, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3193                            .dwattr $C$DW$278, DW_AT_decl_line(0x70)
    3194                            .dwattr $C$DW$278, DW_AT_decl_column(0x0d)
    3195                    $C$DW$279       .dwtag  DW_TAG_member
    3196                            .dwattr $C$DW$279, DW_AT_type(*$C$DW$T$23)
    3197                            .dwattr $C$DW$279, DW_AT_name("seedx")
    3198                            .dwattr $C$DW$279, DW_AT_TI_symbol_name("seedx")
    3199                            .dwattr $C$DW$279, DW_AT_data_member_location[DW_OP_plus_uconst 0x1c]
    3200                            .dwattr $C$DW$279, DW_AT_accessibility(DW_ACCESS_public)
    3201                            .dwattr $C$DW$279, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3202                            .dwattr $C$DW$279, DW_AT_decl_line(0x72)
    3203                            .dwattr $C$DW$279, DW_AT_decl_column(0x0d)
    3204                    $C$DW$280       .dwtag  DW_TAG_member
    3205                            .dwattr $C$DW$280, DW_AT_type(*$C$DW$T$23)
    3206                            .dwattr $C$DW$280, DW_AT_name("seedy")
    3207                            .dwattr $C$DW$280, DW_AT_TI_symbol_name("seedy")
    3208                            .dwattr $C$DW$280, DW_AT_data_member_location[DW_OP_plus_uconst 0x20]
    3209                            .dwattr $C$DW$280, DW_AT_accessibility(DW_ACCESS_public)
    3210                            .dwattr $C$DW$280, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3211                            .dwattr $C$DW$280, DW_AT_decl_line(0x73)
    3212                            .dwattr $C$DW$280, DW_AT_decl_column(0x0d)
    3213                            .dwendtag $C$DW$T$33
    3214                    
    3215                            .dwattr $C$DW$T$33, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3216                            .dwattr $C$DW$T$33, DW_AT_decl_line(0x68)
    3217                            .dwattr $C$DW$T$33, DW_AT_decl_column(0x10)
    3218                    $C$DW$T$82      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CC")
    3219                            .dwattr $C$DW$T$82, DW_AT_type(*$C$DW$T$33)
    3220                            .dwattr $C$DW$T$82, DW_AT_language(DW_LANG_C)
    3221                            .dwattr $C$DW$T$82, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3222                            .dwattr $C$DW$T$82, DW_AT_decl_line(0x75)
    3223                            .dwattr $C$DW$T$82, DW_AT_decl_column(0x03)
    3224                    
    3225                    $C$DW$T$35      .dwtag  DW_TAG_structure_type
    3226                            .dwattr $C$DW$T$35, DW_AT_byte_size(0x10)
    3227                    $C$DW$281       .dwtag  DW_TAG_member
    3228                            .dwattr $C$DW$281, DW_AT_type(*$C$DW$T$8)
    3229                            .dwattr $C$DW$281, DW_AT_name("daylight")
    3230                            .dwattr $C$DW$281, DW_AT_TI_symbol_name("daylight")
    3231                            .dwattr $C$DW$281, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3232                            .dwattr $C$DW$281, DW_AT_accessibility(DW_ACCESS_public)
    3233                            .dwattr $C$DW$281, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3234                            .dwattr $C$DW$281, DW_AT_decl_line(0x52)
    3235                            .dwattr $C$DW$281, DW_AT_decl_column(0x0b)
    3236                    $C$DW$282       .dwtag  DW_TAG_member
    3237                            .dwattr $C$DW$282, DW_AT_type(*$C$DW$T$10)
    3238                            .dwattr $C$DW$282, DW_AT_name("timezone")
    3239                            .dwattr $C$DW$282, DW_AT_TI_symbol_name("timezone")
    3240                            .dwattr $C$DW$282, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3241                            .dwattr $C$DW$282, DW_AT_accessibility(DW_ACCESS_public)
    3242                            .dwattr $C$DW$282, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3243                            .dwattr $C$DW$282, DW_AT_decl_line(0x53)
    3244                            .dwattr $C$DW$282, DW_AT_decl_column(0x0b)
    3245                    $C$DW$283       .dwtag  DW_TAG_member
    3246                            .dwattr $C$DW$283, DW_AT_type(*$C$DW$T$34)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   67

    3247                            .dwattr $C$DW$283, DW_AT_name("tzname")
    3248                            .dwattr $C$DW$283, DW_AT_TI_symbol_name("tzname")
    3249                            .dwattr $C$DW$283, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3250                            .dwattr $C$DW$283, DW_AT_accessibility(DW_ACCESS_public)
    3251                            .dwattr $C$DW$283, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3252                            .dwattr $C$DW$283, DW_AT_decl_line(0x54)
    3253                            .dwattr $C$DW$283, DW_AT_decl_column(0x0b)
    3254                    $C$DW$284       .dwtag  DW_TAG_member
    3255                            .dwattr $C$DW$284, DW_AT_type(*$C$DW$T$34)
    3256                            .dwattr $C$DW$284, DW_AT_name("dstname")
    3257                            .dwattr $C$DW$284, DW_AT_TI_symbol_name("dstname")
    3258                            .dwattr $C$DW$284, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3259                            .dwattr $C$DW$284, DW_AT_accessibility(DW_ACCESS_public)
    3260                            .dwattr $C$DW$284, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/include
    3261                            .dwattr $C$DW$284, DW_AT_decl_line(0x55)
    3262                            .dwattr $C$DW$284, DW_AT_decl_column(0x0b)
    3263                            .dwendtag $C$DW$T$35
    3264                    
    3265                            .dwattr $C$DW$T$35, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3266                            .dwattr $C$DW$T$35, DW_AT_decl_line(0x51)
    3267                            .dwattr $C$DW$T$35, DW_AT_decl_column(0x01)
    3268                    $C$DW$T$83      .dwtag  DW_TAG_typedef, DW_AT_name("TZ")
    3269                            .dwattr $C$DW$T$83, DW_AT_type(*$C$DW$T$35)
    3270                            .dwattr $C$DW$T$83, DW_AT_language(DW_LANG_C)
    3271                            .dwattr $C$DW$T$83, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3272                            .dwattr $C$DW$T$83, DW_AT_decl_line(0x56)
    3273                            .dwattr $C$DW$T$83, DW_AT_decl_column(0x03)
    3274                    
    3275                    $C$DW$T$36      .dwtag  DW_TAG_structure_type
    3276                            .dwattr $C$DW$T$36, DW_AT_byte_size(0x14)
    3277                    $C$DW$285       .dwtag  DW_TAG_member
    3278                            .dwattr $C$DW$285, DW_AT_type(*$C$DW$T$23)
    3279                            .dwattr $C$DW$285, DW_AT_name("width")
    3280                            .dwattr $C$DW$285, DW_AT_TI_symbol_name("width")
    3281                            .dwattr $C$DW$285, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3282                            .dwattr $C$DW$285, DW_AT_accessibility(DW_ACCESS_public)
    3283                            .dwattr $C$DW$285, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3284                            .dwattr $C$DW$285, DW_AT_decl_line(0xaa)
    3285                            .dwattr $C$DW$285, DW_AT_decl_column(0x0d)
    3286                    $C$DW$286       .dwtag  DW_TAG_member
    3287                            .dwattr $C$DW$286, DW_AT_type(*$C$DW$T$23)
    3288                            .dwattr $C$DW$286, DW_AT_name("height")
    3289                            .dwattr $C$DW$286, DW_AT_TI_symbol_name("height")
    3290                            .dwattr $C$DW$286, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3291                            .dwattr $C$DW$286, DW_AT_accessibility(DW_ACCESS_public)
    3292                            .dwattr $C$DW$286, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3293                            .dwattr $C$DW$286, DW_AT_decl_line(0xab)
    3294                            .dwattr $C$DW$286, DW_AT_decl_column(0x0d)
    3295                    $C$DW$287       .dwtag  DW_TAG_member
    3296                            .dwattr $C$DW$287, DW_AT_type(*$C$DW$T$23)
    3297                            .dwattr $C$DW$287, DW_AT_name("marginPixels")
    3298                            .dwattr $C$DW$287, DW_AT_TI_symbol_name("marginPixels")
    3299                            .dwattr $C$DW$287, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3300                            .dwattr $C$DW$287, DW_AT_accessibility(DW_ACCESS_public)
    3301                            .dwattr $C$DW$287, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   68

    3302                            .dwattr $C$DW$287, DW_AT_decl_line(0xac)
    3303                            .dwattr $C$DW$287, DW_AT_decl_column(0x0d)
    3304                    $C$DW$288       .dwtag  DW_TAG_member
    3305                            .dwattr $C$DW$288, DW_AT_type(*$C$DW$T$19)
    3306                            .dwattr $C$DW$288, DW_AT_name("fastDifferenceThreshold")
    3307                            .dwattr $C$DW$288, DW_AT_TI_symbol_name("fastDifferenceThreshold")
    3308                            .dwattr $C$DW$288, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3309                            .dwattr $C$DW$288, DW_AT_accessibility(DW_ACCESS_public)
    3310                            .dwattr $C$DW$288, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3311                            .dwattr $C$DW$288, DW_AT_decl_line(0xae)
    3312                            .dwattr $C$DW$288, DW_AT_decl_column(0x0d)
    3313                    $C$DW$289       .dwtag  DW_TAG_member
    3314                            .dwattr $C$DW$289, DW_AT_type(*$C$DW$T$23)
    3315                            .dwattr $C$DW$289, DW_AT_name("n_features_desired")
    3316                            .dwattr $C$DW$289, DW_AT_TI_symbol_name("n_features_desired")
    3317                            .dwattr $C$DW$289, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3318                            .dwattr $C$DW$289, DW_AT_accessibility(DW_ACCESS_public)
    3319                            .dwattr $C$DW$289, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3320                            .dwattr $C$DW$289, DW_AT_decl_line(0xb2)
    3321                            .dwattr $C$DW$289, DW_AT_decl_column(0x0d)
    3322                            .dwendtag $C$DW$T$36
    3323                    
    3324                            .dwattr $C$DW$T$36, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3325                            .dwattr $C$DW$T$36, DW_AT_decl_line(0xa9)
    3326                            .dwattr $C$DW$T$36, DW_AT_decl_column(0x10)
    3327                    $C$DW$T$84      .dwtag  DW_TAG_typedef, DW_AT_name("CORBParameters")
    3328                            .dwattr $C$DW$T$84, DW_AT_type(*$C$DW$T$36)
    3329                            .dwattr $C$DW$T$84, DW_AT_language(DW_LANG_C)
    3330                            .dwattr $C$DW$T$84, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3331                            .dwattr $C$DW$T$84, DW_AT_decl_line(0xb3)
    3332                            .dwattr $C$DW$T$84, DW_AT_decl_column(0x02)
    3333                    
    3334                    $C$DW$T$41      .dwtag  DW_TAG_structure_type
    3335                            .dwattr $C$DW$T$41, DW_AT_byte_size(0x5a008)
    3336                    $C$DW$290       .dwtag  DW_TAG_member
    3337                            .dwattr $C$DW$290, DW_AT_type(*$C$DW$T$23)
    3338                            .dwattr $C$DW$290, DW_AT_name("octave")
    3339                            .dwattr $C$DW$290, DW_AT_TI_symbol_name("octave")
    3340                            .dwattr $C$DW$290, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3341                            .dwattr $C$DW$290, DW_AT_accessibility(DW_ACCESS_public)
    3342                            .dwattr $C$DW$290, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3343                            .dwattr $C$DW$290, DW_AT_decl_line(0xb9)
    3344                            .dwattr $C$DW$290, DW_AT_decl_column(0x0d)
    3345                    $C$DW$291       .dwtag  DW_TAG_member
    3346                            .dwattr $C$DW$291, DW_AT_type(*$C$DW$T$38)
    3347                            .dwattr $C$DW$291, DW_AT_name("relative_patterns")
    3348                            .dwattr $C$DW$291, DW_AT_TI_symbol_name("relative_patterns")
    3349                            .dwattr $C$DW$291, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3350                            .dwattr $C$DW$291, DW_AT_accessibility(DW_ACCESS_public)
    3351                            .dwattr $C$DW$291, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3352                            .dwattr $C$DW$291, DW_AT_decl_line(0xbb)
    3353                            .dwattr $C$DW$291, DW_AT_decl_column(0x0d)
    3354                    $C$DW$292       .dwtag  DW_TAG_member
    3355                            .dwattr $C$DW$292, DW_AT_type(*$C$DW$T$40)
    3356                            .dwattr $C$DW$292, DW_AT_name("rotated_patterns")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   69

    3357                            .dwattr $C$DW$292, DW_AT_TI_symbol_name("rotated_patterns")
    3358                            .dwattr $C$DW$292, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c004]
    3359                            .dwattr $C$DW$292, DW_AT_accessibility(DW_ACCESS_public)
    3360                            .dwattr $C$DW$292, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3361                            .dwattr $C$DW$292, DW_AT_decl_line(0xbc)
    3362                            .dwattr $C$DW$292, DW_AT_decl_column(0x0d)
    3363                    $C$DW$293       .dwtag  DW_TAG_member
    3364                            .dwattr $C$DW$293, DW_AT_type(*$C$DW$T$23)
    3365                            .dwattr $C$DW$293, DW_AT_name("integralImageWidth")
    3366                            .dwattr $C$DW$293, DW_AT_TI_symbol_name("integralImageWidth")
    3367                            .dwattr $C$DW$293, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a004]
    3368                            .dwattr $C$DW$293, DW_AT_accessibility(DW_ACCESS_public)
    3369                            .dwattr $C$DW$293, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3370                            .dwattr $C$DW$293, DW_AT_decl_line(0xbd)
    3371                            .dwattr $C$DW$293, DW_AT_decl_column(0x0d)
    3372                            .dwendtag $C$DW$T$41
    3373                    
    3374                            .dwattr $C$DW$T$41, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3375                            .dwattr $C$DW$T$41, DW_AT_decl_line(0xb8)
    3376                            .dwattr $C$DW$T$41, DW_AT_decl_column(0x10)
    3377                    $C$DW$T$45      .dwtag  DW_TAG_typedef, DW_AT_name("CORBPatterns")
    3378                            .dwattr $C$DW$T$45, DW_AT_type(*$C$DW$T$41)
    3379                            .dwattr $C$DW$T$45, DW_AT_language(DW_LANG_C)
    3380                            .dwattr $C$DW$T$45, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3381                            .dwattr $C$DW$T$45, DW_AT_decl_line(0xbe)
    3382                            .dwattr $C$DW$T$45, DW_AT_decl_column(0x02)
    3383                    
    3384                    $C$DW$T$44      .dwtag  DW_TAG_structure_type
    3385                            .dwattr $C$DW$T$44, DW_AT_byte_size(0x400)
    3386                    $C$DW$294       .dwtag  DW_TAG_member
    3387                            .dwattr $C$DW$294, DW_AT_type(*$C$DW$T$42)
    3388                            .dwattr $C$DW$294, DW_AT_name("orientation_horizontal_offsets")
    3389                            .dwattr $C$DW$294, DW_AT_TI_symbol_name("orientation_horizontal_offsets")
    3390                            .dwattr $C$DW$294, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3391                            .dwattr $C$DW$294, DW_AT_accessibility(DW_ACCESS_public)
    3392                            .dwattr $C$DW$294, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3393                            .dwattr $C$DW$294, DW_AT_decl_line(0xc4)
    3394                            .dwattr $C$DW$294, DW_AT_decl_column(0x0d)
    3395                    $C$DW$295       .dwtag  DW_TAG_member
    3396                            .dwattr $C$DW$295, DW_AT_type(*$C$DW$T$42)
    3397                            .dwattr $C$DW$295, DW_AT_name("orientation_vertical_offsets")
    3398                            .dwattr $C$DW$295, DW_AT_TI_symbol_name("orientation_vertical_offsets")
    3399                            .dwattr $C$DW$295, DW_AT_data_member_location[DW_OP_plus_uconst 0x1e0]
    3400                            .dwattr $C$DW$295, DW_AT_accessibility(DW_ACCESS_public)
    3401                            .dwattr $C$DW$295, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3402                            .dwattr $C$DW$295, DW_AT_decl_line(0xc5)
    3403                            .dwattr $C$DW$295, DW_AT_decl_column(0x0d)
    3404                    $C$DW$296       .dwtag  DW_TAG_member
    3405                            .dwattr $C$DW$296, DW_AT_type(*$C$DW$T$43)
    3406                            .dwattr $C$DW$296, DW_AT_name("u_max")
    3407                            .dwattr $C$DW$296, DW_AT_TI_symbol_name("u_max")
    3408                            .dwattr $C$DW$296, DW_AT_data_member_location[DW_OP_plus_uconst 0x3c0]
    3409                            .dwattr $C$DW$296, DW_AT_accessibility(DW_ACCESS_public)
    3410                            .dwattr $C$DW$296, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3411                            .dwattr $C$DW$296, DW_AT_decl_line(0xc6)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   70

    3412                            .dwattr $C$DW$296, DW_AT_decl_column(0x0d)
    3413                            .dwendtag $C$DW$T$44
    3414                    
    3415                            .dwattr $C$DW$T$44, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3416                            .dwattr $C$DW$T$44, DW_AT_decl_line(0xc3)
    3417                            .dwattr $C$DW$T$44, DW_AT_decl_column(0x10)
    3418                    $C$DW$T$46      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOrientationOffsets")
    3419                            .dwattr $C$DW$T$46, DW_AT_type(*$C$DW$T$44)
    3420                            .dwattr $C$DW$T$46, DW_AT_language(DW_LANG_C)
    3421                            .dwattr $C$DW$T$46, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3422                            .dwattr $C$DW$T$46, DW_AT_decl_line(0xc7)
    3423                            .dwattr $C$DW$T$46, DW_AT_decl_column(0x02)
    3424                    
    3425                    $C$DW$T$52      .dwtag  DW_TAG_structure_type
    3426                            .dwattr $C$DW$T$52, DW_AT_byte_size(0x5a420)
    3427                    $C$DW$297       .dwtag  DW_TAG_member
    3428                            .dwattr $C$DW$297, DW_AT_type(*$C$DW$T$45)
    3429                            .dwattr $C$DW$297, DW_AT_name("patterns")
    3430                            .dwattr $C$DW$297, DW_AT_TI_symbol_name("patterns")
    3431                            .dwattr $C$DW$297, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3432                            .dwattr $C$DW$297, DW_AT_accessibility(DW_ACCESS_public)
    3433                            .dwattr $C$DW$297, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3434                            .dwattr $C$DW$297, DW_AT_decl_line(0xcd)
    3435                            .dwattr $C$DW$297, DW_AT_decl_column(0x1c)
    3436                    $C$DW$298       .dwtag  DW_TAG_member
    3437                            .dwattr $C$DW$298, DW_AT_type(*$C$DW$T$46)
    3438                            .dwattr $C$DW$298, DW_AT_name("offsets")
    3439                            .dwattr $C$DW$298, DW_AT_TI_symbol_name("offsets")
    3440                            .dwattr $C$DW$298, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a008]
    3441                            .dwattr $C$DW$298, DW_AT_accessibility(DW_ACCESS_public)
    3442                            .dwattr $C$DW$298, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3443                            .dwattr $C$DW$298, DW_AT_decl_line(0xce)
    3444                            .dwattr $C$DW$298, DW_AT_decl_column(0x1c)
    3445                    $C$DW$299       .dwtag  DW_TAG_member
    3446                            .dwattr $C$DW$299, DW_AT_type(*$C$DW$T$22)
    3447                            .dwattr $C$DW$299, DW_AT_name("image")
    3448                            .dwattr $C$DW$299, DW_AT_TI_symbol_name("image")
    3449                            .dwattr $C$DW$299, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a408]
    3450                            .dwattr $C$DW$299, DW_AT_accessibility(DW_ACCESS_public)
    3451                            .dwattr $C$DW$299, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3452                            .dwattr $C$DW$299, DW_AT_decl_line(0xcf)
    3453                            .dwattr $C$DW$299, DW_AT_decl_column(0x1c)
    3454                    $C$DW$300       .dwtag  DW_TAG_member
    3455                            .dwattr $C$DW$300, DW_AT_type(*$C$DW$T$22)
    3456                            .dwattr $C$DW$300, DW_AT_name("prefimage")
    3457                            .dwattr $C$DW$300, DW_AT_TI_symbol_name("prefimage")
    3458                            .dwattr $C$DW$300, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a40c]
    3459                            .dwattr $C$DW$300, DW_AT_accessibility(DW_ACCESS_public)
    3460                            .dwattr $C$DW$300, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3461                            .dwattr $C$DW$300, DW_AT_decl_line(0xd0)
    3462                            .dwattr $C$DW$300, DW_AT_decl_column(0x1c)
    3463                    $C$DW$301       .dwtag  DW_TAG_member
    3464                            .dwattr $C$DW$301, DW_AT_type(*$C$DW$T$48)
    3465                            .dwattr $C$DW$301, DW_AT_name("harrisImage")
    3466                            .dwattr $C$DW$301, DW_AT_TI_symbol_name("harrisImage")
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   71

    3467                            .dwattr $C$DW$301, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a410]
    3468                            .dwattr $C$DW$301, DW_AT_accessibility(DW_ACCESS_public)
    3469                            .dwattr $C$DW$301, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3470                            .dwattr $C$DW$301, DW_AT_decl_line(0xd1)
    3471                            .dwattr $C$DW$301, DW_AT_decl_column(0x1c)
    3472                    $C$DW$302       .dwtag  DW_TAG_member
    3473                            .dwattr $C$DW$302, DW_AT_type(*$C$DW$T$49)
    3474                            .dwattr $C$DW$302, DW_AT_name("integralImage")
    3475                            .dwattr $C$DW$302, DW_AT_TI_symbol_name("integralImage")
    3476                            .dwattr $C$DW$302, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a414]
    3477                            .dwattr $C$DW$302, DW_AT_accessibility(DW_ACCESS_public)
    3478                            .dwattr $C$DW$302, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3479                            .dwattr $C$DW$302, DW_AT_decl_line(0xd2)
    3480                            .dwattr $C$DW$302, DW_AT_decl_column(0x1c)
    3481                    $C$DW$303       .dwtag  DW_TAG_member
    3482                            .dwattr $C$DW$303, DW_AT_type(*$C$DW$T$26)
    3483                            .dwattr $C$DW$303, DW_AT_name("scratchBuffer")
    3484                            .dwattr $C$DW$303, DW_AT_TI_symbol_name("scratchBuffer")
    3485                            .dwattr $C$DW$303, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a418]
    3486                            .dwattr $C$DW$303, DW_AT_accessibility(DW_ACCESS_public)
    3487                            .dwattr $C$DW$303, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3488                            .dwattr $C$DW$303, DW_AT_decl_line(0xd3)
    3489                            .dwattr $C$DW$303, DW_AT_decl_column(0x1c)
    3490                    $C$DW$304       .dwtag  DW_TAG_member
    3491                            .dwattr $C$DW$304, DW_AT_type(*$C$DW$T$51)
    3492                            .dwattr $C$DW$304, DW_AT_name("orbPattern31")
    3493                            .dwattr $C$DW$304, DW_AT_TI_symbol_name("orbPattern31")
    3494                            .dwattr $C$DW$304, DW_AT_data_member_location[DW_OP_plus_uconst 0x5a41c]
    3495                            .dwattr $C$DW$304, DW_AT_accessibility(DW_ACCESS_public)
    3496                            .dwattr $C$DW$304, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3497                            .dwattr $C$DW$304, DW_AT_decl_line(0xd4)
    3498                            .dwattr $C$DW$304, DW_AT_decl_column(0x1c)
    3499                            .dwendtag $C$DW$T$52
    3500                    
    3501                            .dwattr $C$DW$T$52, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3502                            .dwattr $C$DW$T$52, DW_AT_decl_line(0xcc)
    3503                            .dwattr $C$DW$T$52, DW_AT_decl_column(0x10)
    3504                    $C$DW$T$85      .dwtag  DW_TAG_typedef, DW_AT_name("CORBInput")
    3505                            .dwattr $C$DW$T$85, DW_AT_type(*$C$DW$T$52)
    3506                            .dwattr $C$DW$T$85, DW_AT_language(DW_LANG_C)
    3507                            .dwattr $C$DW$T$85, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3508                            .dwattr $C$DW$T$85, DW_AT_decl_line(0xd5)
    3509                            .dwattr $C$DW$T$85, DW_AT_decl_column(0x02)
    3510                    
    3511                    $C$DW$T$55      .dwtag  DW_TAG_structure_type
    3512                            .dwattr $C$DW$T$55, DW_AT_byte_size(0x38)
    3513                    $C$DW$305       .dwtag  DW_TAG_member
    3514                            .dwattr $C$DW$305, DW_AT_type(*$C$DW$T$23)
    3515                            .dwattr $C$DW$305, DW_AT_name("x")
    3516                            .dwattr $C$DW$305, DW_AT_TI_symbol_name("x")
    3517                            .dwattr $C$DW$305, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3518                            .dwattr $C$DW$305, DW_AT_accessibility(DW_ACCESS_public)
    3519                            .dwattr $C$DW$305, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3520                            .dwattr $C$DW$305, DW_AT_decl_line(0xdc)
    3521                            .dwattr $C$DW$305, DW_AT_decl_column(0x0d)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   72

    3522                    $C$DW$306       .dwtag  DW_TAG_member
    3523                            .dwattr $C$DW$306, DW_AT_type(*$C$DW$T$23)
    3524                            .dwattr $C$DW$306, DW_AT_name("y")
    3525                            .dwattr $C$DW$306, DW_AT_TI_symbol_name("y")
    3526                            .dwattr $C$DW$306, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3527                            .dwattr $C$DW$306, DW_AT_accessibility(DW_ACCESS_public)
    3528                            .dwattr $C$DW$306, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3529                            .dwattr $C$DW$306, DW_AT_decl_line(0xde)
    3530                            .dwattr $C$DW$306, DW_AT_decl_column(0x0d)
    3531                    $C$DW$307       .dwtag  DW_TAG_member
    3532                            .dwattr $C$DW$307, DW_AT_type(*$C$DW$T$23)
    3533                            .dwattr $C$DW$307, DW_AT_name("octave")
    3534                            .dwattr $C$DW$307, DW_AT_TI_symbol_name("octave")
    3535                            .dwattr $C$DW$307, DW_AT_data_member_location[DW_OP_plus_uconst 0x8]
    3536                            .dwattr $C$DW$307, DW_AT_accessibility(DW_ACCESS_public)
    3537                            .dwattr $C$DW$307, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3538                            .dwattr $C$DW$307, DW_AT_decl_line(0xe0)
    3539                            .dwattr $C$DW$307, DW_AT_decl_column(0x0d)
    3540                    $C$DW$308       .dwtag  DW_TAG_member
    3541                            .dwattr $C$DW$308, DW_AT_type(*$C$DW$T$53)
    3542                            .dwattr $C$DW$308, DW_AT_name("angle")
    3543                            .dwattr $C$DW$308, DW_AT_TI_symbol_name("angle")
    3544                            .dwattr $C$DW$308, DW_AT_data_member_location[DW_OP_plus_uconst 0xc]
    3545                            .dwattr $C$DW$308, DW_AT_accessibility(DW_ACCESS_public)
    3546                            .dwattr $C$DW$308, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3547                            .dwattr $C$DW$308, DW_AT_decl_line(0xe3)
    3548                            .dwattr $C$DW$308, DW_AT_decl_column(0x0e)
    3549                    $C$DW$309       .dwtag  DW_TAG_member
    3550                            .dwattr $C$DW$309, DW_AT_type(*$C$DW$T$23)
    3551                            .dwattr $C$DW$309, DW_AT_name("fastResponse")
    3552                            .dwattr $C$DW$309, DW_AT_TI_symbol_name("fastResponse")
    3553                            .dwattr $C$DW$309, DW_AT_data_member_location[DW_OP_plus_uconst 0x10]
    3554                            .dwattr $C$DW$309, DW_AT_accessibility(DW_ACCESS_public)
    3555                            .dwattr $C$DW$309, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3556                            .dwattr $C$DW$309, DW_AT_decl_line(0xe4)
    3557                            .dwattr $C$DW$309, DW_AT_decl_column(0x0e)
    3558                    $C$DW$310       .dwtag  DW_TAG_member
    3559                            .dwattr $C$DW$310, DW_AT_type(*$C$DW$T$47)
    3560                            .dwattr $C$DW$310, DW_AT_name("harrisResponse")
    3561                            .dwattr $C$DW$310, DW_AT_TI_symbol_name("harrisResponse")
    3562                            .dwattr $C$DW$310, DW_AT_data_member_location[DW_OP_plus_uconst 0x14]
    3563                            .dwattr $C$DW$310, DW_AT_accessibility(DW_ACCESS_public)
    3564                            .dwattr $C$DW$310, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3565                            .dwattr $C$DW$310, DW_AT_decl_line(0xe5)
    3566                            .dwattr $C$DW$310, DW_AT_decl_column(0x0e)
    3567                    $C$DW$311       .dwtag  DW_TAG_member
    3568                            .dwattr $C$DW$311, DW_AT_type(*$C$DW$T$54)
    3569                            .dwattr $C$DW$311, DW_AT_name("descriptor")
    3570                            .dwattr $C$DW$311, DW_AT_TI_symbol_name("descriptor")
    3571                            .dwattr $C$DW$311, DW_AT_data_member_location[DW_OP_plus_uconst 0x16]
    3572                            .dwattr $C$DW$311, DW_AT_accessibility(DW_ACCESS_public)
    3573                            .dwattr $C$DW$311, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3574                            .dwattr $C$DW$311, DW_AT_decl_line(0xe6)
    3575                            .dwattr $C$DW$311, DW_AT_decl_column(0x0e)
    3576                            .dwendtag $C$DW$T$55
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   73

    3577                    
    3578                            .dwattr $C$DW$T$55, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3579                            .dwattr $C$DW$T$55, DW_AT_decl_line(0xdb)
    3580                            .dwattr $C$DW$T$55, DW_AT_decl_column(0x10)
    3581                    $C$DW$T$56      .dwtag  DW_TAG_typedef, DW_AT_name("CORBFeature")
    3582                            .dwattr $C$DW$T$56, DW_AT_type(*$C$DW$T$55)
    3583                            .dwattr $C$DW$T$56, DW_AT_language(DW_LANG_C)
    3584                            .dwattr $C$DW$T$56, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3585                            .dwattr $C$DW$T$56, DW_AT_decl_line(0xe7)
    3586                            .dwattr $C$DW$T$56, DW_AT_decl_column(0x02)
    3587                    $C$DW$T$57      .dwtag  DW_TAG_pointer_type
    3588                            .dwattr $C$DW$T$57, DW_AT_type(*$C$DW$T$56)
    3589                            .dwattr $C$DW$T$57, DW_AT_address_class(0x20)
    3590                    
    3591                    $C$DW$T$58      .dwtag  DW_TAG_structure_type
    3592                            .dwattr $C$DW$T$58, DW_AT_byte_size(0x08)
    3593                    $C$DW$312       .dwtag  DW_TAG_member
    3594                            .dwattr $C$DW$312, DW_AT_type(*$C$DW$T$57)
    3595                            .dwattr $C$DW$312, DW_AT_name("features")
    3596                            .dwattr $C$DW$312, DW_AT_TI_symbol_name("features")
    3597                            .dwattr $C$DW$312, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3598                            .dwattr $C$DW$312, DW_AT_accessibility(DW_ACCESS_public)
    3599                            .dwattr $C$DW$312, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3600                            .dwattr $C$DW$312, DW_AT_decl_line(0xed)
    3601                            .dwattr $C$DW$312, DW_AT_decl_column(0x12)
    3602                    $C$DW$313       .dwtag  DW_TAG_member
    3603                            .dwattr $C$DW$313, DW_AT_type(*$C$DW$T$23)
    3604                            .dwattr $C$DW$313, DW_AT_name("n_features")
    3605                            .dwattr $C$DW$313, DW_AT_TI_symbol_name("n_features")
    3606                            .dwattr $C$DW$313, DW_AT_data_member_location[DW_OP_plus_uconst 0x4]
    3607                            .dwattr $C$DW$313, DW_AT_accessibility(DW_ACCESS_public)
    3608                            .dwattr $C$DW$313, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..\
    3609                            .dwattr $C$DW$313, DW_AT_decl_line(0xee)
    3610                            .dwattr $C$DW$313, DW_AT_decl_column(0x12)
    3611                            .dwendtag $C$DW$T$58
    3612                    
    3613                            .dwattr $C$DW$T$58, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3614                            .dwattr $C$DW$T$58, DW_AT_decl_line(0xec)
    3615                            .dwattr $C$DW$T$58, DW_AT_decl_column(0x10)
    3616                    $C$DW$T$86      .dwtag  DW_TAG_typedef, DW_AT_name("CORBOutput")
    3617                            .dwattr $C$DW$T$86, DW_AT_type(*$C$DW$T$58)
    3618                            .dwattr $C$DW$T$86, DW_AT_language(DW_LANG_C)
    3619                            .dwattr $C$DW$T$86, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3620                            .dwattr $C$DW$T$86, DW_AT_decl_line(0xef)
    3621                            .dwattr $C$DW$T$86, DW_AT_decl_column(0x02)
    3622                    
    3623                    $C$DW$T$61      .dwtag  DW_TAG_structure_type
    3624                            .dwattr $C$DW$T$61, DW_AT_byte_size(0x20)
    3625                    $C$DW$314       .dwtag  DW_TAG_member
    3626                            .dwattr $C$DW$314, DW_AT_type(*$C$DW$T$60)
    3627                            .dwattr $C$DW$314, DW_AT_name("val")
    3628                            .dwattr $C$DW$314, DW_AT_TI_symbol_name("val")
    3629                            .dwattr $C$DW$314, DW_AT_data_member_location[DW_OP_plus_uconst 0x0]
    3630                            .dwattr $C$DW$314, DW_AT_accessibility(DW_ACCESS_public)
    3631                            .dwattr $C$DW$314, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\../
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   74

    3632                            .dwattr $C$DW$314, DW_AT_decl_line(0x25)
    3633                            .dwattr $C$DW$314, DW_AT_decl_column(0x0c)
    3634                            .dwendtag $C$DW$T$61
    3635                    
    3636                            .dwattr $C$DW$T$61, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3637                            .dwattr $C$DW$T$61, DW_AT_decl_line(0x24)
    3638                            .dwattr $C$DW$T$61, DW_AT_decl_column(0x10)
    3639                    $C$DW$T$87      .dwtag  DW_TAG_typedef, DW_AT_name("RotationMatrix")
    3640                            .dwattr $C$DW$T$87, DW_AT_type(*$C$DW$T$61)
    3641                            .dwattr $C$DW$T$87, DW_AT_language(DW_LANG_C)
    3642                            .dwattr $C$DW$T$87, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3643                            .dwattr $C$DW$T$87, DW_AT_decl_line(0x26)
    3644                            .dwattr $C$DW$T$87, DW_AT_decl_column(0x02)
    3645                    $C$DW$T$2       .dwtag  DW_TAG_unspecified_type
    3646                            .dwattr $C$DW$T$2, DW_AT_name("void")
    3647                    $C$DW$T$3       .dwtag  DW_TAG_pointer_type
    3648                            .dwattr $C$DW$T$3, DW_AT_type(*$C$DW$T$2)
    3649                            .dwattr $C$DW$T$3, DW_AT_address_class(0x20)
    3650                    $C$DW$T$88      .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_PTR")
    3651                            .dwattr $C$DW$T$88, DW_AT_type(*$C$DW$T$3)
    3652                            .dwattr $C$DW$T$88, DW_AT_language(DW_LANG_C)
    3653                            .dwattr $C$DW$T$88, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\..
    3654                            .dwattr $C$DW$T$88, DW_AT_decl_line(0x5c)
    3655                            .dwattr $C$DW$T$88, DW_AT_decl_column(0x19)
    3656                    $C$DW$T$89      .dwtag  DW_TAG_const_type
    3657                            .dwattr $C$DW$T$89, DW_AT_type(*$C$DW$T$2)
    3658                    $C$DW$T$90      .dwtag  DW_TAG_pointer_type
    3659                            .dwattr $C$DW$T$90, DW_AT_type(*$C$DW$T$89)
    3660                            .dwattr $C$DW$T$90, DW_AT_address_class(0x20)
    3661                    $C$DW$T$4       .dwtag  DW_TAG_base_type
    3662                            .dwattr $C$DW$T$4, DW_AT_encoding(DW_ATE_boolean)
    3663                            .dwattr $C$DW$T$4, DW_AT_name("bool")
    3664                            .dwattr $C$DW$T$4, DW_AT_byte_size(0x01)
    3665                    $C$DW$T$5       .dwtag  DW_TAG_base_type
    3666                            .dwattr $C$DW$T$5, DW_AT_encoding(DW_ATE_signed_char)
    3667                            .dwattr $C$DW$T$5, DW_AT_name("signed char")
    3668                            .dwattr $C$DW$T$5, DW_AT_byte_size(0x01)
    3669                    $C$DW$T$120     .dwtag  DW_TAG_pointer_type
    3670                            .dwattr $C$DW$T$120, DW_AT_type(*$C$DW$T$5)
    3671                            .dwattr $C$DW$T$120, DW_AT_address_class(0x20)
    3672                    $C$DW$T$50      .dwtag  DW_TAG_typedef, DW_AT_name("int8_t")
    3673                            .dwattr $C$DW$T$50, DW_AT_type(*$C$DW$T$5)
    3674                            .dwattr $C$DW$T$50, DW_AT_language(DW_LANG_C)
    3675                            .dwattr $C$DW$T$50, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3676                            .dwattr $C$DW$T$50, DW_AT_decl_line(0x2a)
    3677                            .dwattr $C$DW$T$50, DW_AT_decl_column(0x1d)
    3678                    $C$DW$T$51      .dwtag  DW_TAG_pointer_type
    3679                            .dwattr $C$DW$T$51, DW_AT_type(*$C$DW$T$50)
    3680                            .dwattr $C$DW$T$51, DW_AT_address_class(0x20)
    3681                    $C$DW$T$134     .dwtag  DW_TAG_typedef, DW_AT_name("int_least8_t")
    3682                            .dwattr $C$DW$T$134, DW_AT_type(*$C$DW$T$50)
    3683                            .dwattr $C$DW$T$134, DW_AT_language(DW_LANG_C)
    3684                            .dwattr $C$DW$T$134, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3685                            .dwattr $C$DW$T$134, DW_AT_decl_line(0x39)
    3686                            .dwattr $C$DW$T$134, DW_AT_decl_column(0x17)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   75

    3687                    $C$DW$T$6       .dwtag  DW_TAG_base_type
    3688                            .dwattr $C$DW$T$6, DW_AT_encoding(DW_ATE_unsigned_char)
    3689                            .dwattr $C$DW$T$6, DW_AT_name("unsigned char")
    3690                            .dwattr $C$DW$T$6, DW_AT_byte_size(0x01)
    3691                    $C$DW$T$28      .dwtag  DW_TAG_pointer_type
    3692                            .dwattr $C$DW$T$28, DW_AT_type(*$C$DW$T$6)
    3693                            .dwattr $C$DW$T$28, DW_AT_address_class(0x20)
    3694                    $C$DW$T$19      .dwtag  DW_TAG_typedef, DW_AT_name("uint8_t")
    3695                            .dwattr $C$DW$T$19, DW_AT_type(*$C$DW$T$6)
    3696                            .dwattr $C$DW$T$19, DW_AT_language(DW_LANG_C)
    3697                            .dwattr $C$DW$T$19, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3698                            .dwattr $C$DW$T$19, DW_AT_decl_line(0x2b)
    3699                            .dwattr $C$DW$T$19, DW_AT_decl_column(0x1c)
    3700                    $C$DW$T$22      .dwtag  DW_TAG_pointer_type
    3701                            .dwattr $C$DW$T$22, DW_AT_type(*$C$DW$T$19)
    3702                            .dwattr $C$DW$T$22, DW_AT_address_class(0x20)
    3703                    $C$DW$T$136     .dwtag  DW_TAG_restrict_type
    3704                            .dwattr $C$DW$T$136, DW_AT_type(*$C$DW$T$22)
    3705                    
    3706                    $C$DW$T$54      .dwtag  DW_TAG_array_type
    3707                            .dwattr $C$DW$T$54, DW_AT_type(*$C$DW$T$19)
    3708                            .dwattr $C$DW$T$54, DW_AT_language(DW_LANG_C)
    3709                            .dwattr $C$DW$T$54, DW_AT_byte_size(0x20)
    3710                    $C$DW$315       .dwtag  DW_TAG_subrange_type
    3711                            .dwattr $C$DW$315, DW_AT_upper_bound(0x1f)
    3712                            .dwendtag $C$DW$T$54
    3713                    
    3714                    $C$DW$T$137     .dwtag  DW_TAG_const_type
    3715                            .dwattr $C$DW$T$137, DW_AT_type(*$C$DW$T$19)
    3716                    $C$DW$T$138     .dwtag  DW_TAG_pointer_type
    3717                            .dwattr $C$DW$T$138, DW_AT_type(*$C$DW$T$137)
    3718                            .dwattr $C$DW$T$138, DW_AT_address_class(0x20)
    3719                    $C$DW$T$139     .dwtag  DW_TAG_restrict_type
    3720                            .dwattr $C$DW$T$139, DW_AT_type(*$C$DW$T$138)
    3721                    $C$DW$T$140     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least8_t")
    3722                            .dwattr $C$DW$T$140, DW_AT_type(*$C$DW$T$19)
    3723                            .dwattr $C$DW$T$140, DW_AT_language(DW_LANG_C)
    3724                            .dwattr $C$DW$T$140, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3725                            .dwattr $C$DW$T$140, DW_AT_decl_line(0x3a)
    3726                            .dwattr $C$DW$T$140, DW_AT_decl_column(0x16)
    3727                    $C$DW$T$7       .dwtag  DW_TAG_base_type
    3728                            .dwattr $C$DW$T$7, DW_AT_encoding(DW_ATE_signed_char)
    3729                            .dwattr $C$DW$T$7, DW_AT_name("wchar_t")
    3730                            .dwattr $C$DW$T$7, DW_AT_byte_size(0x02)
    3731                    $C$DW$T$8       .dwtag  DW_TAG_base_type
    3732                            .dwattr $C$DW$T$8, DW_AT_encoding(DW_ATE_signed)
    3733                            .dwattr $C$DW$T$8, DW_AT_name("short")
    3734                            .dwattr $C$DW$T$8, DW_AT_byte_size(0x02)
    3735                    $C$DW$T$47      .dwtag  DW_TAG_typedef, DW_AT_name("int16_t")
    3736                            .dwattr $C$DW$T$47, DW_AT_type(*$C$DW$T$8)
    3737                            .dwattr $C$DW$T$47, DW_AT_language(DW_LANG_C)
    3738                            .dwattr $C$DW$T$47, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3739                            .dwattr $C$DW$T$47, DW_AT_decl_line(0x2c)
    3740                            .dwattr $C$DW$T$47, DW_AT_decl_column(0x1d)
    3741                    $C$DW$T$48      .dwtag  DW_TAG_pointer_type
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   76

    3742                            .dwattr $C$DW$T$48, DW_AT_type(*$C$DW$T$47)
    3743                            .dwattr $C$DW$T$48, DW_AT_address_class(0x20)
    3744                    $C$DW$T$141     .dwtag  DW_TAG_typedef, DW_AT_name("int_least16_t")
    3745                            .dwattr $C$DW$T$141, DW_AT_type(*$C$DW$T$47)
    3746                            .dwattr $C$DW$T$141, DW_AT_language(DW_LANG_C)
    3747                            .dwattr $C$DW$T$141, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3748                            .dwattr $C$DW$T$141, DW_AT_decl_line(0x3c)
    3749                            .dwattr $C$DW$T$141, DW_AT_decl_column(0x17)
    3750                    $C$DW$T$9       .dwtag  DW_TAG_base_type
    3751                            .dwattr $C$DW$T$9, DW_AT_encoding(DW_ATE_unsigned)
    3752                            .dwattr $C$DW$T$9, DW_AT_name("unsigned short")
    3753                            .dwattr $C$DW$T$9, DW_AT_byte_size(0x02)
    3754                    $C$DW$T$20      .dwtag  DW_TAG_typedef, DW_AT_name("uint16_t")
    3755                            .dwattr $C$DW$T$20, DW_AT_type(*$C$DW$T$9)
    3756                            .dwattr $C$DW$T$20, DW_AT_language(DW_LANG_C)
    3757                            .dwattr $C$DW$T$20, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3758                            .dwattr $C$DW$T$20, DW_AT_decl_line(0x2d)
    3759                            .dwattr $C$DW$T$20, DW_AT_decl_column(0x1c)
    3760                    $C$DW$T$21      .dwtag  DW_TAG_pointer_type
    3761                            .dwattr $C$DW$T$21, DW_AT_type(*$C$DW$T$20)
    3762                            .dwattr $C$DW$T$21, DW_AT_address_class(0x20)
    3763                    $C$DW$T$151     .dwtag  DW_TAG_typedef, DW_AT_name("uint_least16_t")
    3764                            .dwattr $C$DW$T$151, DW_AT_type(*$C$DW$T$20)
    3765                            .dwattr $C$DW$T$151, DW_AT_language(DW_LANG_C)
    3766                            .dwattr $C$DW$T$151, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3767                            .dwattr $C$DW$T$151, DW_AT_decl_line(0x3d)
    3768                            .dwattr $C$DW$T$151, DW_AT_decl_column(0x16)
    3769                    $C$DW$T$148     .dwtag  DW_TAG_typedef, DW_AT_name("wchar_t")
    3770                            .dwattr $C$DW$T$148, DW_AT_type(*$C$DW$T$9)
    3771                            .dwattr $C$DW$T$148, DW_AT_language(DW_LANG_C)
    3772                            .dwattr $C$DW$T$148, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3773                            .dwattr $C$DW$T$148, DW_AT_decl_line(0x53)
    3774                            .dwattr $C$DW$T$148, DW_AT_decl_column(0x1a)
    3775                    $C$DW$T$10      .dwtag  DW_TAG_base_type
    3776                            .dwattr $C$DW$T$10, DW_AT_encoding(DW_ATE_signed)
    3777                            .dwattr $C$DW$T$10, DW_AT_name("int")
    3778                            .dwattr $C$DW$T$10, DW_AT_byte_size(0x04)
    3779                    $C$DW$T$167     .dwtag  DW_TAG_typedef, DW_AT_name("fpos_t")
    3780                            .dwattr $C$DW$T$167, DW_AT_type(*$C$DW$T$10)
    3781                            .dwattr $C$DW$T$167, DW_AT_language(DW_LANG_C)
    3782                            .dwattr $C$DW$T$167, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3783                            .dwattr $C$DW$T$167, DW_AT_decl_line(0x53)
    3784                            .dwattr $C$DW$T$167, DW_AT_decl_column(0x0d)
    3785                    $C$DW$T$23      .dwtag  DW_TAG_typedef, DW_AT_name("int32_t")
    3786                            .dwattr $C$DW$T$23, DW_AT_type(*$C$DW$T$10)
    3787                            .dwattr $C$DW$T$23, DW_AT_language(DW_LANG_C)
    3788                            .dwattr $C$DW$T$23, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/includ
    3789                            .dwattr $C$DW$T$23, DW_AT_decl_line(0x2e)
    3790                            .dwattr $C$DW$T$23, DW_AT_decl_column(0x1d)
    3791                    $C$DW$T$161     .dwtag  DW_TAG_typedef, DW_AT_name("VLIB_CCHandle")
    3792                            .dwattr $C$DW$T$161, DW_AT_type(*$C$DW$T$23)
    3793                            .dwattr $C$DW$T$161, DW_AT_language(DW_LANG_C)
    3794                            .dwattr $C$DW$T$161, DW_AT_decl_file(".\..\packages\ti\vlib\src\VLIB_aFast_nonmaxSuppression\.
    3795                            .dwattr $C$DW$T$161, DW_AT_decl_line(0x77)
    3796                            .dwattr $C$DW$T$161, DW_AT_decl_column(0x11)
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   77

    3797                    
    3798                    $C$DW$T$37      .dwtag  DW_TAG_array_type
    3799                            .dwattr $C$DW$T$37, DW_AT_type(*$C$DW$T$23)
    3800                            .dwattr $C$DW$T$37, DW_AT_language(DW_LANG_C)
    3801                            .dwattr $C$DW$T$37, DW_AT_byte_size(0x2000)
    3802                    $C$DW$316       .dwtag  DW_TAG_subrange_type
    3803                            .dwattr $C$DW$316, DW_AT_upper_bound(0x7ff)
    3804                            .dwendtag $C$DW$T$37
    3805                    
    3806                    
    3807                    $C$DW$T$38      .dwtag  DW_TAG_array_type
    3808                            .dwattr $C$DW$T$38, DW_AT_type(*$C$DW$T$23)
    3809                            .dwattr $C$DW$T$38, DW_AT_language(DW_LANG_C)
    3810                            .dwattr $C$DW$T$38, DW_AT_byte_size(0x3c000)
    3811                    $C$DW$317       .dwtag  DW_TAG_subrange_type
    3812                            .dwattr $C$DW$317, DW_AT_upper_bound(0x1d)
    3813                    $C$DW$318       .dwtag  DW_TAG_subrange_type
    3814                            .dwattr $C$DW$318, DW_AT_upper_bound(0x7ff)
    3815                            .dwendtag $C$DW$T$38
    3816                    
    3817                    
    3818                    $C$DW$T$39      .dwtag  DW_TAG_array_type
    3819                            .dwattr $C$DW$T$39, DW_AT_type(*$C$DW$T$23)
    3820                            .dwattr $C$DW$T$39, DW_AT_language(DW_LANG_C)
    3821                            .dwattr $C$DW$T$39, DW_AT_byte_size(0x1000)
    3822                    $C$DW$319       .dwtag  DW_TAG_subrange_type
    3823                            .dwattr $C$DW$319, DW_AT_upper_bound(0x3ff)
    3824                            .dwendtag $C$DW$T$39
    3825                    
    3826                    
    3827                    $C$DW$T$40      .dwtag  DW_TAG_array_type
    3828                            .dwattr $C$DW$T$40, DW_AT_type(*$C$DW$T$23)
    3829                            .dwattr $C$DW$T$40, DW_AT_language(DW_LANG_C)
    3830                            .dwattr $C$DW$T$40, DW_AT_byte_size(0x1e000)
    3831                    $C$DW$320       .dwtag  DW_TAG_subrange_type
    3832                            .dwattr $C$DW$320, DW_AT_upper_bound(0x1d)
    3833                    $C$DW$321       .dwtag  DW_TAG_subrange_type
    3834                            .dwattr $C$DW$321, DW_AT_upper_bound(0x3ff)
    3835                            .dwendtag $C$DW$T$40
    3836                    
    3837                    
    3838                    $C$DW$T$42      .dwtag  DW_TAG_array_type
    3839                            .dwattr $C$DW$T$42, DW_AT_type(*$C$DW$T$23)
    3840                            .dwattr $C$DW$T$42, DW_AT_language(DW_LANG_C)
    3841                            .dwattr $C$DW$T$42, DW_AT_byte_size(0x1e0)
    3842                    $C$DW$322       .dwtag  DW_TAG_subrange_type
    3843                            .dwattr $C$DW$322, DW_AT_upper_bound(0x77)
    3844                            .dwendtag $C$DW$T$42
    3845                    
    3846                    
    3847                    $C$DW$T$43      .dwtag  DW_TAG_array_type
    3848                            .dwattr $C$DW$T$43, DW_AT_type(*$C$DW$T$23)
    3849                            .dwattr $C$DW$T$43, DW_AT_language(DW_LANG_C)
    3850                            .dwattr $C$DW$T$43, DW_AT_byte_size(0x40)
    3851                    $C$DW$323       .dwtag  DW_TAG_subrange_type
TMS320C6x Assembler PC v7.4.2 Thu Mar 19 12:38:27 2015

Tools Copyright (c) 1996-2012 Texas Instruments Incorporated
package/lib/Regression/regress_d_c/./../packages/ti/vlib/src/VLIB_aFast_nonmaxSuppression/VLIB_aFast_nonmaxSuppression_d.se66 PAGE   78

    3852                            .dwattr $C$DW$323, DW_AT_upper_bound(0x0f)
    3853                            .dwendtag $C$DW$T$43
    3854                    
    3855                    
    3856                    $C$DW$T$62      .dwtag  DW_TAG_array_type
    3857                            .dwattr $C$DW$T$62, DW_AT_type(*$C$DW$T$23)
    3858                            .dwattr $C$DW$T$62, DW_AT_language(DW_LANG_C)
    3859                            .dwattr $C$DW$T$62, DW_AT_byte_size(0x10)
    3860                    $C$DW$324       .dwtag  DW_TAG_subrange_type
    3861                            .dwattr $C$DW$324, DW_AT_upper_bound(0x03)
    3862                            .dwendtag $C$DW$T$62
    3863                    
    3864                    $C$DW$T$116     .dwtag  DW_TAG_pointer_type
    3865                            .dwattr $C$DW$T$116, DW_AT_type(*$C$DW$T$23)
    3866                            .dwattr $C$DW$T$116, DW_AT_address_class(0x20)
    3867                    $C$DW$T$162     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast16_t")
    3868                            .dwattr $C$DW$T$162, DW_AT_type(*$C$DW$T$23)
    3869                            .dwattr $C$DW$T$162, DW_AT_language(DW_LANG_C)
    3870                            .dwattr $C$DW$T$162, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3871                            .dwattr $C$DW$T$162, DW_AT_decl_line(0x4b)
    3872                            .dwattr $C$DW$T$162, DW_AT_decl_column(0x17)
    3873                    $C$DW$T$163     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast32_t")
    3874                            .dwattr $C$DW$T$163, DW_AT_type(*$C$DW$T$23)
    3875                            .dwattr $C$DW$T$163, DW_AT_language(DW_LANG_C)
    3876                            .dwattr $C$DW$T$163, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
    3877                            .dwattr $C$DW$T$163, DW_AT_decl_line(0x4e)
    3878                            .dwattr $C$DW$T$163, DW_AT_decl_column(0x17)
    3879                    $C$DW$T$164     .dwtag  DW_TAG_typedef, DW_AT_name("int_fast8_t")
    3880                            .dwattr $C$DW$T$164, DW_AT_type(*$C$DW$T$23)
    3881                            .dwattr $C$DW$T$164, DW_AT_language(DW_LANG_C)
    3882                            .dwattr $C$DW$T$164, DW_AT_decl_file("C:/VLIB_Tools/CCSV5_4_0/ccsv5/tools/compiler/C6000/inclu
